export const jobTypes = [
    {
        'code': '0101',
        'val': '国家机关、党政团体'
    },
    {
        'code': '0102',
        'val': '事业单位'
    },
    {
        'code': '0103',
        'val': '企业单位'
    },
    {
        'code': '0104',
        'val': '民间组织和社会团体'
    },
    {
        'code': '0201',
        'val': '农业生产人员'
    },
    {
        'code': '0202',
        'val': '农业技术人员'
    },
    {
        'code': '0203',
        'val': '农林专用机械操作人员'
    },
    {
        'code': '0204',
        'val': '农业加工制造人员'
    },
    {
        'code': '0205',
        'val': '畜牧业饲养人员'
    },
    {
        'code': '0206',
        'val': '畜牧业技术人员'
    },
    {
        'code': '0207',
        'val': '草业生产服务人员'
    },
    {
        'code': '0208',
        'val': '渔业养殖人员'
    },
    {
        'code': '0209',
        'val': '渔业技术人员'
    },
    {
        'code': '0210',
        'val': '渔业加工人员'
    },
    {
        'code': '0211',
        'val': '渔业捕捞人员'
    },
    {
        'code': '0301',
        'val': '林业工程技术人员'
    },
    {
        'code': '0302',
        'val': '森林砍伐业'
    },
    {
        'code': '0303',
        'val': '木材加工业'
    },
    {
        'code': '0304',
        'val': '人造板生产'
    },
    {
        'code': '0305',
        'val': '木材制品/家俱制作'
    },
    {
        'code': '0306',
        'val': '森林资源管护人员'
    },
    {
        'code': '0307',
        'val': '野生动植物保护及自然保护区人员'
    },
    {
        'code': '0308',
        'val': '林业'
    },
    {
        'code': '0401',
        'val': '地质勘探人员'
    },
    {
        'code': '0402',
        'val': '地质测量'
    },
    {
        'code': '0403',
        'val': '盐业生产'
    },
    {
        'code': '0404',
        'val': '矿物处理人员'
    },
    {
        'code': '0405',
        'val': '坑外作业'
    },
    {
        'code': '0406',
        'val': '陆上油矿开采业'
    },
    {
        'code': '0407',
        'val': '海上油矿开采业'
    },
    {
        'code': '0501',
        'val': '公路运输及设备操作'
    },
    {
        'code': '0502',
        'val': '铁路运输及设备操作'
    },
    {
        'code': '0503',
        'val': '水上运输业及设备操作'
    },
    {
        'code': '0504',
        'val': '空中运输业及设备操作'
    },
    {
        'code': '0601',
        'val': '建筑公司（土木工程）'
    },
    {
        'code': '0602',
        'val': '建筑物维修及管理人员'
    },
    {
        'code': '0603',
        'val': '铁路道路铺设'
    },
    {
        'code': '0604',
        'val': '电梯升降梯'
    },
    {
        'code': '0605',
        'val': '装璜业'
    },
    {
        'code': '0606',
        'val': '安装及其他'
    },
    {
        'code': '0607',
        'val': '测绘工程'
    },
    {
        'code': '0608',
        'val': '水泥(含石灰/石膏)'
    },
    {
        'code': '0609',
        'val': '墙体屋面材料生产'
    },
    {
        'code': '0610',
        'val': '防水/保温/吸音材料生产'
    },
    {
        'code': '0611',
        'val': '耐火材料生产'
    },
    {
        'code': '0701',
        'val': '冶金工程技术人员'
    },
    {
        'code': '0704',
        'val': '铁合金冶炼'
    },
    {
        'code': '0705',
        'val': '重有色金属冶炼'
    },
    {
        'code': '0706',
        'val': '轻有色金属冶炼'
    },
    {
        'code': '0707',
        'val': '稀贵金属冶炼'
    },
    {
        'code': '0708',
        'val': '半导体材料制备'
    },
    {
        'code': '0709',
        'val': '金属轧制'
    },
    {
        'code': '0710',
        'val': '铸铁管生产'
    },
    {
        'code': '0711',
        'val': '碳素制品生产'
    },
    {
        'code': '0713',
        'val': '其他金属冶炼、轧制'
    },
    {
        'code': '0714',
        'val': '机械制造加工业'
    },
    {
        'code': '0715',
        'val': '电子/电子元器件工程技术人员'
    },
    {
        'code': '0716',
        'val': '电子元器件制造'
    },
    {
        'code': '0717',
        'val': '电机业'
    },
    {
        'code': '0718',
        'val': '电池制造'
    },
    {
        'code': '0719',
        'val': '电子设备装配/调试/修理'
    },
    {
        'code': '0720',
        'val': '电子产品维修'
    },
    {
        'code': '0721',
        'val': '基础件、部件装配人员'
    },
    {
        'code': '0722',
        'val': '机械设备装配人员'
    },
    {
        'code': '0723',
        'val': '电气元件及设备装配'
    },
    {
        'code': '0724',
        'val': '电子专用设备装配调试'
    },
    {
        'code': '0725',
        'val': '仪器仪表装配'
    },
    {
        'code': '0726',
        'val': '运输车辆装配'
    },
    {
        'code': '0727',
        'val': '膜法水处理设备制造'
    },
    {
        'code': '0728',
        'val': '日用机械电器制造装配'
    },
    {
        'code': '0730',
        'val': '兵器工程技术人员'
    },
    {
        'code': '0731',
        'val': '装甲车辆装试'
    },
    {
        'code': '0732',
        'val': '枪炮制造'
    },
    {
        'code': '0736',
        'val': '船舶制造'
    },
    {
        'code': '0737',
        'val': '航空产品装配/调试/试验'
    },
    {
        'code': '0738',
        'val': '导弹卫星装配测试'
    },
    {
        'code': '0739',
        'val': '火箭发动机装配试验'
    },
    {
        'code': '0740',
        'val': '航天器结构强度温度环境试验'
    },
    {
        'code': '0741',
        'val': '机械设备维修'
    },
    {
        'code': '0742',
        'val': '仪器仪表修理'
    },
    {
        'code': '0743',
        'val': '塑胶/橡胶业'
    },
    {
        'code': '0744',
        'val': '化学工业'
    },
    {
        'code': '0745',
        'val': '纺织/成衣/鞋帽/皮革业'
    },
    {
        'code': '0746',
        'val': '造纸/纸产品'
    },
    {
        'code': '0747',
        'val': '家具制造业'
    },
    {
        'code': '0748',
        'val': '食品/饮料/饲料制造业'
    },
    {
        'code': '0749',
        'val': '玻璃/陶瓷/搪瓷制制造业'
    },
    {
        'code': '0750',
        'val': '烟草制品加工业'
    },
    {
        'code': '0751',
        'val': '医疗用品/制药业'
    },
    {
        'code': '0752',
        'val': '工艺美术品制造业'
    },
    {
        'code': '0753',
        'val': '文体用品制造业'
    },
    {
        'code': '0801',
        'val': '广播电影电视技术人员'
    },
    {
        'code': '0802',
        'val': '记者'
    },
    {
        'code': '0803',
        'val': '编辑'
    },
    {
        'code': '0804',
        'val': '校对员'
    },
    {
        'code': '0805',
        'val': '播音及节目主持人员'
    },
    {
        'code': '0806',
        'val': '翻译'
    },
    {
        'code': '0807',
        'val': '图书资料与档案业务人员'
    },
    {
        'code': '0808',
        'val': '考古及文物保护'
    },
    {
        'code': '0809',
        'val': '印刷'
    },
    {
        'code': '0810',
        'val': '宗教人士'
    },
    {
        'code': '0811',
        'val': '新闻广告公关员'
    },
    {
        'code': '0812',
        'val': '计算机操作员'
    },
    {
        'code': '0813',
        'val': '其他新闻出版、文化工作人员'
    },
    {
        'code': '0814',
        'val': '广告从业人员'
    },
    {
        'code': '0901',
        'val': '医学研究人员'
    },
    {
        'code': '0902',
        'val': '西医医师'
    },
    {
        'code': '0903',
        'val': '中医医师'
    },
    {
        'code': '0904',
        'val': '中西医结合医师'
    },
    {
        'code': '0905',
        'val': '民族医师'
    },
    {
        'code': '0906',
        'val': '公共卫生医师'
    },
    {
        'code': '0907',
        'val': '药剂人员'
    },
    {
        'code': '0908',
        'val': '医疗技术人员'
    },
    {
        'code': '0909',
        'val': '护理人员'
    },
    {
        'code': '0910',
        'val': '其他卫生专业技术人员'
    },
    {
        'code': '0911',
        'val': '医药商品购销人员'
    },
    {
        'code': '0912',
        'val': '中药调剂人员'
    },
    {
        'code': '0913',
        'val': '医药商品储运人员'
    },
    {
        'code': '0914',
        'val': '医疗卫生辅助服务人员'
    },
    {
        'code': '1001',
        'val': '文艺创作和评论人员'
    },
    {
        'code': '1002',
        'val': '编导和音乐指挥人员'
    },
    {
        'code': '1003',
        'val': '演员'
    },
    {
        'code': '1004',
        'val': '乐器演奏员'
    },
    {
        'code': '1005',
        'val': '电影电视制作及舞台专业人员'
    },
    {
        'code': '1101',
        'val': '教育机构'
    },
    {
        'code': '1201',
        'val': '邮政'
    },
    {
        'code': '1202',
        'val': '电信通信业务人员'
    },
    {
        'code': '1203',
        'val': '水利'
    },
    {
        'code': '1204',
        'val': '自来水'
    },
    {
        'code': '1205',
        'val': '电力工程技术人员'
    },
    {
        'code': '1206',
        'val': '电力设备安装人员'
    },
    {
        'code': '1207',
        'val': '发电运行值班人员'
    },
    {
        'code': '1208',
        'val': '输电、配电、变电设备值班人员'
    },
    {
        'code': '1209',
        'val': '电力设备检修人员'
    },
    {
        'code': '1210',
        'val': '供用电人员'
    },
    {
        'code': '1211',
        'val': '生活生产电力设备安装、操作、修理人员'
    },
    {
        'code': '1212',
        'val': '石油、天然气开采人员'
    },
    {
        'code': '1213',
        'val': '石油工程技术人员'
    },
    {
        'code': '1214',
        'val': '液化气/煤气/天然气'
    },
    {
        'code': '1215',
        'val': '热力供应'
    },
    {
        'code': '1216',
        'val': '环境监测人员'
    },
    {
        'code': '1217',
        'val': '环境保护工程技术人员'
    },
    {
        'code': '1218',
        'val': '海洋环境调查与监测人员'
    },
    {
        'code': '1220',
        'val': '废物处理人员'
    },
    {
        'code': '1221',
        'val': '气象工程技术人员'
    },
    {
        'code': '1222',
        'val': '购销人员'
    },
    {
        'code': '1223',
        'val': '废旧物资回收利用人员'
    },
    {
        'code': '1224',
        'val': '保管人员'
    },
    {
        'code': '1225',
        'val': '储运人员'
    },
    {
        'code': '1226',
        'val': '日用机电维修员'
    },
    {
        'code': '1227',
        'val': '办公设备维修工'
    },
    {
        'code': '1228',
        'val': '其他设备维修人员'
    },
    {
        'code': '1301',
        'val': '商业'
    },
    {
        'code': '1401',
        'val': '银行业'
    },
    {
        'code': '1402',
        'val': '保险业'
    },
    {
        'code': '1403',
        'val': '证券业'
    },
    {
        'code': '1404',
        'val': '其他金融人员'
    },
    {
        'code': '1501',
        'val': '旅游/旅馆业'
    },
    {
        'code': '1502',
        'val': '餐饮业'
    },
    {
        'code': '1503',
        'val': '健身和娱乐场所服务人员'
    },
    {
        'code': '1504',
        'val': '高尔夫球馆'
    },
    {
        'code': '1505',
        'val': '保龄球馆'
    },
    {
        'code': '1506',
        'val': '撞球馆'
    },
    {
        'code': '1507',
        'val': '游泳池'
    },
    {
        'code': '1508',
        'val': '海水浴场'
    },
    {
        'code': '1509',
        'val': '游乐园动物园'
    },
    {
        'code': '1510',
        'val': '娱乐场所'
    },
    {
        'code': '1511',
        'val': '营业、推销人员'
    },
    {
        'code': '1512',
        'val': '采购人员'
    },
    {
        'code': '1513',
        'val': '酒店服务部人员'
    },
    {
        'code': '1514',
        'val': '旅游及公共游览场所服务人员'
    },
    {
        'code': '1515',
        'val': '美容美发人员'
    },
    {
        'code': '1516',
        'val': '摄影服务人员'
    },
    {
        'code': '1517',
        'val': '验光配镜人员'
    },
    {
        'code': '1518',
        'val': '洗染织补人员'
    },
    {
        'code': '1519',
        'val': '印章刻字人员'
    },
    {
        'code': '1520',
        'val': '房地产'
    },
    {
        'code': '1521',
        'val': '殡葬服务人员'
    },
    {
        'code': '1522',
        'val': '社会中介服务人员'
    },
    {
        'code': '1523',
        'val': '物业管理员'
    },
    {
        'code': '1524',
        'val': '环境卫生人员'
    },
    {
        'code': '1525',
        'val': '供水、供热及生活燃料供应服务人员'
    },
    {
        'code': '1526',
        'val': '拍卖、典当及租赁业务人员'
    },
    {
        'code': '1527',
        'val': '商品监督和市场管理人员'
    },
    {
        'code': '1528',
        'val': '经济业务人员'
    },
    {
        'code': '1529',
        'val': '物流、快递业'
    },
    {
        'code': '1530',
        'val': '宠物服务'
    },
    {
        'code': '1531',
        'val': '其他商业、服务业人员'
    },
    {
        'code': '1532',
        'val': '家政管理'
    },
    {
        'code': '1601',
        'val': '人民警察'
    },
    {
        'code': '1602',
        'val': '治安人员'
    },
    {
        'code': '1603',
        'val': '消防人员'
    },
    {
        'code': '1604',
        'val': '司法'
    },
    {
        'code': '1605',
        'val': '武装警察'
    },
    {
        'code': '1701',
        'val': '现役军人'
    },
    {
        'code': '1801',
        'val': '计算机与互联网业'
    },
    {
        'code': '1901',
        'val': '保龄球运动'
    },
    {
        'code': '1902',
        'val': '桌球运动'
    },
    {
        'code': '1903',
        'val': '羽毛球运动'
    },
    {
        'code': '1904',
        'val': '游泳运动'
    },
    {
        'code': '1905',
        'val': '射箭运动'
    },
    {
        'code': '1906',
        'val': '网球运动'
    },
    {
        'code': '1907',
        'val': '垒球运动'
    },
    {
        'code': '1908',
        'val': '滑冰运动'
    },
    {
        'code': '1909',
        'val': '射击运动'
    },
    {
        'code': '1910',
        'val': '民族体育运动(不含竞技性)'
    },
    {
        'code': '1911',
        'val': '举重运动'
    },
    {
        'code': '1912',
        'val': '篮球运动'
    },
    {
        'code': '1913',
        'val': '排球运动'
    },
    {
        'code': '1914',
        'val': '棒球运动'
    },
    {
        'code': '1915',
        'val': '田径运动'
    },
    {
        'code': '1916',
        'val': '体操运动'
    },
    {
        'code': '1919',
        'val': '帆船运动'
    },
    {
        'code': '1920',
        'val': '划船运动'
    },
    {
        'code': '1921',
        'val': '泛舟运动'
    },
    {
        'code': '1922',
        'val': '巧固球运动'
    },
    {
        'code': '1923',
        'val': '手球运动'
    },
    {
        'code': '1924',
        'val': '风浪板运动'
    },
    {
        'code': '1926',
        'val': '足球运动'
    },
    {
        'code': '1927',
        'val': '曲棍球运动'
    },
    {
        'code': '1928',
        'val': '冰上曲棍球运动'
    },
    {
        'code': '1929',
        'val': '橄榄球'
    },
    {
        'code': '1930',
        'val': '乒乓球运动'
    },
    {
        'code': '1931',
        'val': '击剑运动'
    },
    {
        'code': '1932',
        'val': '水球运动'
    },
    {
        'code': '1934',
        'val': '摔跤运动'
    },
    {
        'code': '1935',
        'val': '拳击运动'
    },
    {
        'code': '1936',
        'val': '自行车运动'
    },
    {
        'code': '1937',
        'val': '裁判人员'
    },
    {
        'code': '1938',
        'val': '体育研究人员'
    },
    {
        'code': '1939',
        'val': '高尔夫球运动'
    },
    {
        'code': '1940',
        'val': '壁球'
    },
    {
        'code': '1941',
        'val': '滑草'
    },
    {
        'code': '1942',
        'val': '角力'
    },
    {
        'code': '1943',
        'val': '柔道'
    },
    {
        'code': '1944',
        'val': '空手道'
    },
    {
        'code': '1945',
        'val': '跆拳道'
    },
    {
        'code': '1946',
        'val': '武术'
    },
    {
        'code': '2001',
        'val': '自由职业者和无业'
    },
    {
        'code': '2002',
        'val': '个体经营'
    }
];


export const jobs = {
    '1001': [
        {
            'code': '1001001',
            'val': '文学、艺术研究人员'
        },
        {
            'code': '1001002',
            'val': '文学作家'
        },
        {
            'code': '1001003',
            'val': '曲艺作家'
        },
        {
            'code': '1001004',
            'val': '剧作家'
        },
        {
            'code': '1001005',
            'val': '作曲家'
        },
        {
            'code': '1001006',
            'val': '词作家'
        },
        {
            'code': '1001007',
            'val': '文艺评论员'
        },
        {
            'code': '1001008',
            'val': '皮影戏木偶戏作家'
        },
        {
            'code': '1001009',
            'val': '演奏人员'
        },
        {
            'code': '1001010',
            'val': '绘画人员'
        },
        {
            'code': '1001011',
            'val': '编曲人员'
        },
        {
            'code': '1001012',
            'val': '书法家'
        },
        {
            'code': '1001013',
            'val': '陶艺家'
        },
        {
            'code': '1001014',
            'val': '篆刻家'
        }
    ],
    '1002': [
        {
            'code': '1002001',
            'val': '电影电视导演'
        },
        {
            'code': '1002002',
            'val': '戏剧导演'
        },
        {
            'code': '1002003',
            'val': '舞蹈编导'
        },
        {
            'code': '1002004',
            'val': '音乐指挥'
        },
        {
            'code': '1002005',
            'val': '编剧'
        },
        {
            'code': '1002006',
            'val': '武术指导'
        }
    ],
    '1003': [
        {
            'code': '1003001',
            'val': '电影电视演员'
        },
        {
            'code': '1003002',
            'val': '戏剧演员'
        },
        {
            'code': '1003003',
            'val': '舞蹈演员'
        },
        {
            'code': '1003004',
            'val': '曲艺演员'
        },
        {
            'code': '1003005',
            'val': '杂技魔术演员'
        },
        {
            'code': '1003006',
            'val': '歌唱演员'
        },
        {
            'code': '1003007',
            'val': '皮影戏演员'
        },
        {
            'code': '1003008',
            'val': '木偶戏演员'
        },
        {
            'code': '1003015',
            'val': '一般替身演员'
        },
        {
            'code': '1003016',
            'val': '节目主持人'
        },
        {
            'code': '1003017',
            'val': '巡回演出戏剧团体人员'
        },
        {
            'code': '1003018',
            'val': '配音演员'
        },
        {
            'code': '1003019',
            'val': '服装模特'
        },
        {
            'code': '1003020',
            'val': '雕塑人员'
        },
        {
            'code': '1003021',
            'val': '马戏团演员'
        }
    ],
    '1004': [
        {
            'code': '1004001',
            'val': '民族乐器演奏员'
        },
        {
            'code': '1004002',
            'val': '外国乐器演奏员'
        }
    ],
    '1005': [
        {
            'code': '1005001',
            'val': '电影电视制片'
        },
        {
            'code': '1005002',
            'val': '电影电视场记'
        },
        {
            'code': '1005003',
            'val': '电影电视摄影师'
        },
        {
            'code': '1005004',
            'val': '照明师'
        },
        {
            'code': '1005005',
            'val': '录音师'
        },
        {
            'code': '1005006',
            'val': '剪辑师'
        },
        {
            'code': '1005007',
            'val': '美工师'
        },
        {
            'code': '1005008',
            'val': '化妆师'
        },
        {
            'code': '1005009',
            'val': '置景师'
        },
        {
            'code': '1005010',
            'val': '道具师'
        },
        {
            'code': '1005011',
            'val': '电影电视片发行人'
        },
        {
            'code': '1005012',
            'val': '舞台监督'
        },
        {
            'code': '1005013',
            'val': '戏剧制作人'
        },
        {
            'code': '1005014',
            'val': '影片商'
        },
        {
            'code': '1005015',
            'val': '灯光及音响工作人员'
        },
        {
            'code': '1005016',
            'val': '冲片人员'
        },
        {
            'code': '1005017',
            'val': '洗片人员'
        },
        {
            'code': '1005018',
            'val': '跑片员'
        },
        {
            'code': '1005020',
            'val': '机械工电工'
        },
        {
            'code': '1005021',
            'val': '影视设备机械员'
        },
        {
            'code': '1005023',
            'val': '有线广播电视机线员'
        },
        {
            'code': '1005024',
            'val': '广播电视编播工程技术人员'
        },
        {
            'code': '1005025',
            'val': '广播电视传输覆盖工程技术人员'
        },
        {
            'code': '1005026',
            'val': '电影工程技术人员'
        },
        {
            'code': '1005027',
            'val': '布景搭设人员'
        },
        {
            'code': '1005028',
            'val': '电影院售票员'
        },
        {
            'code': '1005029',
            'val': '电影院放映人员、服务人员'
        },
        {
            'code': '1005030',
            'val': '影视服装员'
        },
        {
            'code': '1005031',
            'val': '影视动画制作人员'
        },
        {
            'code': '1005032',
            'val': '影视木偶制作人员'
        },
        {
            'code': '1005033',
            'val': '电影洗印人员'
        },
        {
            'code': '1005034',
            'val': '拷贝字幕员'
        },
        {
            'code': '1005035',
            'val': '拷贝捡片员'
        },
        {
            'code': '1005036',
            'val': '唱式制作工人'
        },
        {
            'code': '1005037',
            'val': '唱片检听工人'
        },
        {
            'code': '1005038',
            'val': '音像带复制工人'
        },
        {
            'code': '1005039',
            'val': '光盘复制工人'
        }
    ],
    '1101': [
        {
            'code': '1101001',
            'val': '校长（教育机构负责人）'
        },
        {
            'code': '1101002',
            'val': '教师'
        },
        {
            'code': '1101003',
            'val': '学生'
        },
        {
            'code': '1101004',
            'val': '教育单位行政人员'
        },
        {
            'code': '1101005',
            'val': '校工'
        },
        {
            'code': '1101006',
            'val': '特殊教育教师（如聋哑老师）'
        },
        {
            'code': '1101007',
            'val': '家庭教师'
        },
        {
            'code': '1101008',
            'val': '保育员'
        },
        {
            'code': '1101009',
            'val': '教育科学研究人员'
        },
        {
            'code': '1101010',
            'val': '体育教师'
        },
        {
            'code': '1101011',
            'val': '武术学校学生'
        },
        {
            'code': '1101012',
            'val': '武术学校教练'
        },
        {
            'code': '1101013',
            'val': '戏曲舞蹈教师/学生'
        },
        {
            'code': '1101014',
            'val': '体校/技校教师/学生'
        },
        {
            'code': '1101015',
            'val': '杂技教师/学生'
        },
        {
            'code': '1101016',
            'val': '校车司机'
        },
        {
            'code': '1101017',
            'val': '军训教官'
        },
        {
            'code': '1101018',
            'val': '汽车驾驶训练班教练'
        }
    ],
    '1201': [
        {
            'code': '1201001',
            'val': '邮政营业员'
        },
        {
            'code': '1201002',
            'val': '邮件分检、接发员'
        },
        {
            'code': '1201003',
            'val': '内勤人员'
        },
        {
            'code': '1201004',
            'val': '外勤邮务人员'
        },
        {
            'code': '1201005',
            'val': '火车、汽车邮件押运员'
        },
        {
            'code': '1201006',
            'val': '轮船邮件押运员'
        },
        {
            'code': '1201007',
            'val': '报刊分发员'
        },
        {
            'code': '1201008',
            'val': '投递员(外勤)'
        },
        {
            'code': '1201009',
            'val': '投递员(内勤)'
        },
        {
            'code': '1201010',
            'val': '邮政储汇员'
        },
        {
            'code': '1201011',
            'val': '报刊发行、零售员'
        },
        {
            'code': '1201012',
            'val': '集邮业务员'
        },
        {
            'code': '1201013',
            'val': '邮政业务档案员'
        },
        {
            'code': '1201014',
            'val': '邮政设备安装、维护人员'
        },
        {
            'code': '1201015',
            'val': '包裹搬运人员'
        },
        {
            'code': '1201016',
            'val': '邮政工程技术人员'
        },
        {
            'code': '1201017',
            'val': '投递员（非摩托车、助动车驾驶）'
        },
        {
            'code': '1201019',
            'val': '包裹邮物人员'
        }
    ],
    '1202': [
        {
            'code': '1202003',
            'val': '电话电报交换机人员'
        },
        {
            'code': '1202004',
            'val': '电信业务营业员'
        },
        {
            'code': '1202005',
            'val': '话务员'
        },
        {
            'code': '1202006',
            'val': '报务员'
        },
        {
            'code': '1202007',
            'val': '通信设备维护人员'
        },
        {
            'code': '1202008',
            'val': '电话、通信天线架(敷)设/维修人员'
        },
        {
            'code': '1202009',
            'val': '电话电报交换设备安装、维护人员'
        },
        {
            'code': '1202010',
            'val': '电话机、寻呼机、传真机等用户终端设备维修员'
        },
        {
            'code': '1202011',
            'val': '通信系统供电设备/空调设备安装/维护人员'
        },
        {
            'code': '1202012',
            'val': '市话障碍处理人员'
        },
        {
            'code': '1202013',
            'val': '电信装置维护修理工'
        },
        {
            'code': '1202014',
            'val': '电信工程设施架设人员'
        },
        {
            'code': '1202015',
            'val': '通信工程技术人员'
        }
    ],
    '1203': [
        {
            'code': '1203001',
            'val': '工程师'
        },
        {
            'code': '1203002',
            'val': '水坝/水库管理人员'
        },
        {
            'code': '1203003',
            'val': '水利工程设施人员'
        },
        {
            'code': '1203005',
            'val': '混凝土工程维修工'
        },
        {
            'code': '1203006',
            'val': '土石工程维修工'
        },
        {
            'code': '1203007',
            'val': '水工检测工'
        },
        {
            'code': '1203008',
            'val': '建(构)筑物有害动物防治工'
        },
        {
            'code': '1203009',
            'val': '农田灌排施工/管护人员'
        },
        {
            'code': '1203010',
            'val': '渠道维护工'
        },
        {
            'code': '1203011',
            'val': '灌区供水工'
        },
        {
            'code': '1203012',
            'val': '灌溉试验工'
        },
        {
            'code': '1203013',
            'val': '河道堤坝巡护人员'
        },
        {
            'code': '1203014',
            'val': '水土保持防治工'
        },
        {
            'code': '1203015',
            'val': '水土保持测试工'
        },
        {
            'code': '1203016',
            'val': '水土保持勘测工'
        },
        {
            'code': '1203017',
            'val': '水文勘测工'
        },
        {
            'code': '1203018',
            'val': '水文勘测船工'
        },
        {
            'code': '1203020',
            'val': '水资源工程技术人员'
        },
        {
            'code': '1203021',
            'val': '治河及泥沙治理工程技术人员'
        },
        {
            'code': '1203022',
            'val': '机泵操作人员'
        },
        {
            'code': '1203023',
            'val': '农田灌排工程建设管理维护人员'
        },
        {
            'code': '1203024',
            'val': '水土保持作业人员'
        }
    ],
    '1204': [
        {
            'code': '1204001',
            'val': '工程师'
        },
        {
            'code': '1204002',
            'val': '自来水管装修人员'
        },
        {
            'code': '1204003',
            'val': '抄表员、收费员、巡水员'
        },
        {
            'code': '1204004',
            'val': '自来水厂水质分析员(实地)'
        },
        {
            'code': '1204005',
            'val': '工业及饮用水净化处理人员'
        },
        {
            'code': '1204006',
            'val': '工业及饮用水生产人员(水井工)'
        },
        {
            'code': '1204007',
            'val': '供水调度员'
        }
    ],
    '1205': [
        {
            'code': '1205001',
            'val': '发电/变电/输电工程技术人员'
        },
        {
            'code': '1205002',
            'val': '供用电工程技术人员'
        },
        {
            'code': '1205003',
            'val': '电力拖动与自动控制工程技术人员'
        },
        {
            'code': '1205004',
            'val': '电线电缆与电工材料工程技术人员'
        }
    ],
    '1206': [
        {
            'code': '1206001',
            'val': '水轮机设备安装工'
        },
        {
            'code': '1206003',
            'val': '汽轮机设备安装工'
        },
        {
            'code': '1206009',
            'val': '电力工程内线安装工'
        },
        {
            'code': '1206010',
            'val': '小风电利用工'
        },
        {
            'code': '1206011',
            'val': '微水电利用工'
        },
        {
            'code': '1206013',
            'val': '电缆施放员'
        }
    ],
    '1207': [
        {
            'code': '1207001',
            'val': '水轮发电机值班员'
        },
        {
            'code': '1207002',
            'val': '燃料值班员'
        },
        {
            'code': '1207003',
            'val': '锅炉运行值班员'
        },
        {
            'code': '1207004',
            'val': '锅炉辅机值班员'
        },
        {
            'code': '1207005',
            'val': '汽轮机运行值班员'
        },
        {
            'code': '1207006',
            'val': '热力网值班员'
        },
        {
            'code': '1207007',
            'val': '电气值班员'
        },
        {
            'code': '1207008',
            'val': '集控值班员'
        },
        {
            'code': '1207009',
            'val': '发电机氢冷值班员'
        },
        {
            'code': '1207010',
            'val': '电厂水处理值班员'
        }
    ],
    '1208': [
        {
            'code': '1208003',
            'val': '调相机值班员'
        },
        {
            'code': '1208004',
            'val': '换流站值班员'
        }
    ],
    '1209': [
        {
            'code': '1209003',
            'val': '汽轮机本体设备检修工'
        },
        {
            'code': '1209004',
            'val': '汽轮机附属设备检修工'
        },
        {
            'code': '1209005',
            'val': '发电厂电动机检修工'
        },
        {
            'code': '1209006',
            'val': '水轮机检修工'
        },
        {
            'code': '1209007',
            'val': '水电站水力机械试验工'
        },
        {
            'code': '1209008',
            'val': '水电自动装置检修工'
        },
        {
            'code': '1209012',
            'val': '电气试验员'
        },
        {
            'code': '1209013',
            'val': '继电保护员'
        },
        {
            'code': '1209014',
            'val': '电力装置维护修理工'
        }
    ],
    '1210': [
        {
            'code': '1210001',
            'val': '电力负荷控制员'
        },
        {
            'code': '1210002',
            'val': '用电监察员'
        },
        {
            'code': '1210003',
            'val': '装表核算收费员'
        },
        {
            'code': '1210004',
            'val': '装表接电工'
        },
        {
            'code': '1210005',
            'val': '电能计量装置检修工'
        },
        {
            'code': '1210006',
            'val': '内勤人员'
        },
        {
            'code': '1210007',
            'val': '抄表员、收费员'
        }
    ],
    '1211': [
        {
            'code': '1211001',
            'val': '变电设备安装工'
        },
        {
            'code': '1211002',
            'val': '变配电室值班电工'
        },
        {
            'code': '1211003',
            'val': '常用电机检修工'
        }
    ],
    '1212': [
        {
            'code': '1212006',
            'val': '天然气净化工'
        }
    ],
    '1213': [
        {
            'code': '1213001',
            'val': '石油开采工程技术人员'
        },
        {
            'code': '1213002',
            'val': '石油储运工程技术人员'
        }
    ],
    '1214': [
        {
            'code': '1214001',
            'val': '负责人'
        },
        {
            'code': '1214002',
            'val': '店员'
        },
        {
            'code': '1214003',
            'val': '外务员'
        },
        {
            'code': '1214004',
            'val': '送货员'
        },
        {
            'code': '1214005',
            'val': '收费员/抄表员'
        },
        {
            'code': '1214006',
            'val': '安全检查员'
        },
        {
            'code': '1214007',
            'val': '仓库管理员'
        },
        {
            'code': '1214008',
            'val': '管线装修工'
        },
        {
            'code': '1214009',
            'val': '储气槽/分装厂工作人员'
        },
        {
            'code': '1214010',
            'val': '工程师'
        },
        {
            'code': '1214011',
            'val': '检查员'
        },
        {
            'code': '1214012',
            'val': '燃气器具制造工'
        }
    ],
    '1215': [
        {
            'code': '1215001',
            'val': '热力网工程师'
        }
    ],
    '1216': [
        {
            'code': '1216001',
            'val': '大气环境监测工'
        },
        {
            'code': '1216002',
            'val': '水环境监测工'
        },
        {
            'code': '1216003',
            'val': '土壤环境监测工'
        },
        {
            'code': '1216004',
            'val': '环境生物监测工'
        },
        {
            'code': '1216005',
            'val': '环境噪声及振动监测工'
        },
        {
            'code': '1216006',
            'val': '固体废物监测工'
        },
        {
            'code': '1216008',
            'val': '室内装饰装修质量检验员'
        },
        {
            'code': '1216009',
            'val': '室内环境治理员'
        }
    ],
    '1217': [
        {
            'code': '1217001',
            'val': '环境损害控制工程技术人员'
        },
        {
            'code': '1217002',
            'val': '环境监测工程技术人员'
        },
        {
            'code': '1217003',
            'val': '环境污染治理工程技术人员'
        }
    ],
    '1218': [
        {
            'code': '1218003',
            'val': '海洋水文气象观测员'
        }
    ],
    '1220': [
        {
            'code': '1220001',
            'val': '固体废物处理工'
        },
        {
            'code': '1220002',
            'val': '废水处理工'
        },
        {
            'code': '1220003',
            'val': '废气处理工'
        },
        {
            'code': '1220004',
            'val': '除尘设备运行工'
        }
    ],
    '1221': [
        {
            'code': '1221001',
            'val': '气象观测人员'
        },
        {
            'code': '1221002',
            'val': '天气预报人员'
        },
        {
            'code': '1221003',
            'val': '气候监测预测人员'
        },
        {
            'code': '1221004',
            'val': '应用气象人员'
        },
        {
            'code': '1221005',
            'val': '气象服务人员'
        }
    ],
    '1222': [
        {
            'code': '1222001',
            'val': '购销人员'
        }
    ],
    '1223': [
        {
            'code': '1223004',
            'val': '金属、化工废物回收人员'
        },
        {
            'code': '1223005',
            'val': '一般废旧物资回收人员'
        }
    ],
    '1224': [
        {
            'code': '1224001',
            'val': '保管员'
        },
        {
            'code': '1224002',
            'val': '理货员'
        },
        {
            'code': '1224003',
            'val': '商品养护员'
        },
        {
            'code': '1224004',
            'val': '保鲜员'
        },
        {
            'code': '1224005',
            'val': '冷藏工'
        },
        {
            'code': '1224006',
            'val': '货柜场检查员（立于货柜上）'
        },
        {
            'code': '1224007',
            'val': '起重机操作员（于控制室内）'
        },
        {
            'code': '1224008',
            'val': '起重机操作员'
        }
    ],
    '1225': [
        {
            'code': '1225001',
            'val': '商品储运员'
        },
        {
            'code': '1225002',
            'val': '商品护运员'
        }
    ],
    '1226': [
        {
            'code': '1226001',
            'val': '家用电子产品维修工'
        },
        {
            'code': '1226002',
            'val': '家用电器产品维修工'
        },
        {
            'code': '1226003',
            'val': '照相器材维修工'
        },
        {
            'code': '1226004',
            'val': '钟表维修工'
        },
        {
            'code': '1226005',
            'val': '乐器维修工'
        },
        {
            'code': '1226006',
            'val': '自行车维修工'
        }
    ],
    '1227': [
        {
            'code': '1227001',
            'val': '办公设备维修工'
        }
    ],
    '1228': [
        {
            'code': '1228001',
            'val': '其他设备维修人员'
        }
    ],
    '1301': [
        {
            'code': '1301001',
            'val': '普通摊商'
        },
        {
            'code': '1301002',
            'val': '厨具商'
        },
        {
            'code': '1301003',
            'val': '陶瓷器商'
        },
        {
            'code': '1301004',
            'val': '古董商'
        },
        {
            'code': '1301005',
            'val': '花卉商'
        },
        {
            'code': '1301006',
            'val': '米商'
        },
        {
            'code': '1301007',
            'val': '杂货商、烟商、酒商、塑料制品商、超市售货员'
        },
        {
            'code': '1301008',
            'val': '玻璃商'
        },
        {
            'code': '1301009',
            'val': '果菜商'
        },
        {
            'code': '1301010',
            'val': '石材商'
        },
        {
            'code': '1301011',
            'val': '建材商'
        },
        {
            'code': '1301012',
            'val': '铁材商'
        },
        {
            'code': '1301013',
            'val': '木材商'
        },
        {
            'code': '1301014',
            'val': '五金商'
        },
        {
            'code': '1301015',
            'val': '宠物商'
        },
        {
            'code': '1301016',
            'val': '电器商/电脑/手机商'
        },
        {
            'code': '1301017',
            'val': '水电卫生器材商'
        },
        {
            'code': '1301018',
            'val': '机车买卖商（不含修理）'
        },
        {
            'code': '1301019',
            'val': '汽车买卖商（不含修理）'
        },
        {
            'code': '1301020',
            'val': '车辆器材商（不含矿物油）'
        },
        {
            'code': '1301021',
            'val': '矿物油、香烛买卖商'
        },
        {
            'code': '1301022',
            'val': '眼镜商'
        },
        {
            'code': '1301023',
            'val': '食品商'
        },
        {
            'code': '1301024',
            'val': '文具商'
        },
        {
            'code': '1301025',
            'val': '布商'
        },
        {
            'code': '1301026',
            'val': '服饰买卖商'
        },
        {
            'code': '1301027',
            'val': '鱼贩'
        },
        {
            'code': '1301028',
            'val': '肉贩、牲畜商贩'
        },
        {
            'code': '1301029',
            'val': '屠宰'
        },
        {
            'code': '1301030',
            'val': '药品买卖商'
        },
        {
            'code': '1301031',
            'val': '医疗器械仪器商'
        },
        {
            'code': '1301032',
            'val': '化学原料商、农药买卖商'
        },
        {
            'code': '1301033',
            'val': '手工艺品买卖商'
        },
        {
            'code': '1301034',
            'val': '银楼珠宝、当铺负责人及工作人员'
        },
        {
            'code': '1301035',
            'val': '家具商'
        },
        {
            'code': '1301036',
            'val': '自行车买卖商'
        },
        {
            'code': '1301037',
            'val': '农具商'
        },
        {
            'code': '1301038',
            'val': '售货商'
        },
        {
            'code': '1301039',
            'val': '碾米商'
        },
        {
            'code': '1301040',
            'val': '体育用品及器材销售'
        },
        {
            'code': '1301041',
            'val': 'IT业销售人员'
        },
        {
            'code': '1301042',
            'val': '化学品销售商（非危险品）'
        },
        {
            'code': '1301043',
            'val': '负责人（燃气器具店）'
        },
        {
            'code': '1301044',
            'val': '店员（燃气器具店）'
        },
        {
            'code': '1301045',
            'val': '送货员（燃气器具店）'
        },
        {
            'code': '1301046',
            'val': '装饰工（燃气器具店）'
        },
        {
            'code': '1301047',
            'val': '瓦斯器具负责人'
        },
        {
            'code': '1301048',
            'val': '瓦斯器具店员'
        },
        {
            'code': '1301049',
            'val': '瓦斯器具送货员'
        },
        {
            'code': '1301050',
            'val': '瓦斯器具装设工'
        },
        {
            'code': '1301051',
            'val': '负责人及工作人员（液化燃气零售店）'
        },
        {
            'code': '1301052',
            'val': '送货员（液化燃气零售店）'
        },
        {
            'code': '1301054',
            'val': '液化瓦斯零售负责人'
        },
        {
            'code': '1301055',
            'val': '液化瓦斯零售店员'
        },
        {
            'code': '1301056',
            'val': '液化瓦斯送货员'
        },
        {
            'code': '1301058',
            'val': '液化瓦斯旧货收购人员'
        },
        {
            'code': '1301059',
            'val': '燃气矿物油销售人员（液化瓦斯零售店）'
        },
        {
            'code': '1301060',
            'val': '采购员'
        },
        {
            'code': '1301061',
            'val': '熟食店（使用道具者）'
        }
    ],
    '1401': [
        {
            'code': '1401001',
            'val': '银行货币发行员'
        },
        {
            'code': '1401002',
            'val': '银行国库业务人员'
        },
        {
            'code': '1401003',
            'val': '银行外汇管理员'
        },
        {
            'code': '1401004',
            'val': '银行清算员'
        },
        {
            'code': '1401005',
            'val': '银行信贷员'
        },
        {
            'code': '1401006',
            'val': '金融（销售及）外务员'
        },
        {
            'code': '1401007',
            'val': '征信人员'
        },
        {
            'code': '1401009',
            'val': '银行国外业务人员'
        },
        {
            'code': '1401010',
            'val': '银行信托业务人员'
        },
        {
            'code': '1401011',
            'val': '银行信用卡业务人员'
        },
        {
            'code': '1401012',
            'val': '银行储蓄员'
        }
    ],
    '1402': [
        {
            'code': '1402001',
            'val': '精算师'
        },
        {
            'code': '1402002',
            'val': '保险推销员'
        },
        {
            'code': '1402003',
            'val': '保险核保员'
        },
        {
            'code': '1402004',
            'val': '保险核赔员'
        },
        {
            'code': '1402005',
            'val': '理赔调查员'
        },
        {
            'code': '1402006',
            'val': '保险收费员'
        }
    ],
    '1403': [
        {
            'code': '1403001',
            'val': '证券发行员'
        },
        {
            'code': '1403002',
            'val': '证券交易员'
        },
        {
            'code': '1403003',
            'val': '证券投资顾问'
        }
    ],
    '1404': [
        {
            'code': '1404001',
            'val': '其他金融人员'
        }
    ],
    '1501': [
        {
            'code': '1501001',
            'val': '一般内勤人员'
        },
        {
            'code': '1501002',
            'val': '外务员'
        },
        {
            'code': '1501003',
            'val': '导游、领队'
        },
        {
            'code': '1501004',
            'val': '司机'
        },
        {
            'code': '1501005',
            'val': '行政管理人员'
        },
        {
            'code': '1501006',
            'val': '负责人'
        },
        {
            'code': '1501007',
            'val': '一般内勤服务员'
        },
        {
            'code': '1501008',
            'val': '外务员'
        },
        {
            'code': '1501009',
            'val': '收帐员'
        },
        {
            'code': '1501010',
            'val': '技工'
        },
        {
            'code': '1501012',
            'val': '前厅服务员'
        },
        {
            'code': '1501013',
            'val': '客房服务员'
        },
        {
            'code': '1501014',
            'val': '旅店服务员'
        }
    ],
    '1502': [
        {
            'code': '1502001',
            'val': '中式烹调师'
        },
        {
            'code': '1502002',
            'val': '中式面点师'
        },
        {
            'code': '1502003',
            'val': '西式烹调师'
        },
        {
            'code': '1502004',
            'val': '西式面点师'
        },
        {
            'code': '1502005',
            'val': '调酒师'
        },
        {
            'code': '1502006',
            'val': '茶艺师'
        },
        {
            'code': '1502007',
            'val': '营养配餐员'
        },
        {
            'code': '1502008',
            'val': '餐厅服务员'
        },
        {
            'code': '1502009',
            'val': '餐具清洗保管员'
        },
        {
            'code': '1502010',
            'val': '其他餐饮服务人员'
        },
        {
            'code': '1502011',
            'val': '采购人员'
        },
        {
            'code': '1502012',
            'val': '厨师（星级酒店）'
        },
        {
            'code': '1502013',
            'val': '厨房杂工'
        },
        {
            'code': '1502014',
            'val': '经理人员'
        },
        {
            'code': '1502015',
            'val': '一般内勤'
        },
        {
            'code': '1502016',
            'val': '柜台人员'
        },
        {
            'code': '1502017',
            'val': '收帐员'
        }
    ],
    '1503': [
        {
            'code': '1503001',
            'val': '群众性体育活动指导员'
        },
        {
            'code': '1503002',
            'val': '体育场地维护、保养工'
        },
        {
            'code': '1503003',
            'val': '康乐服务员'
        },
        {
            'code': '1503004',
            'val': '保健按摩师'
        },
        {
            'code': '1503005',
            'val': '桑拿业负责人'
        },
        {
            'code': '1503006',
            'val': '桑拿业柜台人员'
        },
        {
            'code': '1503007',
            'val': '社会文化指导员'
        },
        {
            'code': '1503008',
            'val': '健身教练'
        },
        {
            'code': '1503009',
            'val': '芳香保健师'
        },
        {
            'code': '1503010',
            'val': '浴池服务人员'
        },
        {
            'code': '1503011',
            'val': '修脚师'
        }
    ],
    '1504': [
        {
            'code': '1504001',
            'val': '教练'
        },
        {
            'code': '1504002',
            'val': '球场保养人员'
        },
        {
            'code': '1504003',
            'val': '维护工人'
        },
        {
            'code': '1504004',
            'val': '球童'
        },
        {
            'code': '1504005',
            'val': '职业高尔夫球员'
        }
    ],
    '1505': [
        {
            'code': '1505001',
            'val': '记分员'
        },
        {
            'code': '1505002',
            'val': '柜台人员'
        },
        {
            'code': '1505003',
            'val': '机械保护员'
        },
        {
            'code': '1505004',
            'val': '清洁工人'
        }
    ],
    '1506': [
        {
            'code': '1506001',
            'val': '负责人'
        },
        {
            'code': '1506002',
            'val': '记分员'
        },
        {
            'code': '1506003',
            'val': '柜台人员'
        },
        {
            'code': '1506004',
            'val': '机械保护员'
        }
    ],
    '1507': [
        {
            'code': '1507001',
            'val': '负责人'
        },
        {
            'code': '1507002',
            'val': '管理员'
        },
        {
            'code': '1507003',
            'val': '教练'
        },
        {
            'code': '1507004',
            'val': '售票员'
        },
        {
            'code': '1507005',
            'val': '救生员'
        }
    ],
    '1508': [
        {
            'code': '1508001',
            'val': '管理员'
        },
        {
            'code': '1508002',
            'val': '负责人'
        },
        {
            'code': '1508005',
            'val': '售票员'
        }
    ],
    '1509': [
        {
            'code': '1509001',
            'val': '负责人'
        },
        {
            'code': '1509002',
            'val': '售票员'
        },
        {
            'code': '1509003',
            'val': '一般清洁工'
        },
        {
            'code': '1509004',
            'val': '游戏机操作员'
        },
        {
            'code': '1509005',
            'val': '兽栏清洁工'
        },
        {
            'code': '1509006',
            'val': '水电机械工'
        },
        {
            'code': '1509008',
            'val': '兽医(动物园)'
        },
        {
            'code': '1509009',
            'val': '观赏动物饲养工'
        },
        {
            'code': '1509010',
            'val': '训犬人员'
        }
    ],
    '1510': [
        {
            'code': '1510001',
            'val': '咖啡厅工作人员'
        },
        {
            'code': '1510002',
            'val': '茶室工作人员'
        },
        {
            'code': '1510003',
            'val': '酒家工作人员'
        },
        {
            'code': '1510004',
            'val': '夜总会工作人员'
        },
        {
            'code': '1510005',
            'val': '迪斯科舞厅工作人员'
        },
        {
            'code': '1510006',
            'val': '歌厅工作人员'
        },
        {
            'code': '1510007',
            'val': '酒吧工作人员'
        },
        {
            'code': '1510008',
            'val': '娱乐餐饮业负责人'
        },
        {
            'code': '1510009',
            'val': '保安人员'
        },
        {
            'code': '1510010',
            'val': '调酒师'
        },
        {
            'code': '1510011',
            'val': '乐队人员'
        },
        {
            'code': '1510012',
            'val': '歌唱人员'
        },
        {
            'code': '1510013',
            'val': 'DJ'
        },
        {
            'code': '1510014',
            'val': '迎宾'
        },
        {
            'code': '1510015',
            'val': '舞蹈演艺人员'
        },
        {
            'code': '1510016',
            'val': '电子游戏厅工作人员'
        },
        {
            'code': '1510018',
            'val': '网吧管理人员'
        },
        {
            'code': '1510019',
            'val': '按摩沐足/桑拿负责人'
        },
        {
            'code': '1510020',
            'val': '按摩沐足/桑拿柜台人员'
        },
        {
            'code': '1510021',
            'val': '按摩沐足/桑拿工作人员'
        },
        {
            'code': '1510022',
            'val': '负责人'
        }
    ],
    '1511': [
        {
            'code': '1511001',
            'val': '营业员'
        },
        {
            'code': '1511002',
            'val': '收银员'
        },
        {
            'code': '1511003',
            'val': '推销员'
        }
    ],
    '1512': [
        {
            'code': '1512001',
            'val': '采购员'
        },
        {
            'code': '1512002',
            'val': '收购员'
        },
        {
            'code': '1512003',
            'val': '中药购销员'
        }
    ],
    '1513': [
        {
            'code': '1513001',
            'val': '前厅服务员'
        },
        {
            'code': '1513002',
            'val': '客房服务员'
        },
        {
            'code': '1513003',
            'val': '旅店服务员'
        },
        {
            'code': '1513004',
            'val': '负责人'
        },
        {
            'code': '1513005',
            'val': '一般内勤'
        },
        {
            'code': '1513006',
            'val': '外务员'
        },
        {
            'code': '1513007',
            'val': '收帐员'
        },
        {
            'code': '1513008',
            'val': '技工'
        }
    ],
    '1514': [
        {
            'code': '1514001',
            'val': '导游'
        },
        {
            'code': '1514002',
            'val': '一般内勤'
        },
        {
            'code': '1514003',
            'val': '外务员'
        },
        {
            'code': '1514004',
            'val': '公共游览场所服务员'
        },
        {
            'code': '1514005',
            'val': '展览讲解员'
        },
        {
            'code': '1514006',
            'val': '插花员'
        },
        {
            'code': '1514007',
            'val': '盆景工'
        },
        {
            'code': '1514008',
            'val': '假山工'
        },
        {
            'code': '1514009',
            'val': '园林植物保护工'
        }
    ],
    '1515': [
        {
            'code': '1515001',
            'val': '美容师'
        },
        {
            'code': '1515002',
            'val': '美发师'
        }
    ],
    '1516': [
        {
            'code': '1516001',
            'val': '摄影师'
        },
        {
            'code': '1516002',
            'val': '冲印师'
        }
    ],
    '1517': [
        {
            'code': '1517001',
            'val': '眼镜验光员'
        },
        {
            'code': '1517002',
            'val': '眼镜定配员'
        }
    ],
    '1518': [
        {
            'code': '1518001',
            'val': '洗衣师'
        },
        {
            'code': '1518002',
            'val': '染色师'
        }
    ],
    '1519': [
        {
            'code': '1519001',
            'val': '刻字印章工'
        }
    ],
    '1520': [
        {
            'code': '1520001',
            'val': '经营管理者'
        },
        {
            'code': '1520002',
            'val': '室内工作人员'
        },
        {
            'code': '1520003',
            'val': '开发工作人员'
        },
        {
            'code': '1520004',
            'val': '租赁销售人员、度地房屋买卖介绍人'
        }
    ],
    '1521': [
        {
            'code': '1521001',
            'val': '殡仪服务员'
        },
        {
            'code': '1521002',
            'val': '尸体接运工'
        },
        {
            'code': '1521003',
            'val': '尸体防腐工'
        },
        {
            'code': '1521004',
            'val': '尸体整容工'
        },
        {
            'code': '1521005',
            'val': '尸体火化工'
        },
        {
            'code': '1521006',
            'val': '墓地管理员'
        },
        {
            'code': '1521007',
            'val': '殡葬车驾驶员'
        }
    ],
    '1522': [
        {
            'code': '1522001',
            'val': '中介代理人'
        },
        {
            'code': '1522002',
            'val': '职业指导员'
        },
        {
            'code': '1522003',
            'val': '其他社会中介服务人员'
        },
        {
            'code': '1522004',
            'val': '中介机构内勤人员'
        },
        {
            'code': '1522005',
            'val': '中介机构外勤人员'
        }
    ],
    '1523': [
        {
            'code': '1523001',
            'val': '物业管理员'
        }
    ],
    '1524': [
        {
            'code': '1524001',
            'val': '垃圾清运工'
        },
        {
            'code': '1524002',
            'val': '保洁工'
        },
        {
            'code': '1524003',
            'val': '下水道清洁工'
        },
        {
            'code': '1524004',
            'val': '清洁打蜡工人（地板）'
        },
        {
            'code': '1524006',
            'val': '汽车清洗、护理工'
        },
        {
            'code': '1524008',
            'val': '汽车美容'
        },
        {
            'code': '1524009',
            'val': '汽车维修'
        }
    ],
    '1525': [
        {
            'code': '1525001',
            'val': '供水生产工'
        },
        {
            'code': '1525002',
            'val': '供水供应工'
        },
        {
            'code': '1525003',
            'val': '生活燃料供应工'
        }
    ],
    '1526': [
        {
            'code': '1526001',
            'val': '鉴定估价师'
        },
        {
            'code': '1526002',
            'val': '拍卖师'
        },
        {
            'code': '1526003',
            'val': '典当业务员'
        },
        {
            'code': '1526004',
            'val': '租赁业务员'
        }
    ],
    '1527': [
        {
            'code': '1527001',
            'val': '商品监督员'
        },
        {
            'code': '1527002',
            'val': '市场管理员'
        }
    ],
    '1528': [
        {
            'code': '1528001',
            'val': '经济计划人员'
        },
        {
            'code': '1528002',
            'val': '统计人员'
        },
        {
            'code': '1528003',
            'val': '会计人员'
        },
        {
            'code': '1528004',
            'val': '审计人员'
        },
        {
            'code': '1528005',
            'val': '国际商务人员'
        },
        {
            'code': '1528006',
            'val': '公证员'
        },
        {
            'code': '1528007',
            'val': '公证行外务员'
        }
    ],
    '1529': [
        {
            'code': '1529001',
            'val': '物流专员'
        },
        {
            'code': '1529002',
            'val': '分拣员'
        },
        {
            'code': '1529003',
            'val': '收货、送货员（非四轮机动车）'
        },
        {
            'code': '1529004',
            'val': '收货、送货员（四轮机动车）'
        },
        {
            'code': '1529005',
            'val': '报关行外务员'
        }
    ],
    '1530': [
        {
            'code': '1530001',
            'val': '宠物医生'
        },
        {
            'code': '1530002',
            'val': '宠物训导师'
        },
        {
            'code': '1530003',
            'val': '宠物美容师'
        },
        {
            'code': '1530004',
            'val': '宠物健康护理人员'
        }
    ],
    '1531': [
        {
            'code': '1531001',
            'val': '其他商业、服务业人员'
        },
        {
            'code': '1531002',
            'val': '代书(内勤)'
        },
        {
            'code': '1531003',
            'val': '经纪人(内勤)'
        },
        {
            'code': '1531004',
            'val': '速录师'
        },
        {
            'code': '1531005',
            'val': '土地房屋买卖介绍人'
        },
        {
            'code': '1531007',
            'val': '景观设计师'
        },
        {
            'code': '1531008',
            'val': '钟表匠'
        },
        {
            'code': '1531009',
            'val': '鞋匠、伞匠'
        },
        {
            'code': '1531010',
            'val': '勘查师'
        },
        {
            'code': '1531011',
            'val': '警卫人员(工厂、公司行号、大楼)'
        },
        {
            'code': '1531012',
            'val': '大楼管理员'
        },
        {
            'code': '1531013',
            'val': '收费站、停车场收费人员'
        },
        {
            'code': '1531014',
            'val': '???油站工作人员'
        },
        {
            'code': '1531015',
            'val': '地磅场工作人员'
        },
        {
            'code': '1531016',
            'val': '健身房教练'
        },
        {
            'code': '1531017',
            'val': '健身房服务人员'
        },
        {
            'code': '1531018',
            'val': '搬运工（食品、日用品、服装等）'
        },
        {
            'code': '1531019',
            'val': '车辆保管人员'
        },
        {
            'code': '1531021',
            'val': '勤杂工'
        },
        {
            'code': '1531022',
            'val': '道路清洁工'
        }
    ],
    '1532': [
        {
            'code': '1532001',
            'val': '家政服务员'
        },
        {
            'code': '1532002',
            'val': '家庭主妇'
        },
        {
            'code': '1532003',
            'val': '儿童、非职业技术学校学生'
        },
        {
            'code': '1532004',
            'val': '职业技术学校学生'
        },
        {
            'code': '1532005',
            'val': '保姆'
        }
    ],
    '1601': [
        {
            'code': '1601001',
            'val': '警务行政及内勤人员'
        },
        {
            'code': '1601002',
            'val': '警察（负有巡逻任务者）'
        },
        {
            'code': '1601003',
            'val': '警卫人员 （负有巡逻押运任务者）'
        },
        {
            'code': '1601012',
            'val': '铁路警察'
        },
        {
            'code': '1601013',
            'val': '警校学生'
        },
        {
            'code': '1601014',
            'val': '警校教官'
        },
        {
            'code': '1601015',
            'val': '警校文职教师'
        },
        {
            'code': '1601017',
            'val': '安检人员'
        },
        {
            'code': '1601019',
            'val': '监狱看守所管理人员'
        },
        {
            'code': '1601020',
            'val': '情报、犯罪等信息调查人员(内勤不搜证)'
        },
        {
            'code': '1601023',
            'val': '行政执法人员'
        }
    ],
    '1602': [
        {
            'code': '1602001',
            'val': '保安员（不负责巡逻）'
        },
        {
            'code': '1602002',
            'val': '保安员（负责巡逻任务）'
        },
        {
            'code': '1602003',
            'val': '门卫'
        },
        {
            'code': '1602004',
            'val': '单位保卫科工作人员'
        },
        {
            'code': '1602006',
            'val': '违禁品检查员'
        },
        {
            'code': '1602008',
            'val': '工商、税务、海关、城管等特定国家行政执法人员'
        },
        {
            'code': '1602009',
            'val': '治安调查人员'
        },
        {
            'code': '1602010',
            'val': '交通协管员'
        },
        {
            'code': '1602013',
            'val': '抢险救援器材维修人员'
        },
        {
            'code': '1602014',
            'val': '火险监督员/防火审核员'
        },
        {
            'code': '1602015',
            'val': '物业管理人员'
        }
    ],
    '1603': [
        {
            'code': '1603003',
            'val': '防火员'
        },
        {
            'code': '1603007',
            'val': '抢险救援器材工具调配工'
        },
        {
            'code': '1603008',
            'val': '可燃气体（毒气）检测员、危险物品监督员'
        },
        {
            'code': '1603009',
            'val': '火灾嘹望观察员（嘹望塔）'
        }
    ],
    '1604': [
        {
            'code': '1604001',
            'val': '人民法院负责人'
        },
        {
            'code': '1604002',
            'val': '人民检察院负责人'
        },
        {
            'code': '1604003',
            'val': '法官'
        },
        {
            'code': '1604004',
            'val': '检察官'
        },
        {
            'code': '1604005',
            'val': '律师'
        },
        {
            'code': '1604006',
            'val': '公证员'
        },
        {
            'code': '1604007',
            'val': '法医'
        },
        {
            'code': '1604008',
            'val': '书记员'
        },
        {
            'code': '1604009',
            'val': '商业犯罪调查处理人员'
        }
    ],
    '1605': [
        {
            'code': '1605001',
            'val': '武警总部行政及内勤人员'
        }
    ],
    '1701': [
        {
            'code': '1701001',
            'val': '行政及内勤人员'
        },
        {
            'code': '1701002',
            'val': '一般地面部队人员（非前线）'
        },
        {
            'code': '1701004',
            'val': '军医院官兵（非前线）'
        },
        {
            'code': '1701005',
            'val': '后勤补给及通讯地勤人员（非前线）'
        },
        {
            'code': '1701006',
            'val': '军事研究单位纸上设计人员'
        },
        {
            'code': '1701011',
            'val': '宪兵（纠察）'
        },
        {
            'code': '1701012',
            'val': '通勤之行政及内勤人员(国防部、三军总部、军校教官等)'
        },
        {
            'code': '1701014',
            'val': '军事纠察'
        }
    ],
    '1801': [
        {
            'code': '1801001',
            'val': '计算机硬件技术人员'
        },
        {
            'code': '1801002',
            'val': '计算机软件技术人员'
        },
        {
            'code': '1801003',
            'val': '计算机网络技术人员'
        },
        {
            'code': '1801004',
            'val': '计算机系统分析技术人员'
        },
        {
            'code': '1801005',
            'val': '维护工程师'
        },
        {
            'code': '1801006',
            'val': '系统工程师'
        },
        {
            'code': '1801007',
            'val': '运维支持工程师'
        },
        {
            'code': '1801008',
            'val': '销售工程师'
        },
        {
            'code': '1801009',
            'val': '计算机乐谱制作师'
        },
        {
            'code': '1801010',
            'val': '数字视频合成师'
        },
        {
            'code': '1801011',
            'val': '互联网业经营管理及服务人员'
        },
        {
            'code': '1801012',
            'val': '计算机软件产品检验员'
        }
    ],
    '1901': [
        {
            'code': '1901001',
            'val': '教练员'
        },
        {
            'code': '1901002',
            'val': '保龄球球员'
        }
    ],
    '1902': [
        {
            'code': '1902001',
            'val': '教练员'
        },
        {
            'code': '1902002',
            'val': '桌球球员'
        }
    ],
    '1903': [
        {
            'code': '1903001',
            'val': '教练员'
        },
        {
            'code': '1903002',
            'val': '羽毛球球员'
        }
    ],
    '1904': [
        {
            'code': '1904001',
            'val': '教练员'
        },
        {
            'code': '1904002',
            'val': '游泳队员'
        },
        {
            'code': '1904003',
            'val': '花样游泳人员'
        },
        {
            'code': '1904004',
            'val': '其他游泳人员'
        }
    ],
    '1905': [
        {
            'code': '1905001',
            'val': '教练员'
        },
        {
            'code': '1905002',
            'val': '射箭运动员'
        }
    ],
    '1906': [
        {
            'code': '1906001',
            'val': '教练员'
        },
        {
            'code': '1906002',
            'val': '网球球员'
        }
    ],
    '1907': [
        {
            'code': '1907001',
            'val': '教练员'
        },
        {
            'code': '1907002',
            'val': '垒球球员'
        }
    ],
    '1908': [
        {
            'code': '1908001',
            'val': '教练员'
        },
        {
            'code': '1908002',
            'val': '滑冰运动员'
        },
        {
            'code': '1908003',
            'val': '速度滑冰人员'
        },
        {
            'code': '1908004',
            'val': '花样滑冰人员'
        }
    ],
    '1909': [
        {
            'code': '1909001',
            'val': '教练员'
        },
        {
            'code': '1909002',
            'val': '射击人员'
        }
    ],
    '1910': [
        {
            'code': '1910001',
            'val': '教练员'
        },
        {
            'code': '1910002',
            'val': '民族体育活动人员'
        }
    ],
    '1911': [
        {
            'code': '1911001',
            'val': '教练员'
        },
        {
            'code': '1911002',
            'val': '举重运动员'
        }
    ],
    '1912': [
        {
            'code': '1912001',
            'val': '教练员'
        },
        {
            'code': '1912002',
            'val': '篮球运动员'
        }
    ],
    '1913': [
        {
            'code': '1913001',
            'val': '教练员'
        },
        {
            'code': '1913002',
            'val': '排球运动员'
        }
    ],
    '1914': [
        {
            'code': '1914001',
            'val': '教练员'
        },
        {
            'code': '1914002',
            'val': '棒球运动员'
        }
    ],
    '1915': [
        {
            'code': '1915001',
            'val': '教练员'
        },
        {
            'code': '1915002',
            'val': '田径运动员'
        }
    ],
    '1916': [
        {
            'code': '1916001',
            'val': '教练员'
        },
        {
            'code': '1916002',
            'val': '体操运动员'
        }
    ],
    '1919': [
        {
            'code': '1919001',
            'val': '教练员'
        },
        {
            'code': '1919002',
            'val': '驾乘人员'
        }
    ],
    '1920': [
        {
            'code': '1920001',
            'val': '教练员'
        },
        {
            'code': '1920002',
            'val': '驾乘人员'
        }
    ],
    '1921': [
        {
            'code': '1921001',
            'val': '教练员'
        },
        {
            'code': '1921002',
            'val': '驾乘人员'
        }
    ],
    '1922': [
        {
            'code': '1922001',
            'val': '教练员'
        },
        {
            'code': '1922002',
            'val': '巧固球球员'
        }
    ],
    '1923': [
        {
            'code': '1923001',
            'val': '教练员'
        },
        {
            'code': '1923002',
            'val': '手球运动员'
        }
    ],
    '1924': [
        {
            'code': '1924001',
            'val': '教练员'
        },
        {
            'code': '1924002',
            'val': '驾乘人员'
        }
    ],
    '1926': [
        {
            'code': '1926001',
            'val': '教练员'
        }
    ],
    '1927': [
        {
            'code': '1927001',
            'val': '教练员'
        }
    ],
    '1928': [
        {
            'code': '1928001',
            'val': '教练员'
        }
    ],
    '1929': [
        {
            'code': '1929001',
            'val': '教练员'
        }
    ],
    '1930': [
        {
            'code': '1930001',
            'val': '教练员'
        },
        {
            'code': '1930002',
            'val': '乒乓球球员'
        }
    ],
    '1931': [
        {
            'code': '1931001',
            'val': '教练员'
        },
        {
            'code': '1931002',
            'val': '击剑运动员'
        }
    ],
    '1932': [
        {
            'code': '1932001',
            'val': '教练员'
        },
        {
            'code': '1932002',
            'val': '水球球员'
        }
    ],
    '1934': [
        {
            'code': '1934001',
            'val': '教练员'
        }
    ],
    '1935': [
        {
            'code': '1935001',
            'val': '教练员'
        }
    ],
    '1936': [
        {
            'code': '1936001',
            'val': '教练员'
        },
        {
            'code': '1936002',
            'val': '骑行人员'
        }
    ],
    '1937': [
        {
            'code': '1937001',
            'val': '裁判人员'
        }
    ],
    '1938': [
        {
            'code': '1938001',
            'val': '体育研究人员'
        }
    ],
    '1939': [
        {
            'code': '1939001',
            'val': '教练员'
        },
        {
            'code': '1939002',
            'val': '运动员'
        },
        {
            'code': '1939003',
            'val': '球童'
        }
    ],
    '1940': [
        {
            'code': '1940001',
            'val': '壁球人员'
        },
        {
            'code': '1940002',
            'val': '教练'
        }
    ],
    '1941': [
        {
            'code': '1941001',
            'val': '教练'
        },
        {
            'code': '1941002',
            'val': '滑草人员'
        }
    ],
    '1942': [
        {
            'code': '1942001',
            'val': '教练'
        }
    ],
    '1943': [
        {
            'code': '1943001',
            'val': '教练'
        }
    ],
    '1944': [
        {
            'code': '1944001',
            'val': '教练'
        }
    ],
    '1945': [
        {
            'code': '1945001',
            'val': '教练'
        }
    ],
    '1946': [
        {
            'code': '1946001',
            'val': '教练'
        }
    ],
    '2001': [
        {
            'code': '2001001',
            'val': '学龄前儿童'
        },
        {
            'code': '2001002',
            'val': '家族主妇、主夫'
        },
        {
            'code': '2001003',
            'val': '离退休人员（无兼职）'
        },
        {
            'code': '2001004',
            'val': '自由投资者'
        },
        {
            'code': '2001005',
            'val': '待业人员、下岗人员'
        },
        {
            'code': '2001006',
            'val': '自由职业人员'
        }
    ],
    '2002': [
        {
            'code': '2002001',
            'val': '个体经营与商贩（有固定摊位）'
        },
        {
            'code': '2002002',
            'val': '个体经营与商贩（无固定摊位）'
        },
        {
            'code': '2002003',
            'val': '私营企业主(不亲自作业)'
        }
    ],
    '0101': [
        {
            'code': '0101001',
            'val': '国家机关、党政团体单位负责人（不从事风险工作）'
        },
        {
            'code': '0101002',
            'val': '国家机关、党政团体单位职员（内勤）'
        },
        {
            'code': '0101003',
            'val': '国家机关、党政团体单位职员（外勤）'
        },
        {
            'code': '0101004',
            'val': '国家机关、党政团体单位职员（司机或维修人员）'
        }
    ],
    '0102': [
        {
            'code': '0102001',
            'val': '事业单位负责人（不从事风险工作）'
        },
        {
            'code': '0102002',
            'val': '事业单位职员（内勤）'
        },
        {
            'code': '0102003',
            'val': '事业单位职员（外勤）'
        },
        {
            'code': '0102004',
            'val': '事业单位职员（司机或维修人员）'
        },
        {
            'code': '0102005',
            'val': '工商/税务/城管人员'
        }
    ],
    '0103': [
        {
            'code': '0103001',
            'val': '企业单位负责人（不从事风险工作）'
        },
        {
            'code': '0103002',
            'val': '企业单位职员（内勤）'
        },
        {
            'code': '0103003',
            'val': '企业单位职员（外勤）'
        },
        {
            'code': '0103004',
            'val': '企业单位职员（司机或维修人员）'
        }
    ],
    '0104': [
        {
            'code': '0104001',
            'val': '民间组织和社会团体负责人'
        },
        {
            'code': '0104002',
            'val': '民间组织和社会团体职员（内勤）'
        },
        {
            'code': '0104003',
            'val': '民间组织和社会团体职员（外勤）'
        },
        {
            'code': '0104004',
            'val': '村委会、居委会人员'
        }
    ],
    '0201': [
        {
            'code': '0201001',
            'val': '农作物种植者（不亲自作业）'
        },
        {
            'code': '0201002',
            'val': '啤酒花生产工'
        },
        {
            'code': '0201003',
            'val': '作物种子繁育工'
        },
        {
            'code': '0201004',
            'val': '农作物病虫草害防治工'
        },
        {
            'code': '0201005',
            'val': '农场经营者(不亲自作业)'
        },
        {
            'code': '0201006',
            'val': '蔬菜园艺工'
        },
        {
            'code': '0201007',
            'val': '花卉园艺工'
        },
        {
            'code': '0201008',
            'val': '果、茶、桑园艺工'
        },
        {
            'code': '0201009',
            'val': '菌类园艺工'
        },
        {
            'code': '0201010',
            'val': '天然橡胶/剑麻生产人员'
        },
        {
            'code': '0201011',
            'val': '中药材种植员'
        },
        {
            'code': '0201012',
            'val': '中药材养殖员'
        },
        {
            'code': '0201013',
            'val': '中药材生产管理员'
        },
        {
            'code': '0201014',
            'val': '大田作物生产人员'
        },
        {
            'code': '0201015',
            'val': '农夫或农业工人'
        },
        {
            'code': '0201016',
            'val': '长短工'
        },
        {
            'code': '0201017',
            'val': '果农'
        },
        {
            'code': '0201018',
            'val': '苗圃栽培人员'
        },
        {
            'code': '0201019',
            'val': '花圃栽培人员'
        },
        {
            'code': '0201020',
            'val': '热带作物生产人员'
        },
        {
            'code': '0201021',
            'val': '昆虫（蜜蜂）饲养人员'
        },
        {
            'code': '0201022',
            'val': '割胶工人'
        },
        {
            'code': '0201025',
            'val': '实验室饲养人员'
        }
    ],
    '0202': [
        {
            'code': '0202001',
            'val': '农业科学研究人员'
        },
        {
            'code': '0202002',
            'val': '土壤肥料技术人员'
        },
        {
            'code': '0202003',
            'val': '作物遗传育种栽培技术人员'
        },
        {
            'code': '0202004',
            'val': '农业技术指导人员'
        },
        {
            'code': '0202005',
            'val': '农业实验人员'
        },
        {
            'code': '0202006',
            'val': '农情测报员'
        },
        {
            'code': '0202007',
            'val': '粮油管理员'
        },
        {
            'code': '0202008',
            'val': '农艺工'
        },
        {
            'code': '0202009',
            'val': '园艺技术人员'
        },
        {
            'code': '0202010',
            'val': '糖厂技工'
        },
        {
            'code': '0202011',
            'val': '植物保护技术人员'
        }
    ],
    '0203': [
        {
            'code': '0203001',
            'val': '联合收割机驾驶员'
        },
        {
            'code': '0203002',
            'val': '农用运输车驾驶员'
        },
        {
            'code': '0203003',
            'val': '农业机械操作或修理人员'
        },
        {
            'code': '0203006',
            'val': '沼气生产管理人员'
        },
        {
            'code': '0203007',
            'val': '农村节能员(灶、坑、炉、窑建造改造人员)'
        },
        {
            'code': '0203008',
            'val': '农用太阳能设施人员'
        },
        {
            'code': '0203009',
            'val': '生物质能设备人员'
        }
    ],
    '0204': [
        {
            'code': '0204001',
            'val': '棉花加工人员'
        },
        {
            'code': '0204002',
            'val': '果类产品加工工'
        },
        {
            'code': '0204003',
            'val': '茶叶/蔬菜加工人员'
        },
        {
            'code': '0204004',
            'val': '竹/藤/麻/棕/草制品加工人员'
        },
        {
            'code': '0204005',
            'val': '特种植物原料加工人员'
        },
        {
            'code': '0204006',
            'val': '农作物种子加工'
        },
        {
            'code': '0204007',
            'val': '农副林特产品加工人员'
        },
        {
            'code': '0204008',
            'val': '农副特产加工人员'
        },
        {
            'code': '0204009',
            'val': '蜂产品加工'
        }
    ],
    '0205': [
        {
            'code': '0205001',
            'val': '饲养家禽家畜人员'
        },
        {
            'code': '0205002',
            'val': '家畜繁殖工'
        },
        {
            'code': '0205003',
            'val': '畜牧场经营者(不亲自作业)'
        },
        {
            'code': '0205004',
            'val': '畜牧工作人员'
        },
        {
            'code': '0205006',
            'val': '家禽繁殖工'
        },
        {
            'code': '0205008',
            'val': '实验动物饲养人员'
        },
        {
            'code': '0205009',
            'val': '动物养殖人员'
        },
        {
            'code': '0205010',
            'val': '驯养人员'
        }
    ],
    '0206': [
        {
            'code': '0206001',
            'val': '畜牧技术人员'
        },
        {
            'code': '0206002',
            'val': '兽医'
        },
        {
            'code': '0206003',
            'val': '兽药技术人员'
        },
        {
            'code': '0206004',
            'val': '动物疫病防治员'
        },
        {
            'code': '0206005',
            'val': '兽医化验员'
        },
        {
            'code': '0206006',
            'val': '动物检疫/检验/化验员'
        },
        {
            'code': '0206007',
            'val': '中兽医员'
        }
    ],
    '0207': [
        {
            'code': '0207001',
            'val': '草业技术人员'
        },
        {
            'code': '0207002',
            'val': '草地监护员'
        },
        {
            'code': '0207003',
            'val': '牧草培育/加工人员'
        },
        {
            'code': '0207004',
            'val': '草坪建植工'
        },
        {
            'code': '0207005',
            'val': '草业生产人员'
        }
    ],
    '0208': [
        {
            'code': '0208001',
            'val': '水生动物苗种繁育工'
        },
        {
            'code': '0208002',
            'val': '水生植物苗种培育工'
        },
        {
            'code': '0208003',
            'val': '水生动物饲养工'
        },
        {
            'code': '0208004',
            'val': '水生植物栽培工'
        },
        {
            'code': '0208005',
            'val': '珍珠养殖工(淡水)'
        },
        {
            'code': '0208006',
            'val': '珍珠养殖工(海水)'
        },
        {
            'code': '0208007',
            'val': '生物饵料培养工'
        },
        {
            'code': '0208008',
            'val': '水产养殖潜水工'
        },
        {
            'code': '0208009',
            'val': '渔场经营者(不亲自作业)'
        },
        {
            'code': '0208010',
            'val': '渔场经营者(亲自作业)'
        },
        {
            'code': '0208011',
            'val': '热带鱼养殖者、水族馆经营者'
        },
        {
            'code': '0208013',
            'val': '水生生物病害防治员'
        },
        {
            'code': '0208014',
            'val': '水生生物疫病检疫/检验/化验人员/防治人员'
        },
        {
            'code': '0208015',
            'val': '养殖工人（内陆）'
        },
        {
            'code': '0208016',
            'val': '水族馆经营者（不亲自作业）'
        },
        {
            'code': '0208017',
            'val': '水族馆经营者'
        },
        {
            'code': '0208018',
            'val': '水生动植物采集/栽培及苗种繁育人员'
        },
        {
            'code': '0208019',
            'val': '渔网具装配人员'
        },
        {
            'code': '0208020',
            'val': '水生哺乳动物训养师'
        }
    ],
    '0209': [
        {
            'code': '0209001',
            'val': '水产养殖工程技术人员'
        },
        {
            'code': '0209002',
            'val': '渔业资源开发利用工程技术人员'
        },
        {
            'code': '0209003',
            'val': '水产实验人员(室内)'
        },
        {
            'code': '0209004',
            'val': '水产实验人员（室外）'
        },
        {
            'code': '0209005',
            'val': '水产养殖质量管理员'
        },
        {
            'code': '0209006',
            'val': '水产品质量检验员'
        }
    ],
    '0210': [
        {
            'code': '0210001',
            'val': '水产品原料处理工'
        },
        {
            'code': '0210002',
            'val': '水产品腌熏烤制工'
        },
        {
            'code': '0210003',
            'val': '鱼糜及鱼糜制品加工工'
        },
        {
            'code': '0210004',
            'val': '鱼粉加工工'
        },
        {
            'code': '0210005',
            'val': '鱼肝油及制品加工工'
        },
        {
            'code': '0210006',
            'val': '海藻制碘工'
        },
        {
            'code': '0210007',
            'val': '海藻制醇工'
        },
        {
            'code': '0210008',
            'val': '海藻制胶工'
        },
        {
            'code': '0210009',
            'val': '海藻食品加工工'
        },
        {
            'code': '0210010',
            'val': '贝类净化工'
        },
        {
            'code': '0210011',
            'val': '水（海）产品加工人员'
        },
        {
            'code': '0210012',
            'val': '负责人（不亲自作业）'
        },
        {
            'code': '0210013',
            'val': '搬运工'
        }
    ],
    '0211': [
        {
            'code': '0211001',
            'val': '水产捕捞工'
        },
        {
            'code': '0211007',
            'val': '水生动植物采集工'
        }
    ],
    '0301': [
        {
            'code': '0301001',
            'val': '林业生态环境工程技术人员'
        },
        {
            'code': '0301002',
            'val': '森林培育工程技术人员'
        },
        {
            'code': '0301003',
            'val': '园林绿化工程技术人员'
        },
        {
            'code': '0301004',
            'val': '野生动物保护与繁殖利用工程技术人员'
        },
        {
            'code': '0301005',
            'val': '自然保护区工程技术人员'
        },
        {
            'code': '0301006',
            'val': '森林保护工程技术人员'
        },
        {
            'code': '0301007',
            'val': '木、竹材加工工程技术人员'
        },
        {
            'code': '0301009',
            'val': '经济林和林特产品'
        },
        {
            'code': '0301010',
            'val': '森林资源管理与监测工程技术人员'
        }
    ],
    '0302': [
        {
            'code': '0302009',
            'val': '生产行政管理员'
        }
    ],
    '0303': [
        {
            'code': '0303001',
            'val': '木材工厂现场之职员'
        },
        {
            'code': '0303002',
            'val': '领班'
        },
        {
            'code': '0303003',
            'val': '分级员'
        },
        {
            'code': '0303004',
            'val': '检查员'
        },
        {
            'code': '0303005',
            'val': '标记员'
        },
        {
            'code': '0303006',
            'val': '磅秤员'
        },
        {
            'code': '0303008',
            'val': '防腐剂工人'
        },
        {
            'code': '0303009',
            'val': '木材储藏槽工人'
        },
        {
            'code': '0303011',
            'val': '吊车操作人员'
        },
        {
            'code': '0303012',
            'val': '木材干燥工人'
        },
        {
            'code': '0303013',
            'val': '木材供应站管理人员'
        },
        {
            'code': '0303014',
            'val': '木材供应站营业人员'
        },
        {
            'code': '0303015',
            'val': '仓库管理员'
        },
        {
            'code': '0303018',
            'val': '集材作业工'
        },
        {
            'code': '0303019',
            'val': '枕木处理工'
        },
        {
            'code': '0303020',
            'val': '木材工厂现场管理人员'
        }
    ],
    '0304': [
        {
            'code': '0304001',
            'val': '胶合板制造工人'
        },
        {
            'code': '0304002',
            'val': '纤维板制造工人'
        },
        {
            'code': '0304003',
            'val': '刨花板制造工人'
        },
        {
            'code': '0304004',
            'val': '人造板制胶工人'
        },
        {
            'code': '0304005',
            'val': '装饰层压板工人'
        },
        {
            'code': '0304006',
            'val': '人造板饰面工人'
        }
    ],
    '0305': [
        {
            'code': '0305001',
            'val': '技术人员'
        },
        {
            'code': '0305002',
            'val': '领班/监工'
        },
        {
            'code': '0305003',
            'val': '木制家俱制造工人'
        },
        {
            'code': '0305004',
            'val': '木制家俱制造修理工'
        },
        {
            'code': '0305005',
            'val': '金属家俱制造工人'
        },
        {
            'code': '0305006',
            'val': '金属家俱修理工'
        },
        {
            'code': '0305007',
            'val': '手工木工'
        },
        {
            'code': '0305008',
            'val': '机械木工'
        },
        {
            'code': '0305009',
            'val': '精细木工'
        }
    ],
    '0306': [
        {
            'code': '0307001',
            'val': '护林员'
        },
        {
            'code': '0307002',
            'val': '森林病虫害防治员'
        },
        {
            'code': '0307003',
            'val': '其他森林资源管护人员'
        }
    ],
    '0307': [
        {
            'code': '0308001',
            'val': '野生动物保护员'
        },
        {
            'code': '0308002',
            'val': '野生植物保护员'
        },
        {
            'code': '0308003',
            'val': '自然保护区巡视监测员'
        },
        {
            'code': '0308004',
            'val': '标本员'
        }
    ],
    '0308': [
        {
            'code': '0309003',
            'val': '营林实验工'
        },
        {
            'code': '0309004',
            'val': '平地育苗工人'
        },
        {
            'code': '0309006',
            'val': '领班'
        },
        {
            'code': '0309007',
            'val': '山地造林工人'
        },
        {
            'code': '0309008',
            'val': '山林管理人员'
        },
        {
            'code': '0309010',
            'val': '树木育苗人员'
        },
        {
            'code': '0309011',
            'val': '实验室育苗栽培人员'
        }
    ],
    '0401': [
        {
            'code': '0401001',
            'val': '钻探工人'
        },
        {
            'code': '0401003',
            'val': '物探工人'
        },
        {
            'code': '0401005',
            'val': '采样工人'
        },
        {
            'code': '0401007',
            'val': '海洋土质实验工人'
        },
        {
            'code': '0401008',
            'val': '固体岩矿碎样工人'
        },
        {
            'code': '0401009',
            'val': '岩矿/古生物样品磨片工人'
        },
        {
            'code': '0401010',
            'val': '重沙样品淘洗工人'
        },
        {
            'code': '0401011',
            'val': '劈岩/保管工人'
        },
        {
            'code': '0401012',
            'val': '地球科学研究人员'
        },
        {
            'code': '0401013',
            'val': '地质勘探工程技术人员'
        },
        {
            'code': '0401015',
            'val': '地质探测员(平地)'
        },
        {
            'code': '0401016',
            'val': '工程师'
        }
    ],
    '0402': [
        {
            'code': '0402001',
            'val': '大地/人员程测量人员'
        },
        {
            'code': '0402002',
            'val': '摄影测量人员'
        },
        {
            'code': '0402003',
            'val': '地图制图人员'
        },
        {
            'code': '0402004',
            'val': '地籍测绘人员'
        },
        {
            'code': '0402005',
            'val': '海洋测绘人员(非海上作业)'
        }
    ],
    '0403': [
        {
            'code': '0403001',
            'val': '海盐晒制工'
        },
        {
            'code': '0403002',
            'val': '海盐采收工'
        },
        {
            'code': '0403005',
            'val': '湖盐脱水工'
        },
        {
            'code': '0403009',
            'val': '真空制盐工'
        },
        {
            'code': '0403010',
            'val': '冷冻提硝工'
        },
        {
            'code': '0403011',
            'val': '苦卤综合利用工'
        },
        {
            'code': '0403012',
            'val': '精制盐工'
        }
    ],
    '0404': [
        {
            'code': '0404001',
            'val': '筛选破碎工'
        },
        {
            'code': '0404002',
            'val': '重力选矿工'
        },
        {
            'code': '0404003',
            'val': '浮选工'
        },
        {
            'code': '0404004',
            'val': '磁选工'
        },
        {
            'code': '0404005',
            'val': '选矿脱水工'
        },
        {
            'code': '0404006',
            'val': '尾矿处理工'
        },
        {
            'code': '0404007',
            'val': '磨矿工'
        },
        {
            'code': '0404008',
            'val': '水煤浆制备工'
        },
        {
            'code': '0404010',
            'val': '洗选工人（地上作业）'
        },
        {
            'code': '0404011',
            'val': '动力配煤工'
        },
        {
            'code': '0404012',
            'val': '工业型煤加工制作人员'
        }
    ],
    '0405': [
        {
            'code': '0405001',
            'val': '生产管理人员（不到现场）'
        },
        {
            'code': '0405005',
            'val': '采砂业工人'
        },
        {
            'code': '0405006',
            'val': '采砂/石厂管理人员'
        },
        {
            'code': '0405007',
            'val': '淘金工人'
        },
        {
            'code': '0405010',
            'val': '工矿安全人员'
        },
        {
            'code': '0405017',
            'val': '矿山提升机/架空索道/绞车等操作工人'
        },
        {
            'code': '0405019',
            'val': '矿井通风工人'
        },
        {
            'code': '0405023',
            'val': '矿山安全检测工'
        },
        {
            'code': '0405024',
            'val': '矿山检查验收工'
        },
        {
            'code': '0405025',
            'val': '矿灯、自救器管理工'
        },
        {
            'code': '0405026',
            'val': '生产管理人员（现场监督）'
        },
        {
            'code': '0405027',
            'val': '经营者(不到现场者)'
        },
        {
            'code': '0405028',
            'val': '经营者(现场监督者)'
        },
        {
            'code': '0405029',
            'val': '经理人员'
        },
        {
            'code': '0405030',
            'val': '矿业工程师/技师/领班'
        },
        {
            'code': '0405033',
            'val': '矿工头灯充电人员'
        },
        {
            'code': '0405041',
            'val': '生产技术管理人员（非煤矿山）'
        }
    ],
    '0406': [
        {
            'code': '0406001',
            'val': '行政人员'
        },
        {
            'code': '0406002',
            'val': '工程师'
        },
        {
            'code': '0406008',
            'val': '综合录井工'
        },
        {
            'code': '0406009',
            'val': '气测工'
        },
        {
            'code': '0406010',
            'val': '注水员'
        },
        {
            'code': '0406014',
            'val': '天然气净化工人'
        },
        {
            'code': '0406015',
            'val': '油气输送工人'
        },
        {
            'code': '0406017',
            'val': '采油化验工'
        }
    ],
    '0407': [
        {
            'code': '0407001',
            'val': '行政人员'
        }
    ],
    '0501': [
        {
            'code': '0501001',
            'val': '路桥收费站收费员'
        },
        {
            'code': '0501002',
            'val': '路桥收费站执勤员'
        },
        {
            'code': '0501003',
            'val': '公务小客车司机'
        },
        {
            'code': '0501004',
            'val': '非营运大客车司机'
        },
        {
            'code': '0501005',
            'val': '出租车、救护车司机'
        },
        {
            'code': '0501006',
            'val': '游览车司机及服务员'
        },
        {
            'code': '0501007',
            'val': '客运车司机、服务员、售票员（短途）'
        },
        {
            'code': '0501008',
            'val': '客运车司机、服务员、售票员（长途）'
        },
        {
            'code': '0501009',
            'val': '小型客货两用车司机'
        },
        {
            'code': '0501010',
            'val': '非营运货车司机、随车工人、搬家工人'
        },
        {
            'code': '0501012',
            'val': '人力三轮车夫'
        },
        {
            'code': '0501015',
            'val': '柜台售票员'
        },
        {
            'code': '0501016',
            'val': '装卸搬运工人'
        },
        {
            'code': '0501021',
            'val': '缆车操作员'
        },
        {
            'code': '0501023',
            'val': '执摩托车驾照者（非营运）'
        },
        {
            'code': '0501024',
            'val': '汽车货运站务员'
        },
        {
            'code': '0501025',
            'val': '汽车运输调度员'
        },
        {
            'code': '0501026',
            'val': '车辆保管人员'
        },
        {
            'code': '0501027',
            'val': '客运车稽核人员'
        },
        {
            'code': '0501028',
            'val': '其他公路道路运输服务人员'
        },
        {
            'code': '0501029',
            'val': '计程，货运行业负责人（不驾驶）'
        },
        {
            'code': '0501030',
            'val': '外务员（非驾驶人员）'
        },
        {
            'code': '0501031',
            'val': '公交车司机及售票员'
        },
        {
            'code': '0501032',
            'val': '内勤工作人员'
        },
        {
            'code': '0501034',
            'val': '港口、车站、仓库机械化运输'
        },
        {
            'code': '0501035',
            'val': '道路划线人'
        },
        {
            'code': '0501036',
            'val': '拖吊车驾驶及工作人员'
        },
        {
            'code': '0502001',
            'val': '铁路运输工程技术人员'
        }
    ],
    '0502': [
        {
            'code': '0502002',
            'val': '铁路机务工程技术人员'
        },
        {
            'code': '0502003',
            'val': '铁路车辆工程技术人员'
        },
        {
            'code': '0502004',
            'val': '铁路电务工程技术人员'
        },
        {
            'code': '0502005',
            'val': '铁路站长'
        },
        {
            'code': '0502006',
            'val': '行包运输服务员'
        },
        {
            'code': '0502007',
            'val': '车站货运作业组织员'
        },
        {
            'code': '0502008',
            'val': '铁路票房工作人员'
        },
        {
            'code': '0502009',
            'val': '车站检票员'
        },
        {
            'code': '0502010',
            'val': '铁路播音员'
        },
        {
            'code': '0502011',
            'val': '铁路一般内勤人员'
        },
        {
            'code': '0502012',
            'val': '铁路服务台人员'
        },
        {
            'code': '0502013',
            'val': '车站客运服务员'
        },
        {
            'code': '0502014',
            'val': '铁路车站清洁工人'
        },
        {
            'code': '0502015',
            'val': '旅客列车乘务员'
        },
        {
            'code': '0502016',
            'val': '机车乘务员'
        },
        {
            'code': '0502017',
            'val': '机车整备员'
        },
        {
            'code': '0502018',
            'val': '铁路机工'
        },
        {
            'code': '0502019',
            'val': '铁路电源工'
        },
        {
            'code': '0502020',
            'val': '铁路修护厂厂长'
        },
        {
            'code': '0502021',
            'val': '铁路修护厂内勤'
        },
        {
            'code': '0502022',
            'val': '铁路建筑工程技术人员'
        },
        {
            'code': '0502023',
            'val': '铁路修护厂技工'
        },
        {
            'code': '0502024',
            'val': '铁道线路工'
        },
        {
            'code': '0502025',
            'val': '车号员'
        },
        {
            'code': '0502026',
            'val': '铁路平交道看护人员'
        },
        {
            'code': '0502027',
            'val': '车站货运员'
        },
        {
            'code': '0502029',
            'val': '驼峰设备操作员'
        },
        {
            'code': '0502030',
            'val': '求援机械操作员'
        },
        {
            'code': '0502031',
            'val': '列车轴温检测员'
        },
        {
            'code': '0502032',
            'val': '铁路通信工'
        },
        {
            'code': '0502033',
            'val': '机车调度员'
        },
        {
            'code': '0502034',
            'val': '车站调车作业员'
        },
        {
            'code': '0502035',
            'val': '发电车乘务员'
        },
        {
            'code': '0502036',
            'val': '车站运转作业计划员'
        },
        {
            'code': '0502037',
            'val': '铁路信号工人'
        },
        {
            'code': '0502038',
            'val': '铁路机车驾驶员'
        },
        {
            'code': '0502039',
            'val': '地铁/轻??驾驶员'
        },
        {
            'code': '0502040',
            'val': '地铁月台工作人员'
        },
        {
            'code': '0502041',
            'val': '车站治安巡视人员'
        },
        {
            'code': '0502042',
            'val': '铁路（轻轨）行李搬运工人'
        },
        {
            'code': '0502043',
            'val': '铁路（轻轨）机车燃料填充员'
        },
        {
            'code': '0502045',
            'val': '铁路（轻轨）维护员'
        },
        {
            'code': '0502046',
            'val': '铁路（轻轨）货运：领班'
        },
        {
            'code': '0502047',
            'val': '铁路（轻轨）押运员'
        },
        {
            'code': '0502048',
            'val': '乘警'
        },
        {
            'code': '0502049',
            'val': '随车人员(技术人员除外)'
        },
        {
            'code': '0502050',
            'val': '修设厂工程师'
        },
        {
            'code': '0502051',
            'val': '修路工'
        },
        {
            'code': '0502052',
            'val': '铁路维护工'
        },
        {
            'code': '0502053',
            'val': '仓库管理员'
        }
    ],
    '0503': [
        {
            'code': '0503001',
            'val': '客货轮船长（内河）'
        },
        {
            'code': '0503002',
            'val': '客货轮轮机长和高级船员（内河）'
        },
        {
            'code': '0503003',
            'val': '客货轮大副（内河）'
        },
        {
            'code': '0503004',
            'val': '客货轮二副（内河）'
        },
        {
            'code': '0503005',
            'val': '客货轮三副（内河）'
        },
        {
            'code': '0503006',
            'val': '客货轮大管轮（内河）'
        },
        {
            'code': '0503007',
            'val': '客货轮二管轮（内河）'
        },
        {
            'code': '0503008',
            'val': '客货轮三管轮（内河）'
        },
        {
            'code': '0503009',
            'val': '客货轮报务员（内河）'
        },
        {
            'code': '0503010',
            'val': '客货轮事务长（内河）'
        },
        {
            'code': '0503011',
            'val': '客货轮医务人员及一般船员（内河）'
        },
        {
            'code': '0503017',
            'val': '客货轮厨师（内河）'
        },
        {
            'code': '0503018',
            'val': '船舶客运员（内河）'
        },
        {
            'code': '0503022',
            'val': '码头工人（内河）'
        },
        {
            'code': '0503023',
            'val': '堆高机操作员（内河）'
        },
        {
            'code': '0503024',
            'val': '仓库管理人员、理货员（内河）'
        },
        {
            'code': '0503025',
            'val': '船舶引航员（内河）'
        },
        {
            'code': '0503026',
            'val': '关务人员（内河）'
        },
        {
            'code': '0503027',
            'val': '拖船驾驶员及工作人员（内河）'
        },
        {
            'code': '0503028',
            'val': '渡船驾驶员及工作人员（内河）'
        },
        {
            'code': '0503030',
            'val': '甲板部技术人员（内河）'
        },
        {
            'code': '0503031',
            'val': '轮机部技术人员（内河）'
        },
        {
            'code': '0503032',
            'val': '船舶业务员（内河）'
        },
        {
            'code': '0503033',
            'val': '港口客运员（内河）'
        },
        {
            'code': '0503034',
            'val': '船舶机舱设备操作工（内河）'
        },
        {
            'code': '0503035',
            'val': '无线电航标操作工（内河）'
        },
        {
            'code': '0503036',
            'val': '视觉航标工（内河）'
        },
        {
            'code': '0503037',
            'val': '港口维护工（内河）'
        },
        {
            'code': '0503038',
            'val': '航道航务施工工人（内河）'
        },
        {
            'code': '0503087',
            'val': '内河客轮工作人员（远洋）'
        },
        {
            'code': '0503093',
            'val': '港口客运人员（远洋）'
        },
        {
            'code': '0503094',
            'val': '吊车操作员（港口作业）（远洋）'
        },
        {
            'code': '0503095',
            'val': '起重机械操作员（港口作业）（远洋）'
        },
        {
            'code': '0503096',
            'val': '引水员（远洋）'
        },
        {
            'code': '0503097',
            'val': '稽查人员（远洋）'
        },
        {
            'code': '0503101',
            'val': '船舶加油（远洋）'
        },
        {
            'code': '0503102',
            'val': '汽车运用工程技术人员'
        },
        {
            'code': '0503103',
            'val': '船舶运用工程技术人员'
        },
        {
            'code': '0503104',
            'val': '水上交通工程技术人员'
        },
        {
            'code': '0503106',
            'val': '船舶检验工程技术人员'
        }
    ],
    '0504': [
        {
            'code': '0504001',
            'val': '民用航空维修与适航专业工程技术人员'
        },
        {
            'code': '0504002',
            'val': '航行航空工程技术人员'
        },
        {
            'code': '0504003',
            'val': '通用航空技术人员'
        },
        {
            'code': '0504004',
            'val': '航空运输工程技术人员'
        },
        {
            'code': '0504005',
            'val': '航空站站长'
        },
        {
            'code': '0504006',
            'val': '航空站播音员'
        },
        {
            'code': '0504007',
            'val': '运输地面服务人员'
        },
        {
            'code': '0504008',
            'val': '一般内勤人员'
        },
        {
            'code': '0504009',
            'val': '塔台工作人员'
        },
        {
            'code': '0504010',
            'val': '关务人员'
        },
        {
            'code': '0504011',
            'val': '检查人员'
        },
        {
            'code': '0504012',
            'val': '运务人员'
        },
        {
            'code': '0504013',
            'val': '清洁工人（航空大厦内）'
        },
        {
            'code': '0504014',
            'val': '清洁工（登高、高墙或天花板）'
        },
        {
            'code': '0504015',
            'val': '航空公司清洁工（机舱内）'
        },
        {
            'code': '0504016',
            'val': '机场内交通车司机'
        },
        {
            'code': '0504017',
            'val': '行李货运搬运工人'
        },
        {
            'code': '0504018',
            'val': '加添燃料人员'
        },
        {
            'code': '0504019',
            'val': '飞机外壳洗刷人员'
        },
        {
            'code': '0504020',
            'val': '跑道维护工'
        },
        {
            'code': '0504021',
            'val': '飞机机械员'
        },
        {
            'code': '0504022',
            'val': '飞机维护人员'
        },
        {
            'code': '0504023',
            'val': '航空公司票务人员'
        },
        {
            'code': '0504024',
            'val': '航空公司机场柜台工作人员'
        },
        {
            'code': '0504025',
            'val': '航空货运外务员'
        },
        {
            'code': '0504026',
            'val': '航空货运理货员'
        },
        {
            'code': '0504027',
            'val': '民航机飞行员'
        },
        {
            'code': '0504028',
            'val': '机上服务员'
        },
        {
            'code': '0504031',
            'val': '灯塔修理员'
        },
        {
            'code': '0504032',
            'val': '航空通信雷达导航员'
        },
        {
            'code': '0504033',
            'val': '航空通信雷达设备维护保养员'
        },
        {
            'code': '0504036',
            'val': '航空器材员'
        },
        {
            'code': '0504037',
            'val': '航空气象员'
        },
        {
            'code': '0504038',
            'val': '缉私人员'
        },
        {
            'code': '0504039',
            'val': '机场消防员'
        },
        {
            'code': '0504040',
            'val': '雷达、无线电操作员'
        },
        {
            'code': '0504041',
            'val': '办事处人员'
        },
        {
            'code': '0504042',
            'val': '清舱员'
        },
        {
            'code': '0504043',
            'val': '航空一般内勤人员'
        },
        {
            'code': '0504044',
            'val': '航空货运报关人员'
        },
        {
            'code': '0504049',
            'val': '石油、天然气飞行员'
        },
        {
            'code': '0504055',
            'val': '航空工程技术人员、民用航空工程技术人员、航空业工作人员'
        },
        {
            'code': '0504056',
            'val': '航空运输地面人员、民用航空设备操作机及有关人员'
        }
    ],
    '0601': [
        {
            'code': '0601001',
            'val': '内勤人员'
        },
        {
            'code': '0601002',
            'val': '建筑师'
        },
        {
            'code': '0601003',
            'val': '现场技术检查员'
        },
        {
            'code': '0601004',
            'val': '模板工'
        },
        {
            'code': '0601005',
            'val': '木匠（室内）'
        },
        {
            'code': '0601008',
            'val': '油漆工（室内）'
        },
        {
            'code': '0601009',
            'val': '水电工（室内）'
        },
        {
            'code': '0601017',
            'val': '散工'
        },
        {
            'code': '0601018',
            'val': '推土机操作员'
        },
        {
            'code': '0601019',
            'val': '负责人（不亲自作业不在现场）'
        },
        {
            'code': '0601020',
            'val': '负责人（不亲自作业偶现场）'
        },
        {
            'code': '0601021',
            'val': '负责人（亲自作业视具体性质）'
        },
        {
            'code': '0601022',
            'val': '外勤人员'
        },
        {
            'code': '0601023',
            'val': '测量人员'
        },
        {
            'code': '0601024',
            'val': '工程人员'
        },
        {
            'code': '0601025',
            'val': '工地服务人员'
        },
        {
            'code': '0601027',
            'val': '混凝土混合机操作员'
        },
        {
            'code': '0601032',
            'val': '排水/防水工程人员'
        },
        {
            'code': '0601033',
            'val': '防渗墙工人'
        },
        {
            'code': '0601036',
            'val': '建筑工人领班（不参与工作）'
        },
        {
            'code': '0601037',
            'val': '引导参观工地服务人员（不亲自作业,否则参照具体工种）'
        },
        {
            'code': '0601038',
            'val': '承包商（土木建筑，“不亲自作业,偶尔去现场巡视,若亲自作业请参照具体工种”）'
        },
        {
            'code': '0601039',
            'val': '石棉瓦或浪板安装人员'
        },
        {
            'code': '0601040',
            'val': '金属门窗装修工人（室内）'
        },
        {
            'code': '0601042',
            'val': '沥青铺设人员'
        },
        {
            'code': '0601045',
            'val': '混凝土工人'
        },
        {
            'code': '0601046',
            'val': '混凝土制品模具工人'
        },
        {
            'code': '0601048',
            'val': '地毯之装设人员'
        },
        {
            'code': '0601049',
            'val': '监工（装饰行业）'
        },
        {
            'code': '0601050',
            'val': '装饰装修工（室内）'
        },
        {
            'code': '0601052',
            'val': '室内成套设施装饰工'
        },
        {
            'code': '0601053',
            'val': '装饰装修工人'
        },
        {
            'code': '0601054',
            'val': '装饰装修设计制图人员'
        },
        {
            'code': '0601057',
            'val': '轻钢彩板安装和维修人员'
        },
        {
            'code': '0601058',
            'val': '水暧工'
        },
        {
            'code': '0601060',
            'val': '古建筑结构施工工人'
        },
        {
            'code': '0601061',
            'val': '古建筑装饰工人'
        }
    ],
    '0602': [
        {
            'code': '0602001',
            'val': '清洁工人'
        },
        {
            'code': '0602003',
            'val': '电工．管道工人'
        },
        {
            'code': '0602004',
            'val': '防火系统/报警器安装人员'
        },
        {
            'code': '0602005',
            'val': '工程师'
        }
    ],
    '0603': [
        {
            'code': '0603001',
            'val': '现场技术检查员'
        },
        {
            'code': '0603003',
            'val': '管道铺设及维护工人'
        },
        {
            'code': '0603004',
            'val': '工程师'
        },
        {
            'code': '0603005',
            'val': '领班、监工'
        },
        {
            'code': '0603007',
            'val': '现场勘测人员（非山区）'
        },
        {
            'code': '0603008',
            'val': '维护工人'
        },
        {
            'code': '0603014',
            'val': '枕木处理工'
        },
        {
            'code': '0603015',
            'val': '铁路（轻轨）平交道看守人员'
        },
        {
            'code': '0603016',
            'val': '铁路（轻轨）修护厂技工'
        },
        {
            'code': '0603017',
            'val': '道路工程机械操作员'
        },
        {
            'code': '0603018',
            'val': '道路工程车辆驾驶员'
        },
        {
            'code': '0603020',
            'val': '平地铺设工人'
        }
    ],
    '0604': [
        {
            'code': '0604002',
            'val': '操作员（不包括矿场使用者）'
        }
    ],
    '0605': [
        {
            'code': '0605001',
            'val': '设计人员'
        },
        {
            'code': '0605002',
            'val': '室内装璜人员'
        },
        {
            'code': '0605004',
            'val': '地毯装设人员'
        },
        {
            'code': '0605005',
            'val': '承包商、监工'
        },
        {
            'code': '0605006',
            'val': 'PVC材质制造、装修工人'
        },
        {
            'code': '0605008',
            'val': '木工、油漆工'
        }
    ],
    '0606': [
        {
            'code': '0606002',
            'val': '工地看守员'
        },
        {
            'code': '0606013',
            'val': '机械设备安装工'
        },
        {
            'code': '0606014',
            'val': '电气设备安装工'
        },
        {
            'code': '0606015',
            'val': '中央空调系统安装及维护人员'
        },
        {
            'code': '0606016',
            'val': '管工'
        },
        {
            'code': '0606018',
            'val': '寺庙彩绘人员'
        },
        {
            'code': '0606019',
            'val': '中小型施工机械操作工'
        },
        {
            'code': '0606020',
            'val': '索道运输机械操作工人'
        }
    ],
    '0607': [
        {
            'code': '0607003',
            'val': '地质探测员（平地）'
        },
        {
            'code': '0607004',
            'val': '大地、工程测量工程技术人员'
        },
        {
            'code': '0607005',
            'val': '摄影测量与遥感工程技术人员'
        },
        {
            'code': '0607006',
            'val': '地图制图与印刷工程技术人员'
        },
        {
            'code': '0607007',
            'val': '海洋测绘工程技术人员（非海上作业）'
        }
    ],
    '0608': [
        {
            'code': '0608001',
            'val': '工程师'
        },
        {
            'code': '0608002',
            'val': '技术人员'
        },
        {
            'code': '0608003',
            'val': '领班'
        }
    ],
    '0609': [
        {
            'code': '0609001',
            'val': '砖/瓦生产工人'
        },
        {
            'code': '0609003',
            'val': '纸面石膏板生产工人'
        },
        {
            'code': '0609004',
            'val': '石膏浮雕板工人'
        },
        {
            'code': '0609005',
            'val': '监工(不参与制造过程)'
        }
    ],
    '0610': [
        {
            'code': '0610001',
            'val': '油毡生产工人'
        },
        {
            'code': '0610002',
            'val': '高分子防水卷材生工人'
        },
        {
            'code': '0610003',
            'val': '保温材料生产工人'
        },
        {
            'code': '0610004',
            'val': '吸音材料生产工人'
        },
        {
            'code': '0610005',
            'val': '珍珠岩制造工人'
        }
    ],
    '0611': [
        {
            'code': '0611001',
            'val': '耐火材料技师'
        },
        {
            'code': '0611002',
            'val': '耐火原材料加工工人'
        },
        {
            'code': '0611003',
            'val': '耐火材料成型工人'
        },
        {
            'code': '0611004',
            'val': '耐火材料烧成工人'
        },
        {
            'code': '0611005',
            'val': '耐火制品浸油工人'
        },
        {
            'code': '0611006',
            'val': '耐火纤维制品工人'
        }
    ],
    '0701': [
        {
            'code': '0701001',
            'val': '领班、监工'
        },
        {
            'code': '0701002',
            'val': '一般工人'
        },
        {
            'code': '0701003',
            'val': '冶炼工程技术人员'
        },
        {
            'code': '0701004',
            'val': '轧制工程技术人员'
        },
        {
            'code': '0701005',
            'val': '焦化工程技术人员'
        },
        {
            'code': '0701006',
            'val': '金属材料工程技术人员'
        },
        {
            'code': '0701007',
            'val': '耐火材料工程技术人员'
        },
        {
            'code': '0701008',
            'val': '碳素材料工程技术人员'
        },
        {
            'code': '0701009',
            'val': '冶金热能工程技术人员'
        }
    ],
    '0704': [
        {
            'code': '0704001',
            'val': '铁合金原料工人'
        },
        {
            'code': '0704003',
            'val': '铁合金焙烧工人'
        },
        {
            'code': '0704004',
            'val': '铁合金湿法冶炼工人'
        },
        {
            'code': '0704005',
            'val': '铁合金冶炼工人'
        },
        {
            'code': '0704006',
            'val': '硬质合金生产工人'
        },
        {
            'code': '0704007',
            'val': '铁合金炉外法冶炼工'
        }
    ],
    '0705': [
        {
            'code': '0705001',
            'val': '重冶备料工人'
        },
        {
            'code': '0705002',
            'val': '焙烧工人'
        }
    ],
    '0706': [
        {
            'code': '0706003',
            'val': '镁冶炼工人'
        },
        {
            'code': '0706004',
            'val': '硅冶炼工人'
        }
    ],
    '0707': [
        {
            'code': '0707001',
            'val': '钨钼冶炼工人'
        },
        {
            'code': '0707002',
            'val': '钽铌冶炼工人'
        },
        {
            'code': '0707003',
            'val': '钛冶炼工人'
        },
        {
            'code': '0707004',
            'val': '稀土冶炼工人'
        },
        {
            'code': '0707005',
            'val': '贵金属冶炼工人'
        },
        {
            'code': '0707006',
            'val': '锂冶炼工人'
        }
    ],
    '0708': [
        {
            'code': '0708001',
            'val': '半导体原料制备工人'
        },
        {
            'code': '0708002',
            'val': '多晶制取工人'
        }
    ],
    '0709': [
        {
            'code': '0709001',
            'val': '轧制原料工人'
        },
        {
            'code': '0709004',
            'val': '金属材涂层工人'
        }
    ],
    '0710': [
        {
            'code': '0710001',
            'val': '铸管备品工人'
        }
    ],
    '0711': [
        {
            'code': '0711002',
            'val': '碳素成型工人'
        },
        {
            'code': '0711003',
            'val': '碳素焙烧工人'
        },
        {
            'code': '0711004',
            'val': '碳素浸渍工人'
        },
        {
            'code': '0711005',
            'val': '碳素石墨化工人'
        },
        {
            'code': '0711006',
            'val': '碳素石墨加工人工人'
        },
        {
            'code': '0711007',
            'val': '碳素纤维工人'
        }
    ],
    '0713': [
        {
            'code': '0713001',
            'val': '冶炼风机工人'
        }
    ],
    '0714': [
        {
            'code': '0714001',
            'val': '机械设计工程技术人员'
        },
        {
            'code': '0714002',
            'val': '机械制造工程技术人员'
        },
        {
            'code': '0714003',
            'val': '仪器仪表工程技术人员'
        },
        {
            'code': '0714004',
            'val': '设备工程技术人员'
        },
        {
            'code': '0714005',
            'val': '企业负责人'
        },
        {
            'code': '0714006',
            'val': '领班、监工'
        },
        {
            'code': '0714007',
            'val': '模具设计人员'
        },
        {
            'code': '0714008',
            'val': '制模工人'
        },
        {
            'code': '0714009',
            'val': '技工'
        },
        {
            'code': '0714010',
            'val': '车工'
        },
        {
            'code': '0714025',
            'val': '车床工人(全自动)'
        },
        {
            'code': '0714040',
            'val': '涂装工人'
        },
        {
            'code': '0714041',
            'val': '磨料制造工人'
        },
        {
            'code': '0714042',
            'val': '磨具制造工人'
        },
        {
            'code': '0714047',
            'val': '仪器仪表元件制造工人'
        },
        {
            'code': '0714048',
            'val': '真空干燥处理工人'
        },
        {
            'code': '0714049',
            'val': '人造宝石制造工人'
        },
        {
            'code': '0714051',
            'val': '变压器,互感器装配工人'
        },
        {
            'code': '0714052',
            'val': '高低压电器装配工人'
        },
        {
            'code': '0714053',
            'val': '电焊机装配工人'
        },
        {
            'code': '0714055',
            'val': '水电工人'
        },
        {
            'code': '0714057',
            'val': '铅字铸造工人'
        },
        {
            'code': '0714059',
            'val': '搬运工人'
        },
        {
            'code': '0714060',
            'val': '铲车工'
        },
        {
            'code': '0714062',
            'val': '装配工、品管人员'
        }
    ],
    '0715': [
        {
            'code': '0715001',
            'val': '电子材料工程技术人员'
        },
        {
            'code': '0715002',
            'val': '电子元器件工程技术人员'
        },
        {
            'code': '0715003',
            'val': '雷达系统工程技术人员'
        },
        {
            'code': '0715004',
            'val': '广播视听设备工程技术人员'
        },
        {
            'code': '0715005',
            'val': '电子仪器与测量工程技术人员'
        }
    ],
    '0716': [
        {
            'code': '0716001',
            'val': '真空电子器件化学零件制造工'
        },
        {
            'code': '0716002',
            'val': '电极丝制造工'
        },
        {
            'code': '0716003',
            'val': '真空电子器件金属零件制造工'
        },
        {
            'code': '0716004',
            'val': '电子真空镀膜工'
        },
        {
            'code': '0716005',
            'val': '真空电子器件装配工'
        },
        {
            'code': '0716006',
            'val': '真空电子器件装调工'
        },
        {
            'code': '0716007',
            'val': '液晶显示器件制造工'
        },
        {
            'code': '0716008',
            'val': '单晶片加工工'
        },
        {
            'code': '0716009',
            'val': '半导体芯片制造工'
        },
        {
            'code': '0716010',
            'val': '半导体分立器件/集成电路装调工'
        },
        {
            'code': '0716011',
            'val': '电子用水制备工'
        },
        {
            'code': '0716012',
            'val': '电阻器制造工'
        },
        {
            'code': '0716013',
            'val': '电容器制造工'
        },
        {
            'code': '0716014',
            'val': '微波铁氧体元器件制造工'
        },
        {
            'code': '0716015',
            'val': '石英晶体生长设备操作工'
        },
        {
            'code': '0716016',
            'val': '压电石英晶片加工工'
        },
        {
            'code': '0716017',
            'val': '石英晶体元器件制造工'
        },
        {
            'code': '0716018',
            'val': '电声器件制造工'
        },
        {
            'code': '0716019',
            'val': '水声换能器制造工'
        },
        {
            'code': '0716020',
            'val': '专用继电器制造工'
        },
        {
            'code': '0716021',
            'val': '高频电感器件制造工'
        },
        {
            'code': '0716022',
            'val': '接插件制造工'
        },
        {
            'code': '0716023',
            'val': '磁头制造工'
        },
        {
            'code': '0716024',
            'val': '电子产品制版工'
        },
        {
            'code': '0716025',
            'val': '印制电路制作工'
        },
        {
            'code': '0716026',
            'val': '薄膜加热器制造工'
        },
        {
            'code': '0716027',
            'val': '激光头制造工'
        },
        {
            'code': '0716028',
            'val': '领班、监工'
        },
        {
            'code': '0716029',
            'val': '装配工'
        },
        {
            'code': '0716030',
            'val': '修理工'
        },
        {
            'code': '0716031',
            'val': '制造工人'
        },
        {
            'code': '0716032',
            'val': '质量检验人员'
        },
        {
            'code': '0716033',
            'val': '包装工人'
        }
    ],
    '0717': [
        {
            'code': '0717001',
            'val': '工程师'
        },
        {
            'code': '0717002',
            'val': '领班、监工'
        },
        {
            'code': '0717005',
            'val': '质检员'
        },
        {
            'code': '0717006',
            'val': '电机调试员'
        }
    ],
    '0718': [
        {
            'code': '0718006',
            'val': '技师'
        },
        {
            'code': '0718007',
            'val': '工人'
        }
    ],
    '0719': [
        {
            'code': '0719001',
            'val': '无线电设备机械装校工'
        },
        {
            'code': '0719002',
            'val': '电子设备装配工'
        },
        {
            'code': '0719003',
            'val': '无线电调试工'
        },
        {
            'code': '0719004',
            'val': '雷达装配工'
        },
        {
            'code': '0719006',
            'val': '电子精密机械装调工'
        },
        {
            'code': '0719007',
            'val': '电子计算机调试工'
        },
        {
            'code': '0719008',
            'val': '有线通信传输设备调试工'
        },
        {
            'code': '0719009',
            'val': '通讯交换设备调试工'
        },
        {
            'code': '0719010',
            'val': '电源调试工'
        },
        {
            'code': '0719011',
            'val': '激光机装调工'
        },
        {
            'code': '0719012',
            'val': '激光全息工'
        },
        {
            'code': '0719013',
            'val': '铁路通信组调工'
        },
        {
            'code': '0719014',
            'val': '铁路信号组调工'
        },
        {
            'code': '0719015',
            'val': '铁路电控组调工'
        },
        {
            'code': '0719016',
            'val': '集成电路测试员'
        }
    ],
    '0720': [
        {
            'code': '0720001',
            'val': '装配修理工、冷冻修理厂工人'
        },
        {
            'code': '0720002',
            'val': '家电用品维修人员'
        },
        {
            'code': '0720003',
            'val': '空气调节器之装修人员（不需要在高空作业）'
        },
        {
            'code': '0720005',
            'val': '电子计算机维修工'
        }
    ],
    '0721': [
        {
            'code': '0721001',
            'val': '基础件装配工'
        },
        {
            'code': '0721002',
            'val': '部件装配工'
        }
    ],
    '0722': [
        {
            'code': '0722001',
            'val': '装配钳工'
        },
        {
            'code': '0722003',
            'val': '汽轮机装配工'
        },
        {
            'code': '0722004',
            'val': '内燃机装配工'
        },
        {
            'code': '0722006',
            'val': '电机装配工'
        },
        {
            'code': '0722007',
            'val': '数控机床装调维修工'
        }
    ],
    '0723': [
        {
            'code': '0723002',
            'val': '绝缘制品件装配工'
        },
        {
            'code': '0723003',
            'val': '线圈绕制工'
        },
        {
            'code': '0723004',
            'val': '绝缘处理浸渍工'
        },
        {
            'code': '0723005',
            'val': '变压器/互感器装配工'
        },
        {
            'code': '0723010',
            'val': '技师'
        }
    ],
    '0724': [
        {
            'code': '0724001',
            'val': '电子专用设备装调工'
        },
        {
            'code': '0724002',
            'val': '真空测试工'
        }
    ],
    '0725': [
        {
            'code': '0725001',
            'val': '仪器仪表元器件装调工'
        },
        {
            'code': '0725002',
            'val': '力学仪器仪表装配工'
        },
        {
            'code': '0725003',
            'val': '电子仪器仪表装配工'
        },
        {
            'code': '0725004',
            'val': '光电仪器仪表装调工'
        },
        {
            'code': '0725005',
            'val': '分析仪器仪表装配工'
        },
        {
            'code': '0725006',
            'val': '计时仪器仪表装配工'
        },
        {
            'code': '0725007',
            'val': '工业自动化仪器仪表与装置装配工'
        },
        {
            'code': '0725008',
            'val': '电工仪器仪表装配工'
        },
        {
            'code': '0725009',
            'val': '仪器仪表金属元件制造工'
        },
        {
            'code': '0725010',
            'val': '仪器仪表非金属元件制造工'
        },
        {
            'code': '0725011',
            'val': '仪器仪表装配工'
        },
        {
            'code': '0725012',
            'val': '仪器仪表装调工'
        },
        {
            'code': '0725013',
            'val': '仪表仪器制造人员'
        },
        {
            'code': '0725014',
            'val': '仪表仪器修理人员'
        },
        {
            'code': '0725015',
            'val': '仪器仪表检验工'
        }
    ],
    '0726': [
        {
            'code': '0726001',
            'val': '汽车(拖拉机)装配工'
        },
        {
            'code': '0726009',
            'val': '助动车/自行车装配工'
        },
        {
            'code': '0726010',
            'val': '助动车/自行车修理工'
        },
        {
            'code': '0726011',
            'val': '工程师'
        },
        {
            'code': '0726012',
            'val': '技师'
        },
        {
            'code': '0726013',
            'val': '汽车模型工'
        },
        {
            'code': '0726014',
            'val': '城轨接触网检修工'
        },
        {
            'code': '0726015',
            'val': '工程师'
        },
        {
            'code': '0726016',
            'val': '修理保养工人(汽车、摩托车)'
        },
        {
            'code': '0726017',
            'val': '领班、监工'
        },
        {
            'code': '0726018',
            'val': '试车人员'
        },
        {
            'code': '0726019',
            'val': '汽车/拖拉机修理工人'
        },
        {
            'code': '0726020',
            'val': '汽车加气站操作工'
        }
    ],
    '0727': [
        {
            'code': '0727001',
            'val': '功能膜工'
        }
    ],
    '0728': [
        {
            'code': '0728002',
            'val': '电冰箱、电冰柜制造装配工'
        },
        {
            'code': '0728003',
            'val': '洗衣机制造装配工'
        },
        {
            'code': '0728004',
            'val': '小型家用电器装配工'
        },
        {
            'code': '0728005',
            'val': '缝纫机制造装配工'
        },
        {
            'code': '0728006',
            'val': '办公小机械制造装配工'
        },
        {
            'code': '0728007',
            'val': '技师'
        },
        {
            'code': '0728008',
            'val': '一般制造工人'
        },
        {
            'code': '0728011',
            'val': '家电维修（非高空）'
        },
        {
            'code': '0728012',
            'val': '其他家用电器安装与维修'
        },
        {
            'code': '0728013',
            'val': '石英晶体生长设备操作工人'
        },
        {
            'code': '0728014',
            'val': '包装工人'
        }
    ],
    '0730': [
        {
            'code': '0730001',
            'val': '装甲车辆工程技术人员'
        },
        {
            'code': '0730002',
            'val': '火炮枪械工程技术人员'
        },
        {
            'code': '0730003',
            'val': '弹箭工程技术人员'
        }
    ],
    '0731': [
        {
            'code': '0731001',
            'val': '装甲车辆装配工'
        },
        {
            'code': '0731002',
            'val': '装甲车辆装配检验工'
        },
        {
            'code': '0731003',
            'val': '装甲车辆驾驶试验工'
        },
        {
            'code': '0731004',
            'val': '装甲车辆发动机装试工'
        }
    ],
    '0732': [
        {
            'code': '0732009',
            'val': '枪/炮弹装配工'
        }
    ],
    '0736': [
        {
            'code': '0736003',
            'val': '船舶电气装配工'
        },
        {
            'code': '0736005',
            'val': '船舶木塑帆缆工'
        },
        {
            'code': '0736006',
            'val': '船模制造试验工'
        },
        {
            'code': '0736007',
            'val': '工程师'
        },
        {
            'code': '0736008',
            'val': '领班、监工'
        },
        {
            'code': '0736012',
            'val': '打铆机操作员'
        },
        {
            'code': '0736013',
            'val': '绞盘机操作员'
        },
        {
            'code': '0736014',
            'val': '仓库管理员'
        }
    ],
    '0737': [
        {
            'code': '0737001',
            'val': '飞机设计工程技术人员'
        },
        {
            'code': '0737002',
            'val': '飞机制造工程技术人员'
        },
        {
            'code': '0737003',
            'val': '飞机发动机设计工程技术人员'
        },
        {
            'code': '0737004',
            'val': '飞机发动机制造工程技术人员'
        },
        {
            'code': '0737005',
            'val': '飞机装配工'
        },
        {
            'code': '0737006',
            'val': '飞机系统安装调试工'
        },
        {
            'code': '0737007',
            'val': '机载导弹装配工'
        },
        {
            'code': '0737008',
            'val': '航空发动机装配工'
        },
        {
            'code': '0737009',
            'val': '飞机螺旋桨装配工'
        },
        {
            'code': '0737010',
            'val': '飞机军械安装调试工'
        },
        {
            'code': '0737011',
            'val': '航空电气安装调试工'
        },
        {
            'code': '0737012',
            'val': '飞机发动机附件装配工'
        },
        {
            'code': '0737013',
            'val': '航空/飞机仪表装配工'
        },
        {
            'code': '0737014',
            'val': '航空装配平衡工'
        },
        {
            'code': '0737015',
            'val': '飞机无线电设备安装调试工'
        },
        {
            'code': '0737016',
            'val': '飞机雷达安装调试工'
        },
        {
            'code': '0737017',
            'val': '飞机特种设备检测与修理工'
        },
        {
            'code': '0737018',
            'val': '飞机透明件制造胶接装配工'
        },
        {
            'code': '0737019',
            'val': '飞机外场调试与维护工'
        },
        {
            'code': '0737025',
            'val': '航空环控救生装备试验工(地面试验)'
        },
        {
            'code': '0737027',
            'val': '航空仪表试验工'
        },
        {
            'code': '0737028',
            'val': '航空电机电器试验设备调试工'
        },
        {
            'code': '0737029',
            'val': '航天器环境试验工人'
        },
        {
            'code': '0737030',
            'val': '航天器结构强度环境试验工人'
        },
        {
            'code': '0737031',
            'val': '航天器结构高低温环境试验工人'
        },
        {
            'code': '0737032',
            'val': '火箭发动机介质试验工人'
        },
        {
            'code': '0737033',
            'val': '航天器系统试验工人'
        },
        {
            'code': '0737034',
            'val': '空间环境模拟光学装测工人'
        },
        {
            'code': '0737035',
            'val': '空间环境模拟温度试验工人'
        },
        {
            'code': '0737036',
            'val': '空间环境模拟真空试验工人'
        }
    ],
    '0738': [
        {
            'code': '0738001',
            'val': '惯性器件装配厂'
        },
        {
            'code': '0738002',
            'val': '伺服机构装配调试工'
        },
        {
            'code': '0738007',
            'val': '卫星总体装配工'
        }
    ],
    '0739': [
        {
            'code': '0739002',
            'val': '固体火箭发动机装配/试验工'
        },
        {
            'code': '0739003',
            'val': '固体火箭发动机检测工'
        }
    ],
    '0740': [
        {
            'code': '0740001',
            'val': '航天工程技术人员'
        },
        {
            'code': '0740005',
            'val': '火箭发动机介质试验工'
        },
        {
            'code': '0740006',
            'val': '航天器系统试验工'
        },
        {
            'code': '0740007',
            'val': '空间环境模拟光学装测工'
        },
        {
            'code': '0740008',
            'val': '空间环境模拟温度试验工'
        },
        {
            'code': '0740009',
            'val': '空间环境模拟真空试验工'
        }
    ],
    '0741': [
        {
            'code': '0741001',
            'val': '机修钳工'
        },
        {
            'code': '0741002',
            'val': '汽车修理工'
        },
        {
            'code': '0741004',
            'val': '汽车玻璃维修工'
        },
        {
            'code': '0741005',
            'val': '工程机械修理工'
        }
    ],
    '0742': [
        {
            'code': '0742001',
            'val': '工业自动化仪器仪表与装置修理工'
        },
        {
            'code': '0742002',
            'val': '电工仪器仪表修理工'
        },
        {
            'code': '0742003',
            'val': '精密仪器仪表修理工'
        }
    ],
    '0743': [
        {
            'code': '0743001',
            'val': '橡胶制品配料工'
        },
        {
            'code': '0743002',
            'val': '橡胶炼胶工'
        },
        {
            'code': '0743003',
            'val': '橡胶半成品制造工'
        },
        {
            'code': '0743004',
            'val': '橡胶成型工'
        },
        {
            'code': '0743005',
            'val': '橡胶硫化工'
        },
        {
            'code': '0743006',
            'val': '废胶再生工'
        },
        {
            'code': '0743007',
            'val': '轮胎翻修工'
        },
        {
            'code': '0743008',
            'val': '塑料制品配料工'
        },
        {
            'code': '0743009',
            'val': '塑料制品成型制作工(自动)'
        },
        {
            'code': '0743010',
            'val': '塑胶射出成型人员(其它)'
        },
        {
            'code': '0743011',
            'val': '工程师'
        },
        {
            'code': '0743012',
            'val': '技师'
        },
        {
            'code': '0743013',
            'val': '一般工人'
        }
    ],
    '0744': [
        {
            'code': '0744005',
            'val': '化工原料准备工'
        },
        {
            'code': '0744006',
            'val': '压缩机工'
        },
        {
            'code': '0744007',
            'val': '气体净化工'
        },
        {
            'code': '0744008',
            'val': '过滤工'
        },
        {
            'code': '0744009',
            'val': '油加热工'
        },
        {
            'code': '0744010',
            'val': '制冷工'
        },
        {
            'code': '0744011',
            'val': '蒸发工'
        },
        {
            'code': '0744012',
            'val': '蒸馏工'
        },
        {
            'code': '0744013',
            'val': '萃取工'
        },
        {
            'code': '0744014',
            'val': '吸收工'
        },
        {
            'code': '0744015',
            'val': '吸附工'
        },
        {
            'code': '0744016',
            'val': '干燥工'
        },
        {
            'code': '0744017',
            'val': '结晶工'
        },
        {
            'code': '0744018',
            'val': '造粒工'
        },
        {
            'code': '0744020',
            'val': '化工工艺试验工'
        },
        {
            'code': '0744021',
            'val': '化工总控工'
        },
        {
            'code': '0744022',
            'val': '样品检验员'
        },
        {
            'code': '0744023',
            'val': '仪表监控员'
        },
        {
            'code': '0744024',
            'val': '燃料油生产工'
        },
        {
            'code': '0744025',
            'val': '润滑油、脂生产工'
        },
        {
            'code': '0744026',
            'val': '石油产品精制工'
        },
        {
            'code': '0744028',
            'val': '备煤筛焦工'
        },
        {
            'code': '0744029',
            'val': '焦炉调温工'
        },
        {
            'code': '0744033',
            'val': '合成氨生产工'
        },
        {
            'code': '0744034',
            'val': '尿素生产工'
        },
        {
            'code': '0744035',
            'val': '硝酸铵生产工'
        },
        {
            'code': '0744036',
            'val': '碳酸氢铵生产工'
        },
        {
            'code': '0744039',
            'val': '复合磷肥生产工'
        },
        {
            'code': '0744040',
            'val': '钙镁磷肥生产工'
        },
        {
            'code': '0744041',
            'val': '氯化钾生产工'
        },
        {
            'code': '0744042',
            'val': '微量元素混肥生产工'
        },
        {
            'code': '0744051',
            'val': '无机化学反应工'
        },
        {
            'code': '0744055',
            'val': '炭黑制造工'
        },
        {
            'code': '0744057',
            'val': '工程师（无机化工产品生产）'
        },
        {
            'code': '0744059',
            'val': '一般工人（无机化工产品生产）'
        },
        {
            'code': '0744061',
            'val': '环烃生产工'
        },
        {
            'code': '0744062',
            'val': '烃类衍生物生产工'
        },
        {
            'code': '0744063',
            'val': '聚乙烯生产工'
        },
        {
            'code': '0744064',
            'val': '聚丙烯生产工'
        },
        {
            'code': '0744065',
            'val': '聚苯乙烯生产工'
        },
        {
            'code': '0744066',
            'val': '聚丁二烯生产工'
        },
        {
            'code': '0744067',
            'val': '聚氯乙烯生产工'
        },
        {
            'code': '0744068',
            'val': '酚醛树脂生产工'
        },
        {
            'code': '0744069',
            'val': '环氧树脂生产工'
        },
        {
            'code': '0744070',
            'val': '丙烯腈-丁二烯-苯乙烯共聚物(ABS)'
        },
        {
            'code': '0744071',
            'val': '顺丁橡胶生产工'
        },
        {
            'code': '0744072',
            'val': '乙丙橡胶生产工'
        },
        {
            'code': '0744073',
            'val': '异戊橡胶生产工'
        },
        {
            'code': '0744074',
            'val': '丁腈橡胶生产工'
        },
        {
            'code': '0744075',
            'val': '丁苯橡胶生产工'
        },
        {
            'code': '0744076',
            'val': '氯丁橡胶生产工'
        },
        {
            'code': '0744078',
            'val': '湿纺原液制造工'
        },
        {
            'code': '0744079',
            'val': '纺丝工'
        },
        {
            'code': '0744080',
            'val': '化纤后处理工'
        },
        {
            'code': '0744081',
            'val': '纺丝凝固浴液配制工'
        },
        {
            'code': '0744082',
            'val': '无纺布制造工'
        },
        {
            'code': '0744083',
            'val': '化纤纺丝精密组件工'
        },
        {
            'code': '0744084',
            'val': '合成革制造工'
        },
        {
            'code': '0744085',
            'val': '有机合成工'
        },
        {
            'code': '0744086',
            'val': '农药生物测试试验工'
        },
        {
            'code': '0744087',
            'val': '染料标准工'
        },
        {
            'code': '0744088',
            'val': '染料应用试验工'
        },
        {
            'code': '0744089',
            'val': '染料拼混工'
        },
        {
            'code': '0744090',
            'val': '研磨分散工'
        },
        {
            'code': '0744091',
            'val': '催化剂制造工'
        },
        {
            'code': '0744092',
            'val': '催化剂试验工'
        },
        {
            'code': '0744093',
            'val': '涂料合成树脂工'
        },
        {
            'code': '0744094',
            'val': '制漆配色调制工'
        },
        {
            'code': '0744095',
            'val': '溶剂制造工'
        },
        {
            'code': '0744096',
            'val': '化学试剂制造工'
        },
        {
            'code': '0744097',
            'val': '化工添加剂制造工'
        },
        {
            'code': '0744098',
            'val': '片基制造工'
        },
        {
            'code': '0744099',
            'val': '感光材料制造工'
        },
        {
            'code': '0744100',
            'val': '感光材料试验工'
        },
        {
            'code': '0744101',
            'val': '暗盒制造工'
        },
        {
            'code': '0744102',
            'val': '废片、白银回收工'
        },
        {
            'code': '0744103',
            'val': '磁粉制造工'
        },
        {
            'code': '0744104',
            'val': '磁记录材料制造工'
        },
        {
            'code': '0744105',
            'val': '磁记录材料试验工'
        },
        {
            'code': '0744106',
            'val': '感光鼓涂敷工'
        },
        {
            'code': '0744117',
            'val': '松香工'
        },
        {
            'code': '0744118',
            'val': '松节油制品工'
        },
        {
            'code': '0744124',
            'val': '树脂基复合材料工'
        },
        {
            'code': '0744125',
            'val': '橡胶基复合材料工'
        },
        {
            'code': '0744126',
            'val': '碳基复合材料工'
        },
        {
            'code': '0744127',
            'val': '陶瓷基复合材料工'
        },
        {
            'code': '0744128',
            'val': '复合固体推进剂成型工'
        },
        {
            'code': '0744129',
            'val': '复合固体发动机装药工'
        },
        {
            'code': '0744130',
            'val': '飞机复合材料制品工'
        },
        {
            'code': '0744131',
            'val': '制皂工'
        },
        {
            'code': '0744132',
            'val': '甘油工'
        },
        {
            'code': '0744133',
            'val': '脂肪酸工'
        },
        {
            'code': '0744134',
            'val': '洗衣粉成型工'
        },
        {
            'code': '0744135',
            'val': '合成洗涤剂制造工'
        },
        {
            'code': '0744136',
            'val': '香料制造工'
        },
        {
            'code': '0744137',
            'val': '香精制造工'
        },
        {
            'code': '0744138',
            'val': '化妆品配制工'
        },
        {
            'code': '0744139',
            'val': '牙膏制造工'
        },
        {
            'code': '0744141',
            'val': '制胶工'
        },
        {
            'code': '0744143',
            'val': '蜡烛制造工'
        },
        {
            'code': '0744144',
            'val': '电子绝缘与介质材料制造工'
        },
        {
            'code': '0744145',
            'val': '领班、监工'
        },
        {
            'code': '0744146',
            'val': '一般工人'
        },
        {
            'code': '0744148',
            'val': '化学肥料生产人员'
        },
        {
            'code': '0744149',
            'val': '样品检验员'
        },
        {
            'code': '0744150',
            'val': '仪表监控员'
        },
        {
            'code': '0744154',
            'val': '电子绝缘材料制造工人'
        },
        {
            'code': '0744156',
            'val': '云母制品加工'
        },
        {
            'code': '0744157',
            'val': '基本有机化工产品生产人员'
        }
    ],
    '0745': [
        {
            'code': '0745001',
            'val': '纺织工程技术人员'
        },
        {
            'code': '0745002',
            'val': '织造工程技术人员'
        },
        {
            'code': '0745003',
            'val': '染整工程技术人员'
        },
        {
            'code': '0745004',
            'val': '工程师'
        },
        {
            'code': '0745005',
            'val': '技师'
        },
        {
            'code': '0745006',
            'val': '纤维验配工'
        },
        {
            'code': '0745007',
            'val': '开清棉工'
        },
        {
            'code': '0745008',
            'val': '纤维染色工'
        },
        {
            'code': '0745009',
            'val': '加湿软麻工'
        },
        {
            'code': '0745010',
            'val': '选剥煮茧工'
        },
        {
            'code': '0745011',
            'val': '纤维梳理工'
        },
        {
            'code': '0745012',
            'val': '并条工'
        },
        {
            'code': '0745013',
            'val': '粗纱工'
        },
        {
            'code': '0745014',
            'val': '绢纺精炼工'
        },
        {
            'code': '0745015',
            'val': '细纱工'
        },
        {
            'code': '0745016',
            'val': '简并摇工'
        },
        {
            'code': '0745017',
            'val': '捻线工'
        },
        {
            'code': '0745018',
            'val': '制线工'
        },
        {
            'code': '0745019',
            'val': '缫丝工'
        },
        {
            'code': '0745020',
            'val': '整经工'
        },
        {
            'code': '0745021',
            'val': '浆纱工'
        },
        {
            'code': '0745022',
            'val': '穿经工'
        },
        {
            'code': '0745023',
            'val': '织布工'
        },
        {
            'code': '0745024',
            'val': '织物验修工'
        },
        {
            'code': '0745025',
            'val': '意匠纹版工'
        },
        {
            'code': '0745026',
            'val': '织造工人'
        },
        {
            'code': '0745027',
            'val': '纬编工'
        },
        {
            'code': '0745028',
            'val': '经编工'
        },
        {
            'code': '0745029',
            'val': '横机工'
        },
        {
            'code': '0745030',
            'val': '织袜工'
        },
        {
            'code': '0745031',
            'val': '铸、钳针工'
        },
        {
            'code': '0745032',
            'val': '坯布检查处理工'
        },
        {
            'code': '0745033',
            'val': '印染烧毛工'
        },
        {
            'code': '0745034',
            'val': '煮炼漂工'
        },
        {
            'code': '0745035',
            'val': '印染洗涤工'
        },
        {
            'code': '0745036',
            'val': '印染烘干工'
        },
        {
            'code': '0745037',
            'val': '印染丝光工'
        },
        {
            'code': '0745038',
            'val': '印染定型工'
        },
        {
            'code': '0745039',
            'val': '纺织针织染色工'
        },
        {
            'code': '0745040',
            'val': '印花工'
        },
        {
            'code': '0745041',
            'val': '印染雕刻制版工'
        },
        {
            'code': '0745042',
            'val': '印染后整理工'
        },
        {
            'code': '0745043',
            'val': '印染成品定等装潢工'
        },
        {
            'code': '0745044',
            'val': '印染染化料配制工'
        },
        {
            'code': '0745045',
            'val': '工艺染织制作工'
        },
        {
            'code': '0745046',
            'val': '染整工人'
        },
        {
            'code': '0745047',
            'val': '裁剪工'
        },
        {
            'code': '0745048',
            'val': '缝纫工'
        },
        {
            'code': '0745049',
            'val': '缝纫品整型工'
        },
        {
            'code': '0745050',
            'val': '裁缝'
        },
        {
            'code': '0745051',
            'val': '剧装工'
        },
        {
            'code': '0745052',
            'val': '设计师'
        },
        {
            'code': '0745053',
            'val': '制鞋工'
        },
        {
            'code': '0745054',
            'val': '制帽工'
        },
        {
            'code': '0745055',
            'val': '皮革加工工'
        },
        {
            'code': '0745056',
            'val': '毛皮加工工'
        },
        {
            'code': '0745057',
            'val': '缝纫制品充填处理工'
        },
        {
            'code': '0745058',
            'val': '胶制服装上胶工'
        },
        {
            'code': '0745059',
            'val': '服装水洗工'
        },
        {
            'code': '0745060',
            'val': '制造工人'
        },
        {
            'code': '0745061',
            'val': '质量检验人员'
        },
        {
            'code': '0745062',
            'val': '缝纫制品再加工人员'
        },
        {
            'code': '0745063',
            'val': '纺织纤维检验工'
        },
        {
            'code': '0745064',
            'val': '针纺织品检验工'
        },
        {
            'code': '0745065',
            'val': '印染工艺检验工'
        },
        {
            'code': '0745067',
            'val': '服装鞋帽检验工'
        },
        {
            'code': '0745068',
            'val': '刺绣工人'
        },
        {
            'code': '0745069',
            'val': '地毯制造工人'
        },
        {
            'code': '0745070',
            'val': '接触尘埃或有毒化合物人员'
        },
        {
            'code': '0745071',
            'val': '床垫及枕头织造业人员'
        },
        {
            'code': '0745072',
            'val': '羽绒、羽毛加工人员'
        }
    ],
    '0746': [
        {
            'code': '0746001',
            'val': '领班、监工'
        },
        {
            'code': '0746002',
            'val': '纸箱制作工'
        },
        {
            'code': '0746003',
            'val': '技师'
        },
        {
            'code': '0746004',
            'val': '仓库管理员'
        },
        {
            'code': '0746008',
            'val': '造纸工'
        },
        {
            'code': '0746009',
            'val': '纸张整饰工'
        },
        {
            'code': '0746010',
            'val': '宣纸书画纸制作工'
        },
        {
            'code': '0746011',
            'val': '瓦楞纸箱制作工'
        },
        {
            'code': '0746012',
            'val': '纸盒制作工'
        }
    ],
    '0747': [
        {
            'code': '0747001',
            'val': '技术人员'
        },
        {
            'code': '0747002',
            'val': '领班、监工'
        },
        {
            'code': '0747004',
            'val': '木制家具修理工人'
        },
        {
            'code': '0747006',
            'val': '金属家具修理工人'
        },
        {
            'code': '0747007',
            'val': '木材及家具检验工'
        },
        {
            'code': '0747008',
            'val': '油漆工'
        },
        {
            'code': '0747010',
            'val': '闵工'
        }
    ],
    '0748': [
        {
            'code': '0748001',
            'val': '制米工'
        },
        {
            'code': '0748002',
            'val': '制粉工'
        },
        {
            'code': '0748003',
            'val': '制油工'
        },
        {
            'code': '0748004',
            'val': '食糖制造工'
        },
        {
            'code': '0748005',
            'val': '糖果制造工'
        },
        {
            'code': '0748006',
            'val': '巧克力制造工'
        },
        {
            'code': '0748007',
            'val': '乳品预处理工'
        },
        {
            'code': '0748008',
            'val': '乳品加工工'
        },
        {
            'code': '0748009',
            'val': '蜂产品加工工'
        },
        {
            'code': '0748010',
            'val': '冷食品制作工'
        },
        {
            'code': '0748011',
            'val': '速冻食品制作工'
        },
        {
            'code': '0748012',
            'val': '食品罐头加工工'
        },
        {
            'code': '0748013',
            'val': '饮料制作工'
        },
        {
            'code': '0748014',
            'val': '白酒酿造工'
        },
        {
            'code': '0748015',
            'val': '啤酒酿造工'
        },
        {
            'code': '0748016',
            'val': '黄酒酿造工'
        },
        {
            'code': '0748017',
            'val': '果露酒酿造工'
        },
        {
            'code': '0748018',
            'val': '洒精制造工'
        },
        {
            'code': '0748019',
            'val': '酒品标签粘贴、包装工人'
        },
        {
            'code': '0748020',
            'val': '酶制剂制造工'
        },
        {
            'code': '0748021',
            'val': '柠檬酸制造工'
        },
        {
            'code': '0748022',
            'val': '酱油酱类制作工'
        },
        {
            'code': '0748023',
            'val': '食醋制作工'
        },
        {
            'code': '0748024',
            'val': '酱腌菜制作工'
        },
        {
            'code': '0748025',
            'val': '食用调料制作工'
        },
        {
            'code': '0748026',
            'val': '味精制作工'
        },
        {
            'code': '0748027',
            'val': '糕点、面包烘焙工'
        },
        {
            'code': '0748028',
            'val': '糕点装饰工'
        },
        {
            'code': '0748029',
            'val': '米面主食制作工'
        },
        {
            'code': '0748030',
            'val': '油脂制品工'
        },
        {
            'code': '0748031',
            'val': '植物蛋白制作工'
        },
        {
            'code': '0748032',
            'val': '豆制品制作工'
        },
        {
            'code': '0748033',
            'val': '猪/牛/羊屠宰加工工'
        },
        {
            'code': '0748034',
            'val': '肠衣工'
        },
        {
            'code': '0748035',
            'val': '禽类屠宰加工工'
        },
        {
            'code': '0748036',
            'val': '熟肉制品加工工'
        },
        {
            'code': '0748037',
            'val': '蛋品及再制蛋品加工工'
        },
        {
            'code': '0748038',
            'val': '饲料原料清理上料工'
        },
        {
            'code': '0748039',
            'val': '饲料粉碎工'
        },
        {
            'code': '0748040',
            'val': '饲料配料混合工'
        },
        {
            'code': '0748041',
            'val': '饲料制料工'
        },
        {
            'code': '0748042',
            'val': '饲料添加剂预混工'
        },
        {
            'code': '0748043',
            'val': '饲料厂中央控制室操作工'
        },
        {
            'code': '0748044',
            'val': '领班、监工'
        },
        {
            'code': '0748045',
            'val': '冰块制造工人'
        },
        {
            'code': '0748046',
            'val': '技师(食品原料制造业)'
        },
        {
            'code': '0748047',
            'val': '食品饮料制造工人'
        },
        {
            'code': '0748048',
            'val': '装罐工人'
        },
        {
            'code': '0748049',
            'val': '技师(烟草、雪茄及香烟制造业)'
        }
    ],
    '0749': [
        {
            'code': '0749001',
            'val': '玻璃配料工'
        },
        {
            'code': '0749002',
            'val': '玻璃熔化工'
        },
        {
            'code': '0749003',
            'val': '玻璃制板及玻璃成型工'
        },
        {
            'code': '0749007',
            'val': '监工'
        },
        {
            'code': '0749008',
            'val': '玻璃纤维制品工'
        },
        {
            'code': '0749009',
            'val': '玻璃钢制品工'
        },
        {
            'code': '0749010',
            'val': '石英玻璃制品加工工'
        },
        {
            'code': '0749011',
            'val': '陶瓷原料准备工'
        },
        {
            'code': '0749012',
            'val': '陶瓷成型工'
        },
        {
            'code': '0749013',
            'val': '陶瓷烧成工'
        },
        {
            'code': '0749014',
            'val': '陶瓷装饰工'
        },
        {
            'code': '0749015',
            'val': '匣钵、模型制作工'
        },
        {
            'code': '0749016',
            'val': '古建琉璃工'
        },
        {
            'code': '0749017',
            'val': '搪瓷釉浆熔制工'
        },
        {
            'code': '0749018',
            'val': '搪瓷坯体制作工'
        },
        {
            'code': '0749019',
            'val': '搪瓷涂搪烧成工'
        },
        {
            'code': '0749020',
            'val': '搪瓷花版饰花工'
        },
        {
            'code': '0749021',
            'val': '工程师'
        },
        {
            'code': '0749022',
            'val': '领班'
        },
        {
            'code': '0749023',
            'val': '工人'
        },
        {
            'code': '0749029',
            'val': '陶瓷制品、木炭、砖块制造工'
        },
        {
            'code': '0749030',
            'val': '砖、瓦生产工'
        },
        {
            'code': '0749032',
            'val': '保温、吸音材料制造工'
        },
        {
            'code': '0749037',
            'val': '人工合成制品工'
        },
        {
            'code': '0749038',
            'val': '高领土制造工人'
        },
        {
            'code': '0749039',
            'val': '炉前工'
        },
        {
            'code': '0749040',
            'val': '玻璃搬运工'
        },
        {
            'code': '0749042',
            'val': '匣钵/模型制作工人(陶瓷)'
        },
        {
            'code': '0749043',
            'val': '负责行政工作（经理、文员、零售商）'
        }
    ],
    '0750': [
        {
            'code': '0750001',
            'val': '内勤行政工作人员'
        },
        {
            'code': '0750002',
            'val': '工程师/领班/监工'
        },
        {
            'code': '0750003',
            'val': '烟叶调制工'
        },
        {
            'code': '0750004',
            'val': '烟叶分级工'
        },
        {
            'code': '0750005',
            'val': '挂杆复烤工'
        },
        {
            'code': '0750006',
            'val': '打叶复烤工'
        },
        {
            'code': '0750007',
            'val': '烟叶回潮工'
        },
        {
            'code': '0750008',
            'val': '烟叶发酵工'
        },
        {
            'code': '0750009',
            'val': '烟叶制丝工'
        },
        {
            'code': '0750010',
            'val': '膨胀烟丝工'
        },
        {
            'code': '0750011',
            'val': '白肋烟处理工'
        },
        {
            'code': '0750012',
            'val': '烟草薄片工'
        },
        {
            'code': '0750013',
            'val': '卷烟卷接工'
        },
        {
            'code': '0750014',
            'val': '烟用二醋片制造工'
        },
        {
            'code': '0750015',
            'val': '烟用丝束制造工'
        },
        {
            'code': '0750016',
            'val': '滤棒工'
        }
    ],
    '0751': [
        {
            'code': '0751001',
            'val': '化学合成制药工'
        },
        {
            'code': '0751002',
            'val': '生化药品制造工'
        },
        {
            'code': '0751003',
            'val': '发酵工程制药工'
        },
        {
            'code': '0751004',
            'val': '疫苗制品工'
        },
        {
            'code': '0751005',
            'val': '血液制品工'
        },
        {
            'code': '0751006',
            'val': '基因工程产品工'
        },
        {
            'code': '0751007',
            'val': '药物制剂工'
        },
        {
            'code': '0751008',
            'val': '淀粉葡萄糖制造工'
        },
        {
            'code': '0751009',
            'val': '医药代表'
        },
        {
            'code': '0751010',
            'val': '一般内勤人员'
        },
        {
            'code': '0751011',
            'val': '技师/产品研究人员'
        },
        {
            'code': '0751012',
            'val': '中药材种植人员'
        },
        {
            'code': '0751013',
            'val': '中药炮制与配制工'
        },
        {
            'code': '0751014',
            'val': '中药液体制剂工'
        },
        {
            'code': '0751015',
            'val': '中药固体制剂工'
        },
        {
            'code': '0751016',
            'val': '医疗器械装配工'
        },
        {
            'code': '0751017',
            'val': '假肢制作装配工'
        },
        {
            'code': '0751018',
            'val': '矫形器制作装配工'
        }
    ],
    '0752': [
        {
            'code': '0752001',
            'val': '宝石琢磨工'
        },
        {
            'code': '0752002',
            'val': '贵金属首饰制作工'
        },
        {
            'code': '0752003',
            'val': '地毯制作工'
        },
        {
            'code': '0752004',
            'val': '金属、塑料、木制玩具装配工'
        },
        {
            'code': '0752005',
            'val': '布绒玩具制作工'
        },
        {
            'code': '0752006',
            'val': '搪塑玩具制作工'
        },
        {
            'code': '0752007',
            'val': '漆器制胎工'
        },
        {
            'code': '0752008',
            'val': '彩绘雕填制作工'
        },
        {
            'code': '0752009',
            'val': '漆器镶嵌工'
        },
        {
            'code': '0752010',
            'val': '机绣工'
        },
        {
            'code': '0752011',
            'val': '手绣制作工'
        },
        {
            'code': '0752012',
            'val': '抽纱挑编工'
        },
        {
            'code': '0752013',
            'val': '景泰蓝制作工'
        },
        {
            'code': '0752014',
            'val': '金属摆件工'
        },
        {
            'code': '0752015',
            'val': '金属手工艺品加工工人'
        },
        {
            'code': '0752016',
            'val': '金属工艺品雕刻工'
        },
        {
            'code': '0752017',
            'val': '竹木制手工艺品雕刻工'
        },
        {
            'code': '0752018',
            'val': '玉器加工技师'
        },
        {
            'code': '0752019',
            'val': '玉器加工工人'
        },
        {
            'code': '0752020',
            'val': '装饰美工'
        },
        {
            'code': '0752021',
            'val': '雕塑翻制工'
        },
        {
            'code': '0752022',
            'val': '壁画制作工'
        },
        {
            'code': '0752023',
            'val': '油画外框制作工'
        },
        {
            'code': '0752024',
            'val': '装裱工'
        },
        {
            'code': '0752025',
            'val': '版画制作工'
        },
        {
            'code': '0752026',
            'val': '民间工艺品制作工'
        },
        {
            'code': '0752027',
            'val': '人造花制作工'
        },
        {
            'code': '0752028',
            'val': '工艺画制作工'
        },
        {
            'code': '0752030',
            'val': '布类纸品工艺品加工工人'
        },
        {
            'code': '0752031',
            'val': '矿石手工艺品加工人员'
        },
        {
            'code': '0752032',
            'val': '竹木制手工艺品加工工人'
        },
        {
            'code': '0752033',
            'val': '漆器工艺品制作人员'
        },
        {
            'code': '0752034',
            'val': '陶瓷制作工'
        },
        {
            'code': '0752035',
            'val': '工人（长磨石工及挑选、燧石货仓等工人'
        },
        {
            'code': '0752036',
            'val': '切割工人'
        },
        {
            'code': '0752037',
            'val': '皮革手工艺品制作工'
        },
        {
            'code': '0752038',
            'val': '砖木制品生产人员'
        },
        {
            'code': '0752039',
            'val': '珠宝首饰加工制作人员'
        },
        {
            'code': '0752040',
            'val': '美术品制作人员'
        }
    ],
    '0753': [
        {
            'code': '0753001',
            'val': '墨制作工'
        },
        {
            'code': '0753002',
            'val': '墨水制造工'
        },
        {
            'code': '0753003',
            'val': '墨汁制造工'
        },
        {
            'code': '0753004',
            'val': '绘图仪器制作工'
        },
        {
            'code': '0753005',
            'val': '静电复印机消耗材制造工'
        },
        {
            'code': '0753006',
            'val': '毛笔制作工'
        },
        {
            'code': '0753007',
            'val': '自来水笔制作工'
        },
        {
            'code': '0753008',
            'val': '圆珠笔制作工'
        },
        {
            'code': '0753009',
            'val': '铅笔制造工'
        },
        {
            'code': '0753010',
            'val': '印泥制作工'
        },
        {
            'code': '0753011',
            'val': '制球工'
        },
        {
            'code': '0753012',
            'val': '球拍、球网制作工'
        },
        {
            'code': '0753013',
            'val': '健身器材制作工'
        },
        {
            'code': '0753014',
            'val': '钢琴及键盘乐器制作工'
        },
        {
            'code': '0753015',
            'val': '提琴制作工'
        },
        {
            'code': '0753016',
            'val': '管乐器制作工'
        },
        {
            'code': '0753017',
            'val': '民族拉弦、弹拨乐器制作工'
        },
        {
            'code': '0753018',
            'val': '吹奏乐器制作工'
        },
        {
            'code': '0753019',
            'val': '打击乐器制作工'
        },
        {
            'code': '0753020',
            'val': '电声乐器制作工'
        }
    ],
    '0801': [
        {
            'code': '0801001',
            'val': '广播电视编播工程技术人员（非高空）'
        }
    ],
    '0802': [
        {
            'code': '0802001',
            'val': '一般记者'
        },
        {
            'code': '0802002',
            'val': '外勤记者'
        },
        {
            'code': '0802003',
            'val': '摄影记者'
        },
        {
            'code': '0802005',
            'val': '电视记者'
        }
    ],
    '0803': [
        {
            'code': '0803001',
            'val': '文字编辑'
        },
        {
            'code': '0803002',
            'val': '美术编辑'
        },
        {
            'code': '0803003',
            'val': '技术编辑'
        },
        {
            'code': '0803004',
            'val': '电子出版物编辑'
        }
    ],
    '0804': [
        {
            'code': '0804001',
            'val': '校对员'
        }
    ],
    '0805': [
        {
            'code': '0805001',
            'val': '播音员'
        },
        {
            'code': '0805002',
            'val': '节目主持员'
        }
    ],
    '0806': [
        {
            'code': '0806001',
            'val': '翻译'
        }
    ],
    '0807': [
        {
            'code': '0807001',
            'val': '图书馆学、情报学研究人员'
        },
        {
            'code': '0807002',
            'val': '图书资料业务人员'
        },
        {
            'code': '0807003',
            'val': '档案业务人员'
        },
        {
            'code': '0807004',
            'val': '微缩摄影人员'
        },
        {
            'code': '0807005',
            'val': '负责人(出版商、书店、文具店)'
        },
        {
            'code': '0807006',
            'val': '店员'
        },
        {
            'code': '0807007',
            'val': '外务员'
        },
        {
            'code': '0807008',
            'val': '送货员'
        },
        {
            'code': '0807009',
            'val': '内勤人员'
        },
        {
            'code': '0807010',
            'val': '推销员'
        },
        {
            'code': '0807011',
            'val': '送报员'
        },
        {
            'code': '0807012',
            'val': '图书馆工作人员'
        }
    ],
    '0808': [
        {
            'code': '0808001',
            'val': '考古工作者'
        },
        {
            'code': '0808002',
            'val': '文物鉴定及保管人员'
        },
        {
            'code': '0808003',
            'val': '文物保护专业人员'
        },
        {
            'code': '0808004',
            'val': '博物馆工作人员'
        },
        {
            'code': '0808005',
            'val': '考古发掘工'
        },
        {
            'code': '0808006',
            'val': '文物修复工'
        },
        {
            'code': '0808007',
            'val': '文物拓印工'
        },
        {
            'code': '0808008',
            'val': '古旧书画修复工'
        },
        {
            'code': '0808009',
            'val': '考古及文物保护工作'
        },
        {
            'code': '0808010',
            'val': '翻译'
        }
    ],
    '0809': [
        {
            'code': '0809001',
            'val': '排版/制版工人'
        },
        {
            'code': '0809002',
            'val': '装订工人'
        },
        {
            'code': '0809003',
            'val': '印刷工人'
        },
        {
            'code': '0809004',
            'val': '切纸工人'
        },
        {
            'code': '0809005',
            'val': '印品整饰工人'
        }
    ],
    '0810': [
        {
            'code': '0810001',
            'val': '寺庙及教堂管理人员'
        },
        {
            'code': '0810002',
            'val': '宗教团体工作人员'
        },
        {
            'code': '0810003',
            'val': '僧尼，道士及传教人员'
        },
        {
            'code': '0810004',
            'val': '宗教职业者'
        },
        {
            'code': '0810005',
            'val': '乩童'
        }
    ],
    '0811': [
        {
            'code': '0811001',
            'val': '新闻广告公关员'
        }
    ],
    '0812': [
        {
            'code': '0812001',
            'val': '计算机操作员'
        }
    ],
    '0813': [
        {
            'code': '0813001',
            'val': '其他新闻出版、文化工作人员'
        }
    ],
    '0814': [
        {
            'code': '0814001',
            'val': '广告设计人员'
        },
        {
            'code': '0814004',
            'val': '广告会展设计师'
        },
        {
            'code': '0814005',
            'val': '一般内勤'
        },
        {
            'code': '0814006',
            'val': '业务员'
        },
        {
            'code': '0814007',
            'val': '广告影片拍摄录制人员'
        },
        {
            'code': '0814011',
            'val': '广告招牌绘制人员（地面）'
        }
    ],
    '0901': [
        {
            'code': '0901001',
            'val': '医学研究人员'
        },
        {
            'code': '0901002',
            'val': '一般医师及护士'
        },
        {
            'code': '0901003',
            'val': '精神病医师，看护，护士'
        },
        {
            'code': '0901004',
            'val': '化验技师'
        }
    ],
    '0902': [
        {
            'code': '0902001',
            'val': '内科医师'
        },
        {
            'code': '0902002',
            'val': '外科医师'
        },
        {
            'code': '0902003',
            'val': '儿科医师'
        },
        {
            'code': '0902004',
            'val': '妇产科医师'
        },
        {
            'code': '0902005',
            'val': '眼科医师'
        },
        {
            'code': '0902006',
            'val': '耳鼻喉科医师'
        },
        {
            'code': '0902007',
            'val': '口腔科医师'
        },
        {
            'code': '0902008',
            'val': '皮肤科医师'
        },
        {
            'code': '0902009',
            'val': '精神科医师'
        },
        {
            'code': '0902010',
            'val': '心理医师'
        },
        {
            'code': '0902011',
            'val': '传染病科医师'
        },
        {
            'code': '0902012',
            'val': '急诊科医师'
        },
        {
            'code': '0902013',
            'val': '康复科医师'
        },
        {
            'code': '0902014',
            'val': '麻醉科医师'
        },
        {
            'code': '0902015',
            'val': '病理科医师'
        },
        {
            'code': '0902016',
            'val': '放射科/核医学医师'
        },
        {
            'code': '0902017',
            'val': '超声诊断科医师'
        },
        {
            'code': '0902018',
            'val': '放射肿瘤科医师'
        },
        {
            'code': '0902019',
            'val': '全科医师'
        },
        {
            'code': '0902020',
            'val': '乡村医师'
        },
        {
            'code': '0902021',
            'val': '妇女保健医师'
        },
        {
            'code': '0902022',
            'val': '输（采供）血医师'
        }
    ],
    '0903': [
        {
            'code': '0903001',
            'val': '中医内科医师'
        },
        {
            'code': '0903002',
            'val': '中医外科医师'
        },
        {
            'code': '0903003',
            'val': '中医妇科医师'
        },
        {
            'code': '0903004',
            'val': '中医儿科医师'
        },
        {
            'code': '0903005',
            'val': '中医眼医疗医师'
        },
        {
            'code': '0903006',
            'val': '中医皮肤科医师'
        },
        {
            'code': '0903007',
            'val': '中医骨伤科医师'
        },
        {
            'code': '0903008',
            'val': '中医肛肠科医师'
        },
        {
            'code': '0903009',
            'val': '中医耳鼻喉科医师'
        },
        {
            'code': '0903010',
            'val': '针炙科医师'
        },
        {
            'code': '0903011',
            'val': '推拿按摩科医师'
        }
    ],
    '0904': [
        {
            'code': '0904001',
            'val': '中西医结合医师'
        }
    ],
    '0905': [
        {
            'code': '0905001',
            'val': '民族医师'
        }
    ],
    '0906': [
        {
            'code': '0906001',
            'val': '流行病学医师'
        },
        {
            'code': '0906002',
            'val': '营养与食品卫生医师'
        },
        {
            'code': '0906003',
            'val': '环境卫生医师'
        },
        {
            'code': '0906004',
            'val': '职业病医师'
        },
        {
            'code': '0906005',
            'val': '劳动（职业）卫生医师'
        },
        {
            'code': '0906006',
            'val': '放射卫生医师'
        },
        {
            'code': '0906007',
            'val': '儿少和学校卫生医师'
        },
        {
            'code': '0906008',
            'val': '监狱、看守所医师'
        }
    ],
    '0907': [
        {
            'code': '0907001',
            'val': '西药剂师'
        },
        {
            'code': '0907002',
            'val': '中药药师'
        }
    ],
    '0908': [
        {
            'code': '0908001',
            'val': '影像技师'
        },
        {
            'code': '0908002',
            'val': '麻醉技师'
        },
        {
            'code': '0908003',
            'val': '病理技师'
        },
        {
            'code': '0908004',
            'val': '临床检验技师'
        },
        {
            'code': '0908005',
            'val': '公卫检验技师'
        },
        {
            'code': '0908006',
            'val': '卫生工程技师'
        },
        {
            'code': '0908007',
            'val': '输（采供）血技师'
        }
    ],
    '0909': [
        {
            'code': '0909001',
            'val': '病房护士'
        },
        {
            'code': '0909002',
            'val': '门诊护士'
        },
        {
            'code': '0909003',
            'val': '手术室护士'
        },
        {
            'code': '0909004',
            'val': '供应室护士'
        },
        {
            'code': '0909005',
            'val': '社区护士'
        },
        {
            'code': '0909006',
            'val': '助产士'
        },
        {
            'code': '0909007',
            'val': '监狱、看守所医生及护士'
        }
    ],
    '0910': [
        {
            'code': '0910001',
            'val': '其他卫生专业技术人员'
        }
    ],
    '0911': [
        {
            'code': '0911001',
            'val': '医药商品购销员'
        }
    ],
    '0912': [
        {
            'code': '0912001',
            'val': '中药调剂员'
        }
    ],
    '0913': [
        {
            'code': '0913001',
            'val': '医药商品储运员'
        }
    ],
    '0914': [
        {
            'code': '0914001',
            'val': '医疗临床辅助服务员'
        },
        {
            'code': '0914002',
            'val': '药房辅助员'
        },
        {
            'code': '0914003',
            'val': '卫生防疫、妇幼保健员'
        },
        {
            'code': '0914004',
            'val': '医务行政人员'
        },
        {
            'code': '0914005',
            'val': '护理员'
        },
        {
            'code': '0914006',
            'val': '药剂检验人员'
        },
        {
            'code': '0914007',
            'val': '放射线之技术人员'
        },
        {
            'code': '0914008',
            'val': '放射线之修护人员'
        },
        {
            'code': '0914009',
            'val': '配膳员'
        },
        {
            'code': '0914010',
            'val': '卫生检查员'
        },
        {
            'code': '0914011',
            'val': '医院后勤人员、医疗临床辅助服务员、药房辅助员'
        },
        {
            'code': '0914012',
            'val': '医院炊事'
        },
        {
            'code': '0914013',
            'val': '医院勤杂工、清洁工'
        },
        {
            'code': '0914014',
            'val': '分析员'
        },
        {
            'code': '0914015',
            'val': '助产士、齿模技工'
        },
        {
            'code': '0914016',
            'val': '跌打损伤治疗人员'
        },
        {
            'code': '0914017',
            'val': '验光师'
        },
        {
            'code': '0914018',
            'val': '理疗师'
        },
        {
            'code': '0914019',
            'val': '消毒员'
        },
        {
            'code': '0914020',
            'val': '医疗设备、口腔科设备维修人员'
        },
        {
            'code': '0914021',
            'val': '医用气体工'
        }
    ]
};
