/**
 * Created by admin on 2017/2/14.
 */


export const provinces = [
    {
        'code': '110000',
        'val': '北京市'
    },
    {
        'code': '120000',
        'val': '天津市'
    },
    {
        'code': '130000',
        'val': '河北省'
    },
    {
        'code': '140000',
        'val': '山西省'
    },
    {
        'code': '150000',
        'val': '内蒙古自治区'
    },
    {
        'code': '210000',
        'val': '辽宁省'
    },
    {
        'code': '220000',
        'val': '吉林省'
    },
    {
        'code': '230000',
        'val': '黑龙江省'
    },
    {
        'code': '310000',
        'val': '上海市'
    },
    {
        'code': '320000',
        'val': '江苏省'
    },
    {
        'code': '330000',
        'val': '浙江省'
    },
    {
        'code': '340000',
        'val': '安徽省'
    },
    {
        'code': '350000',
        'val': '福建省'
    },
    {
        'code': '360000',
        'val': '江西省'
    },
    {
        'code': '370000',
        'val': '山东省'
    },
    {
        'code': '410000',
        'val': '河南省'
    },
    {
        'code': '420000',
        'val': '湖北省'
    },
    {
        'code': '430000',
        'val': '湖南省'
    },
    {
        'code': '440000',
        'val': '广东省'
    },
    {
        'code': '450000',
        'val': '广西壮族自治区'
    },
    {
        'code': '460000',
        'val': '海南省'
    },
    {
        'code': '500000',
        'val': '重庆市'
    },
    {
        'code': '510000',
        'val': '四川省'
    },
    {
        'code': '520000',
        'val': '贵州省'
    },
    {
        'code': '530000',
        'val': '云南省'
    },
    {
        'code': '540000',
        'val': '西藏自治区'
    },
    {
        'code': '610000',
        'val': '陕西省'
    },
    {
        'code': '620000',
        'val': '甘肃省'
    },
    {
        'code': '630000',
        'val': '青海省'
    },
    {
        'code': '640000',
        'val': '宁夏回族自治区'
    },
    {
        'code': '650000',
        'val': '新疆维吾尔自治区'
    },
];

export const citys = {
    '110000': [
        {
            'code': '110100',
            'val': '市辖区'
        },
        {
            'code': '110200',
            'val': '县'
        }
    ],
    '500000': [
        {
            'code': '500100',
            'val': '市辖区'
        },
        {
            'code': '500200',
            'val': '县'
        },
        {
            'code': '500300',
            'val': '市'
        }
    ],
    '120000': [
        {
            'code': '120100',
            'val': '市辖区'
        },
        {
            'code': '120200',
            'val': '县'
        }
    ],
    '130000': [
        {
            'code': '130100',
            'val': '石家庄市'
        },
        {
            'code': '130200',
            'val': '唐山市'
        },
        {
            'code': '130300',
            'val': '秦皇岛市'
        },
        {
            'code': '130400',
            'val': '邯郸市'
        },
        {
            'code': '130500',
            'val': '邢台市'
        },
        {
            'code': '130600',
            'val': '保定市'
        },
        {
            'code': '130700',
            'val': '衡水市'
        },
        {
            'code': '130800',
            'val': '承德市'
        },
        {
            'code': '130900',
            'val': '沧州市'
        },
        {
            'code': '131000',
            'val': '廊坊市'
        },
        {
            'code': '131100',
            'val': '张家口市'
        }
    ],
    '140000': [
        {
            'code': '140100',
            'val': '太原市'
        },
        {
            'code': '140200',
            'val': '大同市'
        },
        {
            'code': '140300',
            'val': '阳泉市'
        },
        {
            'code': '140400',
            'val': '长治市'
        },
        {
            'code': '140500',
            'val': '晋城市'
        },
        {
            'code': '140600',
            'val': '朔州市'
        },
        {
            'code': '140700',
            'val': '晋中市'
        },
        {
            'code': '140800',
            'val': '运城市'
        },
        {
            'code': '140900',
            'val': '忻州市'
        },
        {
            'code': '141000',
            'val': '临汾市'
        },
        {
            'code': '141100',
            'val': '吕梁市'
        }
    ],
    '150000': [
        {
            'code': '150100',
            'val': '呼和浩特市'
        },
        {
            'code': '150200',
            'val': '包头市'
        },
        {
            'code': '150300',
            'val': '乌海市'
        },
        {
            'code': '150400',
            'val': '赤峰市'
        },
        {
            'code': '150500',
            'val': '通辽市'
        },
        {
            'code': '150600',
            'val': '鄂尔多斯市'
        },
        {
            'code': '150700',
            'val': '呼伦贝尔市'
        },
        {
            'code': '150800',
            'val': '巴彦淖尔市'
        },
        {
            'code': '150900',
            'val': '乌兰察布市'
        },
        {
            'code': '152200',
            'val': '兴安盟'
        },
        {
            'code': '152500',
            'val': '锡林郭勒盟'
        },
        {
            'code': '152600',
            'val': '乌兰察布盟'
        },
        {
            'code': '152900',
            'val': '阿拉善盟'
        }
    ],
    '210000': [
        {
            'code': '210100',
            'val': '沈阳市'
        },
        {
            'code': '210200',
            'val': '大连市'
        },
        {
            'code': '210300',
            'val': '鞍山市'
        },
        {
            'code': '210400',
            'val': '抚顺市'
        },
        {
            'code': '210500',
            'val': '本溪市'
        },
        {
            'code': '210600',
            'val': '丹东市'
        },
        {
            'code': '210700',
            'val': '锦州市'
        },
        {
            'code': '210800',
            'val': '营口市'
        },
        {
            'code': '210900',
            'val': '阜新市'
        },
        {
            'code': '211000',
            'val': '辽阳市'
        },
        {
            'code': '211100',
            'val': '盘锦市'
        },
        {
            'code': '211200',
            'val': '铁岭市'
        },
        {
            'code': '211300',
            'val': '朝阳市'
        },
        {
            'code': '211400',
            'val': '葫芦岛市'
        }
    ],
    '220000': [
        {
            'code': '220100',
            'val': '长春市'
        },
        {
            'code': '220200',
            'val': '吉林市'
        },
        {
            'code': '220300',
            'val': '四平市'
        },
        {
            'code': '220400',
            'val': '辽源市'
        },
        {
            'code': '220500',
            'val': '通化市'
        },
        {
            'code': '220600',
            'val': '白山市'
        },
        {
            'code': '220700',
            'val': '松原市'
        },
        {
            'code': '220800',
            'val': '白城市'
        },
        {
            'code': '222400',
            'val': '延边朝鲜族自治州'
        }
    ],
    '230000': [
        {
            'code': '230100',
            'val': '哈尔滨市'
        },
        {
            'code': '230200',
            'val': '齐齐哈尔市'
        },
        {
            'code': '230300',
            'val': '鸡西市'
        },
        {
            'code': '230400',
            'val': '鹤岗市'
        },
        {
            'code': '230500',
            'val': '双鸭山市'
        },
        {
            'code': '230600',
            'val': '大庆市'
        },
        {
            'code': '230700',
            'val': '伊春市'
        },
        {
            'code': '230800',
            'val': '佳木斯市'
        },
        {
            'code': '230900',
            'val': '七台河市'
        },
        {
            'code': '231000',
            'val': '牡丹江市'
        },
        {
            'code': '231100',
            'val': '黑河市'
        },
        {
            'code': '231200',
            'val': '绥化市'
        },
        {
            'code': '232700',
            'val': '大兴安岭地区'
        }
    ],
    '310000': [
        {
            'code': '310100',
            'val': '市辖区'
        }
    ],
    '320000': [
        {
            'code': '310100',
            'val': '市辖区'
        },
        {
            'code': '320100',
            'val': '南京市'
        },
        {
            'code': '320200',
            'val': '无锡市'
        },
        {
            'code': '320300',
            'val': '徐州市'
        },
        {
            'code': '320400',
            'val': '常州市'
        },
        {
            'code': '320500',
            'val': '苏州市'
        },
        {
            'code': '320600',
            'val': '南通市'
        },
        {
            'code': '320700',
            'val': '连云港市'
        },
        {
            'code': '320800',
            'val': '淮安市'
        },
        {
            'code': '320900',
            'val': '盐城市'
        },
        {
            'code': '321000',
            'val': '扬州市'
        },
        {
            'code': '321100',
            'val': '镇江市'
        },
        {
            'code': '321200',
            'val': '泰州市'
        },
        {
            'code': '321300',
            'val': '宿迁市'
        }
    ],
    '330000': [
        {
            'code': '330100',
            'val': '杭州市'
        },
        {
            'code': '330200',
            'val': '宁波市'
        },
        {
            'code': '330300',
            'val': '温州市'
        },
        {
            'code': '330400',
            'val': '嘉兴市'
        },
        {
            'code': '330500',
            'val': '湖州市'
        },
        {
            'code': '330600',
            'val': '绍兴市'
        },
        {
            'code': '330700',
            'val': '金华市'
        },
        {
            'code': '330800',
            'val': '衢州市'
        },
        {
            'code': '330900',
            'val': '舟山市'
        },
        {
            'code': '331000',
            'val': '台州市'
        },
        {
            'code': '331100',
            'val': '丽水市'
        }
    ],
    '340000': [
        {
            'code': '340100',
            'val': '合肥市'
        },
        {
            'code': '340200',
            'val': '芜湖市'
        },
        {
            'code': '340300',
            'val': '蚌埠市'
        },
        {
            'code': '340400',
            'val': '淮南市'
        },
        {
            'code': '340500',
            'val': '马鞍山市'
        },
        {
            'code': '340600',
            'val': '淮北市'
        },
        {
            'code': '340700',
            'val': '铜陵市'
        },
        {
            'code': '340800',
            'val': '安庆市'
        },
        {
            'code': '341000',
            'val': '黄山市'
        },
        {
            'code': '341100',
            'val': '滁州市'
        },
        {
            'code': '341200',
            'val': '阜阳市'
        },
        {
            'code': '341300',
            'val': '宿州市'
        },
        {
            'code': '341400',
            'val': '巢湖市'
        },
        {
            'code': '341500',
            'val': '六安市'
        },
        {
            'code': '341600',
            'val': '亳州市'
        },
        {
            'code': '341700',
            'val': '池州市'
        },
        {
            'code': '341800',
            'val': '宣城市'
        }
    ],
    '350000': [
        {
            'code': '350100',
            'val': '福州市'
        },
        {
            'code': '350200',
            'val': '厦门市'
        },
        {
            'code': '350300',
            'val': '莆田市'
        },
        {
            'code': '350400',
            'val': '三明市'
        },
        {
            'code': '350500',
            'val': '泉州市'
        },
        {
            'code': '350600',
            'val': '漳州市'
        },
        {
            'code': '350700',
            'val': '南平市'
        },
        {
            'code': '350800',
            'val': '龙岩市'
        },
        {
            'code': '350900',
            'val': '宁德市'
        }
    ],
    '360000': [
        {
            'code': '360100',
            'val': '南昌市'
        },
        {
            'code': '360200',
            'val': '景德镇市'
        },
        {
            'code': '360300',
            'val': '萍乡市'
        },
        {
            'code': '360400',
            'val': '九江市'
        },
        {
            'code': '360500',
            'val': '新余市'
        },
        {
            'code': '360600',
            'val': '鹰潭市'
        },
        {
            'code': '360700',
            'val': '赣州市'
        },
        {
            'code': '360800',
            'val': '吉安市'
        },
        {
            'code': '360900',
            'val': '宜春市'
        },
        {
            'code': '361000',
            'val': '抚州市'
        },
        {
            'code': '361100',
            'val': '上饶市'
        }
    ],
    '370000': [
        {
            'code': '370100',
            'val': '济南市'
        },
        {
            'code': '370200',
            'val': '青岛市'
        },
        {
            'code': '370300',
            'val': '淄博市'
        },
        {
            'code': '370400',
            'val': '枣庄市'
        },
        {
            'code': '370500',
            'val': '东营市'
        },
        {
            'code': '370600',
            'val': '烟台市'
        },
        {
            'code': '370700',
            'val': '潍坊市'
        },
        {
            'code': '370800',
            'val': '济宁市'
        },
        {
            'code': '370900',
            'val': '泰安市'
        },
        {
            'code': '371000',
            'val': '威海市'
        },
        {
            'code': '371100',
            'val': '日照市'
        },
        {
            'code': '371200',
            'val': '莱芜市'
        },
        {
            'code': '371300',
            'val': '临沂市'
        },
        {
            'code': '371400',
            'val': '德州市'
        },
        {
            'code': '371500',
            'val': '聊城市'
        },
        {
            'code': '371600',
            'val': '滨州市'
        },
        {
            'code': '371700',
            'val': '菏泽市'
        }
    ],
    '410000': [
        {
            'code': '410100',
            'val': '郑州市'
        },
        {
            'code': '410200',
            'val': '开封市'
        },
        {
            'code': '410300',
            'val': '洛阳市'
        },
        {
            'code': '410400',
            'val': '平顶山市'
        },
        {
            'code': '410500',
            'val': '安阳市'
        },
        {
            'code': '410600',
            'val': '鹤壁市'
        },
        {
            'code': '410700',
            'val': '新乡市'
        },
        {
            'code': '410800',
            'val': '焦作市'
        },
        {
            'code': '410900',
            'val': '濮阳市'
        },
        {
            'code': '411000',
            'val': '许昌市'
        },
        {
            'code': '411100',
            'val': '漯河市'
        },
        {
            'code': '411200',
            'val': '三门峡市'
        },
        {
            'code': '411300',
            'val': '南阳市'
        },
        {
            'code': '411400',
            'val': '商丘市'
        },
        {
            'code': '411500',
            'val': '信阳市'
        },
        {
            'code': '411600',
            'val': '周口市'
        },
        {
            'code': '411700',
            'val': '驻马店市'
        }
    ],
    '420000': [
        {
            'code': '420100',
            'val': '武汉市'
        },
        {
            'code': '420200',
            'val': '黄石市'
        },
        {
            'code': '420300',
            'val': '十堰市'
        },
        {
            'code': '420500',
            'val': '宜昌市'
        },
        {
            'code': '420600',
            'val': '襄樊市'
        },
        {
            'code': '420700',
            'val': '鄂州市'
        },
        {
            'code': '420800',
            'val': '荆门市'
        },
        {
            'code': '420900',
            'val': '孝感市'
        },
        {
            'code': '421000',
            'val': '荆州市'
        },
        {
            'code': '421100',
            'val': '黄冈市'
        },
        {
            'code': '421200',
            'val': '咸宁市'
        },
        {
            'code': '421300',
            'val': '随州市'
        },
        {
            'code': '422800',
            'val': '恩施土家族苗族自治州'
        },
        {
            'code': '429000',
            'val': '省直辖行政单位'
        }
    ],
    '430000': [
        {
            'code': '430100',
            'val': '长沙市'
        },
        {
            'code': '430200',
            'val': '株洲市'
        },
        {
            'code': '430300',
            'val': '湘潭市'
        },
        {
            'code': '430400',
            'val': '衡阳市'
        },
        {
            'code': '430500',
            'val': '邵阳市'
        },
        {
            'code': '430600',
            'val': '岳阳市'
        },
        {
            'code': '430700',
            'val': '常德市'
        },
        {
            'code': '430800',
            'val': '张家界市'
        },
        {
            'code': '430900',
            'val': '益阳市'
        },
        {
            'code': '431000',
            'val': '郴州市'
        },
        {
            'code': '431100',
            'val': '永州市'
        },
        {
            'code': '431200',
            'val': '怀化市'
        },
        {
            'code': '431300',
            'val': '娄底市'
        },
        {
            'code': '433100',
            'val': '湘西土家族苗族自治州'
        }
    ],
    '440000': [
        {
            'code': '440100',
            'val': '广州市'
        },
        {
            'code': '440200',
            'val': '韶关市'
        },
        {
            'code': '440300',
            'val': '深圳市'
        },
        {
            'code': '440400',
            'val': '珠海市'
        },
        {
            'code': '440500',
            'val': '汕头市'
        },
        {
            'code': '440600',
            'val': '佛山市'
        },
        {
            'code': '440700',
            'val': '江门市'
        },
        {
            'code': '440800',
            'val': '湛江市'
        },
        {
            'code': '440900',
            'val': '茂名市'
        },
        {
            'code': '441200',
            'val': '肇庆市'
        },
        {
            'code': '441300',
            'val': '惠州市'
        },
        {
            'code': '441400',
            'val': '梅州市'
        },
        {
            'code': '441500',
            'val': '汕尾市'
        },
        {
            'code': '441600',
            'val': '河源市'
        },
        {
            'code': '441700',
            'val': '阳江市'
        },
        {
            'code': '441800',
            'val': '清远市'
        },
        {
            'code': '441900',
            'val': '东莞市'
        },
        {
            'code': '442000',
            'val': '中山市'
        },
        {
            'code': '445100',
            'val': '潮州市'
        },
        {
            'code': '445200',
            'val': '揭阳市'
        },
        {
            'code': '445300',
            'val': '云浮市'
        }
    ],
    '450000': [
        {
            'code': '450100',
            'val': '南宁市'
        },
        {
            'code': '450200',
            'val': '柳州市'
        },
        {
            'code': '450300',
            'val': '桂林市'
        },
        {
            'code': '450400',
            'val': '梧州市'
        },
        {
            'code': '450500',
            'val': '北海市'
        },
        {
            'code': '450600',
            'val': '防城港市'
        },
        {
            'code': '450700',
            'val': '钦州市'
        },
        {
            'code': '450800',
            'val': '贵港市'
        },
        {
            'code': '450900',
            'val': '玉林市'
        },
        {
            'code': '451000',
            'val': '百色市'
        },
        {
            'code': '451100',
            'val': '贺州市'
        },
        {
            'code': '451200',
            'val': '河池市'
        },
        {
            'code': '451300',
            'val': '来宾市'
        },
        {
            'code': '451400',
            'val': '崇左市'
        }
    ],
    '460000': [
        {
            'code': '500100',
            'val': '市辖区'
        },
        {
            'code': '500200',
            'val': '县'
        },
        {
            'code': '500300',
            'val': '市'
        }
    ],
    '510000': [
        {
            'code': '510100',
            'val': '成都市'
        },
        {
            'code': '510300',
            'val': '自贡市'
        },
        {
            'code': '510400',
            'val': '攀枝花市'
        },
        {
            'code': '510500',
            'val': '泸州市'
        },
        {
            'code': '510600',
            'val': '德阳市'
        },
        {
            'code': '510700',
            'val': '绵阳市'
        },
        {
            'code': '510800',
            'val': '广元市'
        },
        {
            'code': '510900',
            'val': '遂宁市'
        },
        {
            'code': '511000',
            'val': '内江市'
        },
        {
            'code': '511100',
            'val': '乐山市'
        },
        {
            'code': '511300',
            'val': '南充市'
        },
        {
            'code': '511400',
            'val': '眉山市'
        },
        {
            'code': '511500',
            'val': '宜宾市'
        },
        {
            'code': '511600',
            'val': '广安市'
        },
        {
            'code': '511700',
            'val': '达州市'
        },
        {
            'code': '511800',
            'val': '雅安市'
        },
        {
            'code': '511900',
            'val': '巴中市'
        },
        {
            'code': '512000',
            'val': '资阳市'
        },
        {
            'code': '513200',
            'val': '阿坝藏族羌族自治州'
        },
        {
            'code': '513300',
            'val': '甘孜藏族自治州'
        },
        {
            'code': '513400',
            'val': '凉山彝族自治州'
        }
    ],
    '520000': [
        {
            'code': '520100',
            'val': '贵阳市'
        },
        {
            'code': '520200',
            'val': '六盘水市'
        },
        {
            'code': '520300',
            'val': '遵义市'
        },
        {
            'code': '520400',
            'val': '安顺市'
        },
        {
            'code': '522200',
            'val': '铜仁地区'
        },
        {
            'code': '522300',
            'val': '黔西南布依族苗族自治州'
        },
        {
            'code': '522400',
            'val': '毕节地区'
        },
        {
            'code': '522600',
            'val': '黔东南苗族侗族自治州'
        },
        {
            'code': '522700',
            'val': '黔南布依族苗族自治州'
        }
    ],
    '530000': [
        {
            'code': '530100',
            'val': '昆明市'
        },
        {
            'code': '530300',
            'val': '曲靖市'
        },
        {
            'code': '530400',
            'val': '玉溪市'
        },
        {
            'code': '530500',
            'val': '保山市'
        },
        {
            'code': '530600',
            'val': '昭通市'
        },
        {
            'code': '530700',
            'val': '丽江市'
        },
        {
            'code': '530800',
            'val': '思茅市'
        },
        {
            'code': '530900',
            'val': '临沧市'
        },
        {
            'code': '532300',
            'val': '楚雄彝族自治州'
        },
        {
            'code': '532500',
            'val': '红河哈尼族彝族自治州'
        },
        {
            'code': '532600',
            'val': '文山壮族苗族自治州'
        },
        {
            'code': '532800',
            'val': '西双版纳傣族自治州'
        },
        {
            'code': '532900',
            'val': '大理白族自治州'
        },
        {
            'code': '533100',
            'val': '德宏傣族景颇族自治州'
        },
        {
            'code': '533300',
            'val': '怒江傈僳族自治州'
        },
        {
            'code': '533400',
            'val': '迪庆藏族自治州'
        }
    ],
    '540000': [
        {
            'code': '540100',
            'val': '拉萨市'
        },
        {
            'code': '542100',
            'val': '昌都地区'
        },
        {
            'code': '542200',
            'val': '山南地区'
        },
        {
            'code': '542300',
            'val': '日喀则地区'
        },
        {
            'code': '542400',
            'val': '那曲地区'
        },
        {
            'code': '542500',
            'val': '阿里地区'
        },
        {
            'code': '542600',
            'val': '林芝地区'
        }
    ],
    '610000': [
        {
            'code': '610100',
            'val': '西安市'
        },
        {
            'code': '610200',
            'val': '铜川市'
        },
        {
            'code': '610300',
            'val': '宝鸡市'
        },
        {
            'code': '610400',
            'val': '咸阳市'
        },
        {
            'code': '610500',
            'val': '渭南市'
        },
        {
            'code': '610600',
            'val': '延安市'
        },
        {
            'code': '610700',
            'val': '汉中市'
        },
        {
            'code': '610800',
            'val': '榆林市'
        },
        {
            'code': '610900',
            'val': '安康市'
        },
        {
            'code': '611000',
            'val': '商洛市'
        }
    ],
    '620000': [
        {
            'code': '620100',
            'val': '兰州市'
        },
        {
            'code': '620200',
            'val': '嘉峪关市'
        },
        {
            'code': '620300',
            'val': '金昌市'
        },
        {
            'code': '620400',
            'val': '白银市'
        },
        {
            'code': '620500',
            'val': '天水市'
        },
        {
            'code': '620600',
            'val': '武威市'
        },
        {
            'code': '620700',
            'val': '张掖市'
        },
        {
            'code': '620800',
            'val': '平凉市'
        },
        {
            'code': '620900',
            'val': '酒泉市'
        },
        {
            'code': '621000',
            'val': '庆阳市'
        },
        {
            'code': '621100',
            'val': '定西市'
        },
        {
            'code': '621200',
            'val': '陇南市'
        },
        {
            'code': '622900',
            'val': '临夏回族自治州'
        },
        {
            'code': '623000',
            'val': '甘南藏族自治州'
        }
    ],
    '630000': [
        {
            'code': '630100',
            'val': '西宁市'
        },
        {
            'code': '632100',
            'val': '海东地区'
        },
        {
            'code': '632200',
            'val': '海北藏族自治州'
        },
        {
            'code': '632300',
            'val': '黄南藏族自治州'
        },
        {
            'code': '632500',
            'val': '海南藏族自治州'
        },
        {
            'code': '632600',
            'val': '果洛藏族自治州'
        },
        {
            'code': '632700',
            'val': '玉树藏族自治州'
        },
        {
            'code': '632800',
            'val': '海西蒙古族藏族自治州'
        }
    ],
    '640000': [
        {
            'code': '640100',
            'val': '银川市'
        },
        {
            'code': '640200',
            'val': '石嘴山市'
        },
        {
            'code': '640300',
            'val': '吴忠市'
        },
        {
            'code': '640400',
            'val': '固原市'
        },
        {
            'code': '640500',
            'val': '中卫市'
        }
    ],
    '650000': [
        {
            'code': '650100',
            'val': '乌鲁木齐市'
        },
        {
            'code': '650200',
            'val': '克拉玛依市'
        },
        {
            'code': '652100',
            'val': '吐鲁番地区'
        },
        {
            'code': '652200',
            'val': '哈密地区'
        },
        {
            'code': '652300',
            'val': '昌吉回族自治州'
        },
        {
            'code': '652700',
            'val': '博尔塔拉蒙古自治州'
        },
        {
            'code': '652800',
            'val': '巴音郭楞蒙古自治州'
        },
        {
            'code': '652900',
            'val': '阿克苏地区'
        },
        {
            'code': '653000',
            'val': '克孜勒苏柯尔克孜自治州'
        },
        {
            'code': '653100',
            'val': '喀什地区'
        },
        {
            'code': '653200',
            'val': '和田地区'
        },
        {
            'code': '654000',
            'val': '伊犁哈萨克自治州'
        },
        {
            'code': '654200',
            'val': '塔城地区'
        },
        {
            'code': '654300',
            'val': '阿勒泰地区'
        },
        {
            'code': '659000',
            'val': '省直辖行政单位'
        }
    ]
};

export const districts = {
    '110100': [
        {
            'code': '110101',
            'val': '东城区'
        },
        {
            'code': '110102',
            'val': '西城区'
        },
        {
            'code': '110103',
            'val': '崇文区'
        },
        {
            'code': '110104',
            'val': '宣武区'
        },
        {
            'code': '110105',
            'val': '朝阳区'
        },
        {
            'code': '110106',
            'val': '丰台区'
        },
        {
            'code': '110107',
            'val': '石景山区'
        },
        {
            'code': '110108',
            'val': '海淀区'
        },
        {
            'code': '110109',
            'val': '门头沟区'
        },
        {
            'code': '110111',
            'val': '房山区'
        },
        {
            'code': '110112',
            'val': '通州区'
        },
        {
            'code': '110113',
            'val': '顺义区'
        },
        {
            'code': '110114',
            'val': '昌平区'
        },
        {
            'code': '110115',
            'val': '大兴区'
        },
        {
            'code': '110116',
            'val': '怀柔区'
        },
        {
            'code': '110117',
            'val': '平谷区'
        }
    ],
    '110200': [
        {
            'code': '110228',
            'val': '密云县'
        },
        {
            'code': '110229',
            'val': '延庆县'
        }
    ],
    '120100': [
        {
            'code': '120101',
            'val': '和平区'
        },
        {
            'code': '120102',
            'val': '河东区'
        },
        {
            'code': '120103',
            'val': '河西区'
        },
        {
            'code': '120104',
            'val': '南开区'
        },
        {
            'code': '120105',
            'val': '河北区'
        },
        {
            'code': '120106',
            'val': '红桥区'
        },
        {
            'code': '120107',
            'val': '塘沽区'
        },
        {
            'code': '120108',
            'val': '汉沽区'
        },
        {
            'code': '120109',
            'val': '大港区'
        },
        {
            'code': '120110',
            'val': '东丽区'
        },
        {
            'code': '120111',
            'val': '西青区'
        },
        {
            'code': '120112',
            'val': '津南区'
        },
        {
            'code': '120113',
            'val': '北辰区'
        },
        {
            'code': '120114',
            'val': '武清区'
        },
        {
            'code': '120115',
            'val': '宝坻区'
        }
    ],
    '120200': [
        {
            'code': '120221',
            'val': '宁河县'
        },
        {
            'code': '120223',
            'val': '静海县'
        },
        {
            'code': '120225',
            'val': '蓟县'
        }
    ],
    '130100': [
        {
            'code': '130101',
            'val': '市辖区'
        },
        {
            'code': '130102',
            'val': '长安区'
        },
        {
            'code': '130103',
            'val': '桥东区'
        },
        {
            'code': '130104',
            'val': '桥西区'
        },
        {
            'code': '130105',
            'val': '新华区'
        },
        {
            'code': '130107',
            'val': '井陉矿区'
        },
        {
            'code': '130108',
            'val': '裕华区'
        },
        {
            'code': '130121',
            'val': '井陉县'
        },
        {
            'code': '130123',
            'val': '正定县'
        },
        {
            'code': '130124',
            'val': '栾城县'
        },
        {
            'code': '130125',
            'val': '行唐县'
        },
        {
            'code': '130126',
            'val': '灵寿县'
        },
        {
            'code': '130127',
            'val': '高邑县'
        },
        {
            'code': '130128',
            'val': '深泽县'
        },
        {
            'code': '130129',
            'val': '赞皇县'
        },
        {
            'code': '130130',
            'val': '无极县'
        },
        {
            'code': '130131',
            'val': '平山县'
        },
        {
            'code': '130132',
            'val': '元氏县'
        },
        {
            'code': '130133',
            'val': '赵县'
        },
        {
            'code': '130181',
            'val': '辛集市'
        },
        {
            'code': '130182',
            'val': '藁城市'
        },
        {
            'code': '130183',
            'val': '晋州市'
        },
        {
            'code': '130184',
            'val': '新乐市'
        },
        {
            'code': '130185',
            'val': '鹿泉市'
        }
    ],
    '130200': [
        {
            'code': '130201',
            'val': '市辖区'
        },
        {
            'code': '130202',
            'val': '路南区'
        },
        {
            'code': '130203',
            'val': '路北区'
        },
        {
            'code': '130204',
            'val': '古冶区'
        },
        {
            'code': '130205',
            'val': '开平区'
        },
        {
            'code': '130207',
            'val': '丰南区'
        },
        {
            'code': '130208',
            'val': '丰润区'
        },
        {
            'code': '130223',
            'val': '滦县'
        },
        {
            'code': '130224',
            'val': '滦南县'
        },
        {
            'code': '130225',
            'val': '乐亭县'
        },
        {
            'code': '130227',
            'val': '迁西县'
        },
        {
            'code': '130229',
            'val': '玉田县'
        },
        {
            'code': '130230',
            'val': '唐海县'
        },
        {
            'code': '130281',
            'val': '遵化市'
        },
        {
            'code': '130283',
            'val': '迁安市'
        }
    ],
    '130300': [
        {
            'code': '130301',
            'val': '市辖区'
        },
        {
            'code': '130302',
            'val': '海港区'
        },
        {
            'code': '130303',
            'val': '山海关区'
        },
        {
            'code': '130304',
            'val': '北戴河区'
        },
        {
            'code': '130321',
            'val': '青龙满族自治县'
        },
        {
            'code': '130322',
            'val': '昌黎县'
        },
        {
            'code': '130323',
            'val': '抚宁县'
        },
        {
            'code': '130324',
            'val': '卢龙县'
        }
    ],
    '130400': [
        {
            'code': '130401',
            'val': '市辖区'
        },
        {
            'code': '130402',
            'val': '邯山区'
        },
        {
            'code': '130403',
            'val': '丛台区'
        },
        {
            'code': '130404',
            'val': '复兴区'
        },
        {
            'code': '130406',
            'val': '峰峰矿区'
        },
        {
            'code': '130421',
            'val': '邯郸县'
        },
        {
            'code': '130423',
            'val': '临漳县'
        },
        {
            'code': '130424',
            'val': '成安县'
        },
        {
            'code': '130425',
            'val': '大名县'
        },
        {
            'code': '130426',
            'val': '涉县'
        },
        {
            'code': '130427',
            'val': '磁县'
        },
        {
            'code': '130428',
            'val': '肥乡县'
        },
        {
            'code': '130429',
            'val': '永年县'
        },
        {
            'code': '130430',
            'val': '邱县'
        },
        {
            'code': '130431',
            'val': '鸡泽县'
        },
        {
            'code': '130432',
            'val': '广平县'
        },
        {
            'code': '130433',
            'val': '馆陶县'
        },
        {
            'code': '130434',
            'val': '魏县'
        },
        {
            'code': '130435',
            'val': '曲周县'
        },
        {
            'code': '130481',
            'val': '武安市'
        }
    ],
    '130500': [
        {
            'code': '130501',
            'val': '市辖区'
        },
        {
            'code': '130502',
            'val': '桥东区'
        },
        {
            'code': '130503',
            'val': '桥西区'
        },
        {
            'code': '130521',
            'val': '邢台县'
        },
        {
            'code': '130522',
            'val': '临城县'
        },
        {
            'code': '130523',
            'val': '内丘县'
        },
        {
            'code': '130524',
            'val': '柏乡县'
        },
        {
            'code': '130525',
            'val': '隆尧县'
        },
        {
            'code': '130526',
            'val': '任县'
        },
        {
            'code': '130527',
            'val': '南和县'
        },
        {
            'code': '130528',
            'val': '宁晋县'
        },
        {
            'code': '130529',
            'val': '巨鹿县'
        },
        {
            'code': '130530',
            'val': '新河县'
        },
        {
            'code': '130531',
            'val': '广宗县'
        },
        {
            'code': '130532',
            'val': '平乡县'
        },
        {
            'code': '130533',
            'val': '威县'
        },
        {
            'code': '130534',
            'val': '清河县'
        },
        {
            'code': '130535',
            'val': '临西县'
        },
        {
            'code': '130581',
            'val': '南宫市'
        },
        {
            'code': '130582',
            'val': '沙河市'
        }
    ],
    '130600': [
        {
            'code': '130601',
            'val': '市辖区'
        },
        {
            'code': '130602',
            'val': '新市区'
        },
        {
            'code': '130603',
            'val': '北市区'
        },
        {
            'code': '130604',
            'val': '南市区'
        },
        {
            'code': '130621',
            'val': '满城县'
        },
        {
            'code': '130622',
            'val': '清苑县'
        },
        {
            'code': '130623',
            'val': '涞水县'
        },
        {
            'code': '130624',
            'val': '阜平县'
        },
        {
            'code': '130625',
            'val': '徐水县'
        },
        {
            'code': '130626',
            'val': '定兴县'
        },
        {
            'code': '130627',
            'val': '唐县'
        },
        {
            'code': '130628',
            'val': '高阳县'
        },
        {
            'code': '130629',
            'val': '容城县'
        },
        {
            'code': '130630',
            'val': '涞源县'
        },
        {
            'code': '130631',
            'val': '望都县'
        },
        {
            'code': '130632',
            'val': '安新县'
        },
        {
            'code': '130633',
            'val': '易县'
        },
        {
            'code': '130634',
            'val': '曲阳县'
        },
        {
            'code': '130635',
            'val': '蠡县'
        },
        {
            'code': '130636',
            'val': '顺平县'
        },
        {
            'code': '130637',
            'val': '博野县'
        },
        {
            'code': '130638',
            'val': '雄县'
        },
        {
            'code': '130681',
            'val': '涿州市'
        },
        {
            'code': '130682',
            'val': '定州市'
        },
        {
            'code': '130683',
            'val': '安国市'
        },
        {
            'code': '130684',
            'val': '高碑店市'
        }
    ],
    '130700': [
        {
            'code': '130701',
            'val': '市辖区'
        },
        {
            'code': '130702',
            'val': '桃城区'
        },
        {
            'code': '130721',
            'val': '枣强县'
        },
        {
            'code': '130722',
            'val': '武邑县'
        },
        {
            'code': '130723',
            'val': '武强县'
        },
        {
            'code': '130724',
            'val': '饶阳县'
        },
        {
            'code': '130725',
            'val': '安平县'
        },
        {
            'code': '130726',
            'val': '故城县'
        },
        {
            'code': '130727',
            'val': '景县'
        },
        {
            'code': '130728',
            'val': '阜城县'
        },
        {
            'code': '130781',
            'val': '冀州市'
        },
        {
            'code': '130782',
            'val': '深州市'
        }
    ],
    '130800': [
        {
            'code': '130801',
            'val': '市辖区'
        },
        {
            'code': '130802',
            'val': '双桥区'
        },
        {
            'code': '130803',
            'val': '双滦区'
        },
        {
            'code': '130804',
            'val': '鹰手营子矿区'
        },
        {
            'code': '130821',
            'val': '承德县'
        },
        {
            'code': '130822',
            'val': '兴隆县'
        },
        {
            'code': '130823',
            'val': '平泉县'
        },
        {
            'code': '130824',
            'val': '滦平县'
        },
        {
            'code': '130825',
            'val': '隆化县'
        },
        {
            'code': '130826',
            'val': '丰宁满族自治县'
        },
        {
            'code': '130827',
            'val': '宽城满族自治县'
        },
        {
            'code': '130828',
            'val': '围场满族蒙古族自治县'
        }
    ],
    '130900': [
        {
            'code': '130901',
            'val': '市辖区'
        },
        {
            'code': '130902',
            'val': '新华区'
        },
        {
            'code': '130903',
            'val': '运河区'
        },
        {
            'code': '130921',
            'val': '沧县'
        },
        {
            'code': '130922',
            'val': '青县'
        },
        {
            'code': '130923',
            'val': '东光县'
        },
        {
            'code': '130924',
            'val': '海兴县'
        },
        {
            'code': '130925',
            'val': '盐山县'
        },
        {
            'code': '130926',
            'val': '肃宁县'
        },
        {
            'code': '130927',
            'val': '南皮县'
        },
        {
            'code': '130928',
            'val': '吴桥县'
        },
        {
            'code': '130929',
            'val': '献县'
        },
        {
            'code': '130930',
            'val': '孟村回族自治县'
        },
        {
            'code': '130981',
            'val': '泊头市'
        },
        {
            'code': '130982',
            'val': '任丘市'
        },
        {
            'code': '130983',
            'val': '黄骅市'
        },
        {
            'code': '130984',
            'val': '河间市'
        }
    ],
    '131000': [
        {
            'code': '131001',
            'val': '市辖区'
        },
        {
            'code': '131002',
            'val': '安次区'
        },
        {
            'code': '131003',
            'val': '广阳区'
        },
        {
            'code': '131022',
            'val': '固安县'
        },
        {
            'code': '131023',
            'val': '永清县'
        },
        {
            'code': '131024',
            'val': '香河县'
        },
        {
            'code': '131025',
            'val': '大城县'
        },
        {
            'code': '131026',
            'val': '文安县'
        },
        {
            'code': '131028',
            'val': '大厂回族自治县'
        },
        {
            'code': '131081',
            'val': '霸州市'
        },
        {
            'code': '131082',
            'val': '三河市'
        }
    ],
    '131100': [
        {
            'code': '131101',
            'val': '市辖区'
        },
        {
            'code': '131102',
            'val': '桥东区'
        },
        {
            'code': '131103',
            'val': '桥西区'
        },
        {
            'code': '131105',
            'val': '宣化区'
        },
        {
            'code': '131106',
            'val': '下花园区'
        },
        {
            'code': '131121',
            'val': '宣化县'
        },
        {
            'code': '131122',
            'val': '张北县'
        },
        {
            'code': '131123',
            'val': '康保县'
        },
        {
            'code': '131124',
            'val': '沽源县'
        },
        {
            'code': '131125',
            'val': '尚义县'
        },
        {
            'code': '131126',
            'val': '蔚县'
        },
        {
            'code': '131127',
            'val': '阳原县'
        },
        {
            'code': '131128',
            'val': '怀安县'
        },
        {
            'code': '131129',
            'val': '万全县'
        },
        {
            'code': '131130',
            'val': '怀来县'
        },
        {
            'code': '131131',
            'val': '涿鹿县'
        },
        {
            'code': '131132',
            'val': '赤城县'
        },
        {
            'code': '131133',
            'val': '崇礼县'
        }
    ],
    '140100': [
        {
            'code': '140101',
            'val': '市辖区'
        },
        {
            'code': '140105',
            'val': '小店区'
        },
        {
            'code': '140106',
            'val': '迎泽区'
        },
        {
            'code': '140107',
            'val': '杏花岭区'
        },
        {
            'code': '140108',
            'val': '尖草坪区'
        },
        {
            'code': '140109',
            'val': '万柏林区'
        },
        {
            'code': '140110',
            'val': '晋源区'
        },
        {
            'code': '140121',
            'val': '清徐县'
        },
        {
            'code': '140122',
            'val': '阳曲县'
        },
        {
            'code': '140123',
            'val': '娄烦县'
        },
        {
            'code': '140181',
            'val': '古交市'
        }
    ],
    '140200': [
        {
            'code': '140201',
            'val': '市辖区'
        },
        {
            'code': '140202',
            'val': '城区'
        },
        {
            'code': '140203',
            'val': '矿区'
        },
        {
            'code': '140211',
            'val': '南郊区'
        },
        {
            'code': '140212',
            'val': '新荣区'
        },
        {
            'code': '140221',
            'val': '阳高县'
        },
        {
            'code': '140222',
            'val': '天镇县'
        },
        {
            'code': '140223',
            'val': '广灵县'
        },
        {
            'code': '140224',
            'val': '灵丘县'
        },
        {
            'code': '140225',
            'val': '浑源县'
        },
        {
            'code': '140226',
            'val': '左云县'
        },
        {
            'code': '140227',
            'val': '大同县'
        }
    ],
    '140300': [
        {
            'code': '140301',
            'val': '市辖区'
        },
        {
            'code': '140302',
            'val': '城区'
        },
        {
            'code': '140303',
            'val': '矿区'
        },
        {
            'code': '140311',
            'val': '郊区'
        },
        {
            'code': '140321',
            'val': '平定县'
        },
        {
            'code': '140322',
            'val': '盂县'
        }
    ],
    '140400': [
        {
            'code': '140401',
            'val': '市辖区'
        },
        {
            'code': '140402',
            'val': '城区'
        },
        {
            'code': '140411',
            'val': '郊区'
        },
        {
            'code': '140421',
            'val': '长治县'
        },
        {
            'code': '140423',
            'val': '襄垣县'
        },
        {
            'code': '140424',
            'val': '屯留县'
        },
        {
            'code': '140425',
            'val': '平顺县'
        },
        {
            'code': '140426',
            'val': '黎城县'
        },
        {
            'code': '140427',
            'val': '壶关县'
        },
        {
            'code': '140428',
            'val': '长子县'
        },
        {
            'code': '140429',
            'val': '武乡县'
        },
        {
            'code': '140430',
            'val': '沁县'
        },
        {
            'code': '140431',
            'val': '沁源县'
        },
        {
            'code': '140481',
            'val': '潞城市'
        }
    ],
    '140500': [
        {
            'code': '140501',
            'val': '市辖区'
        },
        {
            'code': '140502',
            'val': '城区'
        },
        {
            'code': '140521',
            'val': '沁水县'
        },
        {
            'code': '140522',
            'val': '阳城县'
        },
        {
            'code': '140524',
            'val': '陵川县'
        },
        {
            'code': '140525',
            'val': '泽州县'
        },
        {
            'code': '140581',
            'val': '高平市'
        }
    ],
    '140600': [
        {
            'code': '140601',
            'val': '市辖区'
        },
        {
            'code': '140602',
            'val': '朔城区'
        },
        {
            'code': '140603',
            'val': '平鲁区'
        },
        {
            'code': '140621',
            'val': '山阴县'
        },
        {
            'code': '140622',
            'val': '应县'
        },
        {
            'code': '140623',
            'val': '右玉县'
        },
        {
            'code': '140624',
            'val': '怀仁县'
        }
    ],
    '140700': [
        {
            'code': '140701',
            'val': '市辖区'
        },
        {
            'code': '140702',
            'val': '榆次区'
        },
        {
            'code': '140721',
            'val': '榆社县'
        },
        {
            'code': '140722',
            'val': '左权县'
        },
        {
            'code': '140723',
            'val': '和顺县'
        },
        {
            'code': '140724',
            'val': '昔阳县'
        },
        {
            'code': '140725',
            'val': '寿阳县'
        },
        {
            'code': '140726',
            'val': '太谷县'
        },
        {
            'code': '140727',
            'val': '祁县'
        },
        {
            'code': '140728',
            'val': '平遥县'
        },
        {
            'code': '140729',
            'val': '灵石县'
        },
        {
            'code': '140781',
            'val': '介休市'
        }
    ],
    '140800': [
        {
            'code': '140801',
            'val': '市辖区'
        },
        {
            'code': '140802',
            'val': '盐湖区'
        },
        {
            'code': '140821',
            'val': '临猗县'
        },
        {
            'code': '140822',
            'val': '万荣县'
        },
        {
            'code': '140823',
            'val': '闻喜县'
        },
        {
            'code': '140824',
            'val': '稷山县'
        },
        {
            'code': '140825',
            'val': '新绛县'
        },
        {
            'code': '140826',
            'val': '绛县'
        },
        {
            'code': '140827',
            'val': '垣曲县'
        },
        {
            'code': '140828',
            'val': '夏县'
        },
        {
            'code': '140829',
            'val': '平陆县'
        },
        {
            'code': '140830',
            'val': '芮城县'
        },
        {
            'code': '140881',
            'val': '永济市'
        },
        {
            'code': '140882',
            'val': '河津市'
        }
    ],
    '140900': [
        {
            'code': '140901',
            'val': '市辖区'
        },
        {
            'code': '140902',
            'val': '忻府区'
        },
        {
            'code': '140921',
            'val': '定襄县'
        },
        {
            'code': '140922',
            'val': '五台县'
        },
        {
            'code': '140923',
            'val': '代县'
        },
        {
            'code': '140924',
            'val': '繁峙县'
        },
        {
            'code': '140925',
            'val': '宁武县'
        },
        {
            'code': '140926',
            'val': '静乐县'
        },
        {
            'code': '140927',
            'val': '神池县'
        },
        {
            'code': '140928',
            'val': '五寨县'
        },
        {
            'code': '140929',
            'val': '岢岚县'
        },
        {
            'code': '140930',
            'val': '河曲县'
        },
        {
            'code': '140931',
            'val': '保德县'
        },
        {
            'code': '140932',
            'val': '偏关县'
        },
        {
            'code': '140981',
            'val': '原平市'
        }
    ],
    '141000': [
        {
            'code': '141001',
            'val': '市辖区'
        },
        {
            'code': '141002',
            'val': '尧都区'
        },
        {
            'code': '141021',
            'val': '曲沃县'
        },
        {
            'code': '141022',
            'val': '翼城县'
        },
        {
            'code': '141023',
            'val': '襄汾县'
        },
        {
            'code': '141024',
            'val': '洪洞县'
        },
        {
            'code': '141025',
            'val': '古县'
        },
        {
            'code': '141026',
            'val': '安泽县'
        },
        {
            'code': '141027',
            'val': '浮山县'
        },
        {
            'code': '141028',
            'val': '吉县'
        },
        {
            'code': '141029',
            'val': '乡宁县'
        },
        {
            'code': '141030',
            'val': '大宁县'
        },
        {
            'code': '141031',
            'val': '隰县'
        },
        {
            'code': '141032',
            'val': '永和县'
        },
        {
            'code': '141033',
            'val': '蒲县'
        },
        {
            'code': '141034',
            'val': '汾西县'
        },
        {
            'code': '141081',
            'val': '侯马市'
        },
        {
            'code': '141082',
            'val': '霍州市'
        }
    ],
    '141100': [
        {
            'code': '141101',
            'val': '市辖区'
        },
        {
            'code': '141102',
            'val': '离石区'
        },
        {
            'code': '141121',
            'val': '文水县'
        },
        {
            'code': '141122',
            'val': '交城县'
        },
        {
            'code': '141123',
            'val': '兴县'
        },
        {
            'code': '141124',
            'val': '临县'
        },
        {
            'code': '141125',
            'val': '柳林县'
        },
        {
            'code': '141126',
            'val': '石楼县'
        },
        {
            'code': '141127',
            'val': '岚县'
        },
        {
            'code': '141128',
            'val': '方山县'
        },
        {
            'code': '141129',
            'val': '中阳县'
        },
        {
            'code': '141130',
            'val': '交口县'
        },
        {
            'code': '141181',
            'val': '孝义市'
        },
        {
            'code': '141182',
            'val': '汾阳市'
        }
    ],
    '150100': [
        {
            'code': '150101',
            'val': '市辖区'
        },
        {
            'code': '150102',
            'val': '新城区'
        },
        {
            'code': '150103',
            'val': '回民区'
        },
        {
            'code': '150104',
            'val': '玉泉区'
        },
        {
            'code': '150105',
            'val': '赛罕区'
        },
        {
            'code': '150121',
            'val': '土默特左旗'
        },
        {
            'code': '150122',
            'val': '托克托县'
        },
        {
            'code': '150123',
            'val': '和林格尔县'
        },
        {
            'code': '150124',
            'val': '清水河县'
        },
        {
            'code': '150125',
            'val': '武川县'
        }
    ],
    '150200': [
        {
            'code': '150201',
            'val': '市辖区'
        },
        {
            'code': '150202',
            'val': '东河区'
        },
        {
            'code': '150203',
            'val': '昆都仑区'
        },
        {
            'code': '150204',
            'val': '青山区'
        },
        {
            'code': '150205',
            'val': '石拐区'
        },
        {
            'code': '150206',
            'val': '白云矿区'
        },
        {
            'code': '150207',
            'val': '九原区'
        },
        {
            'code': '150221',
            'val': '土默特右旗'
        },
        {
            'code': '150222',
            'val': '固阳县'
        },
        {
            'code': '150223',
            'val': '达尔罕茂明安联合旗'
        }
    ],
    '150300': [
        {
            'code': '150301',
            'val': '市辖区'
        },
        {
            'code': '150302',
            'val': '海勃湾区'
        },
        {
            'code': '150303',
            'val': '海南区'
        },
        {
            'code': '150304',
            'val': '乌达区'
        }
    ],
    '150400': [
        {
            'code': '150401',
            'val': '市辖区'
        },
        {
            'code': '150402',
            'val': '红山区'
        },
        {
            'code': '150403',
            'val': '元宝山区'
        },
        {
            'code': '150404',
            'val': '松山区'
        },
        {
            'code': '150421',
            'val': '阿鲁科尔沁旗'
        },
        {
            'code': '150422',
            'val': '巴林左旗'
        },
        {
            'code': '150423',
            'val': '巴林右旗'
        },
        {
            'code': '150424',
            'val': '林西县'
        },
        {
            'code': '150425',
            'val': '克什克腾旗'
        },
        {
            'code': '150426',
            'val': '翁牛特旗'
        },
        {
            'code': '150428',
            'val': '喀喇沁旗'
        },
        {
            'code': '150429',
            'val': '宁城县'
        },
        {
            'code': '150430',
            'val': '敖汉旗'
        }
    ],
    '150500': [
        {
            'code': '150501',
            'val': '市辖区'
        },
        {
            'code': '150502',
            'val': '科尔沁区'
        },
        {
            'code': '150521',
            'val': '科尔沁左翼中旗'
        },
        {
            'code': '150522',
            'val': '科尔沁左翼后旗'
        },
        {
            'code': '150523',
            'val': '开鲁县'
        },
        {
            'code': '150524',
            'val': '库伦旗'
        },
        {
            'code': '150525',
            'val': '奈曼旗'
        },
        {
            'code': '150526',
            'val': '扎鲁特旗'
        },
        {
            'code': '150581',
            'val': '霍林郭勒市'
        }
    ],
    '150600': [
        {
            'code': '150602',
            'val': '东胜区'
        },
        {
            'code': '150621',
            'val': '达拉特旗'
        },
        {
            'code': '150622',
            'val': '准格尔旗'
        },
        {
            'code': '150623',
            'val': '鄂托克前旗'
        },
        {
            'code': '150624',
            'val': '鄂托克旗'
        },
        {
            'code': '150625',
            'val': '杭锦旗'
        },
        {
            'code': '150626',
            'val': '乌审旗'
        },
        {
            'code': '150627',
            'val': '伊金霍洛旗'
        }
    ],
    '150700': [
        {
            'code': '150701',
            'val': '市辖区'
        },
        {
            'code': '150702',
            'val': '海拉尔区'
        },
        {
            'code': '150721',
            'val': '阿荣旗'
        },
        {
            'code': '150722',
            'val': '莫力达瓦达斡尔族自治旗'
        },
        {
            'code': '150723',
            'val': '鄂伦春自治旗'
        },
        {
            'code': '150724',
            'val': '鄂温克族自治旗'
        },
        {
            'code': '150725',
            'val': '陈巴尔虎旗'
        },
        {
            'code': '150726',
            'val': '新巴尔虎左旗'
        },
        {
            'code': '150727',
            'val': '新巴尔虎右旗'
        },
        {
            'code': '150781',
            'val': '满洲里市'
        },
        {
            'code': '150782',
            'val': '牙克石市'
        },
        {
            'code': '150783',
            'val': '扎兰屯市'
        },
        {
            'code': '150784',
            'val': '额尔古纳市'
        },
        {
            'code': '150785',
            'val': '根河市'
        }
    ],
    '150800': [
        {
            'code': '150801',
            'val': '市辖区'
        },
        {
            'code': '150802',
            'val': '临河区'
        },
        {
            'code': '150821',
            'val': '五原县'
        },
        {
            'code': '150822',
            'val': '磴口县'
        },
        {
            'code': '150823',
            'val': '乌拉特前旗'
        },
        {
            'code': '150824',
            'val': '乌拉特中旗'
        },
        {
            'code': '150825',
            'val': '乌拉特后旗'
        },
        {
            'code': '150826',
            'val': '杭锦后旗'
        }
    ],
    '150900': [
        {
            'code': '150901',
            'val': '市辖区'
        },
        {
            'code': '150902',
            'val': '集宁区'
        },
        {
            'code': '150921',
            'val': '卓资县'
        },
        {
            'code': '150922',
            'val': '化德县'
        },
        {
            'code': '150923',
            'val': '商都县'
        },
        {
            'code': '150924',
            'val': '兴和县'
        },
        {
            'code': '150925',
            'val': '凉城县'
        },
        {
            'code': '150926',
            'val': '察哈尔右翼前旗'
        },
        {
            'code': '150927',
            'val': '察哈尔右翼中旗'
        },
        {
            'code': '150928',
            'val': '察哈尔右翼后旗'
        },
        {
            'code': '150929',
            'val': '四子王旗'
        },
        {
            'code': '150981',
            'val': '丰镇市'
        }
    ],
    '152200': [
        {
            'code': '152201',
            'val': '乌兰浩特市'
        },
        {
            'code': '152202',
            'val': '阿尔山市'
        },
        {
            'code': '152221',
            'val': '科尔沁右翼前旗'
        },
        {
            'code': '152222',
            'val': '科尔沁右翼中旗'
        },
        {
            'code': '152223',
            'val': '扎赉特旗'
        },
        {
            'code': '152224',
            'val': '突泉县'
        }
    ],
    '152500': [
        {
            'code': '152501',
            'val': '二连浩特市'
        },
        {
            'code': '152502',
            'val': '锡林浩特市'
        },
        {
            'code': '152522',
            'val': '阿巴嘎旗'
        },
        {
            'code': '152523',
            'val': '苏尼特左旗'
        },
        {
            'code': '152524',
            'val': '苏尼特右旗'
        },
        {
            'code': '152525',
            'val': '东乌珠穆沁旗'
        },
        {
            'code': '152526',
            'val': '西乌珠穆沁旗'
        },
        {
            'code': '152527',
            'val': '太仆寺旗'
        },
        {
            'code': '152528',
            'val': '镶黄旗'
        },
        {
            'code': '152529',
            'val': '正镶白旗'
        },
        {
            'code': '152530',
            'val': '正蓝旗'
        },
        {
            'code': '152531',
            'val': '多伦县'
        }
    ],
    '152900': [
        {
            'code': '152921',
            'val': '阿拉善左旗'
        },
        {
            'code': '152922',
            'val': '阿拉善右旗'
        },
        {
            'code': '152923',
            'val': '额济纳旗'
        }
    ],
    '210100': [
        {
            'code': '210101',
            'val': '市辖区'
        },
        {
            'code': '210102',
            'val': '和平区'
        },
        {
            'code': '210103',
            'val': '沈河区'
        },
        {
            'code': '210104',
            'val': '大东区'
        },
        {
            'code': '210105',
            'val': '皇姑区'
        },
        {
            'code': '210106',
            'val': '铁西区'
        },
        {
            'code': '210111',
            'val': '苏家屯区'
        },
        {
            'code': '210112',
            'val': '东陵区'
        },
        {
            'code': '210113',
            'val': '新城子区'
        },
        {
            'code': '210114',
            'val': '于洪区'
        },
        {
            'code': '210122',
            'val': '辽中县'
        },
        {
            'code': '210123',
            'val': '康平县'
        },
        {
            'code': '210124',
            'val': '法库县'
        },
        {
            'code': '210181',
            'val': '新民市'
        }
    ],
    '210200': [
        {
            'code': '210201',
            'val': '市辖区'
        },
        {
            'code': '210202',
            'val': '中山区'
        },
        {
            'code': '210203',
            'val': '西岗区'
        },
        {
            'code': '210204',
            'val': '沙河口区'
        },
        {
            'code': '210211',
            'val': '甘井子区'
        },
        {
            'code': '210212',
            'val': '旅顺口区'
        },
        {
            'code': '210213',
            'val': '金州区'
        },
        {
            'code': '210224',
            'val': '长海县'
        },
        {
            'code': '210281',
            'val': '瓦房店市'
        },
        {
            'code': '210282',
            'val': '普兰店市'
        },
        {
            'code': '210283',
            'val': '庄河市'
        },
        {
            'code': '210284',
            'val': '开发区'
        }
    ],
    '210300': [
        {
            'code': '210301',
            'val': '市辖区'
        },
        {
            'code': '210302',
            'val': '铁东区'
        },
        {
            'code': '210303',
            'val': '铁西区'
        },
        {
            'code': '210304',
            'val': '立山区'
        },
        {
            'code': '210311',
            'val': '千山区'
        },
        {
            'code': '210321',
            'val': '台安县'
        },
        {
            'code': '210323',
            'val': '岫岩满族自治县'
        },
        {
            'code': '210381',
            'val': '海城市'
        }
    ],
    '210400': [
        {
            'code': '210401',
            'val': '市辖区'
        },
        {
            'code': '210402',
            'val': '新抚区'
        },
        {
            'code': '210403',
            'val': '东洲区'
        },
        {
            'code': '210404',
            'val': '望花区'
        },
        {
            'code': '210411',
            'val': '顺城区'
        },
        {
            'code': '210421',
            'val': '抚顺县'
        },
        {
            'code': '210422',
            'val': '新宾满族自治县'
        },
        {
            'code': '210423',
            'val': '清原满族自治县'
        }
    ],
    '210500': [
        {
            'code': '210501',
            'val': '市辖区'
        },
        {
            'code': '210502',
            'val': '平山区'
        },
        {
            'code': '210503',
            'val': '溪湖区'
        },
        {
            'code': '210504',
            'val': '明山区'
        },
        {
            'code': '210505',
            'val': '南芬区'
        },
        {
            'code': '210521',
            'val': '本溪满族自治县'
        },
        {
            'code': '210522',
            'val': '桓仁满族自治县'
        }
    ],
    '210600': [
        {
            'code': '210601',
            'val': '市辖区'
        },
        {
            'code': '210602',
            'val': '元宝区'
        },
        {
            'code': '210603',
            'val': '振兴区'
        },
        {
            'code': '210604',
            'val': '振安区'
        },
        {
            'code': '210624',
            'val': '宽甸满族自治县'
        },
        {
            'code': '210681',
            'val': '东港市'
        },
        {
            'code': '210682',
            'val': '凤城市'
        }
    ],
    '210700': [
        {
            'code': '210701',
            'val': '市辖区'
        },
        {
            'code': '210702',
            'val': '古塔区'
        },
        {
            'code': '210703',
            'val': '凌河区'
        },
        {
            'code': '210711',
            'val': '太和区'
        },
        {
            'code': '210726',
            'val': '黑山县'
        },
        {
            'code': '210727',
            'val': '义县'
        },
        {
            'code': '210781',
            'val': '凌海市'
        },
        {
            'code': '210782',
            'val': '北宁市'
        }
    ],
    '210800': [
        {
            'code': '210801',
            'val': '市辖区'
        },
        {
            'code': '210802',
            'val': '站前区'
        },
        {
            'code': '210803',
            'val': '西市区'
        },
        {
            'code': '210804',
            'val': '鲅鱼圈区'
        },
        {
            'code': '210811',
            'val': '老边区'
        },
        {
            'code': '210881',
            'val': '盖州市'
        },
        {
            'code': '210882',
            'val': '大石桥市'
        }
    ],
    '210900': [
        {
            'code': '210901',
            'val': '市辖区'
        },
        {
            'code': '210902',
            'val': '海州区'
        },
        {
            'code': '210903',
            'val': '新邱区'
        },
        {
            'code': '210904',
            'val': '太平区'
        },
        {
            'code': '210905',
            'val': '清河门区'
        },
        {
            'code': '210911',
            'val': '细河区'
        },
        {
            'code': '210921',
            'val': '阜新蒙古族自治县'
        },
        {
            'code': '210922',
            'val': '彰武县'
        }
    ],
    '211000': [
        {
            'code': '211001',
            'val': '市辖区'
        },
        {
            'code': '211002',
            'val': '白塔区'
        },
        {
            'code': '211003',
            'val': '文圣区'
        },
        {
            'code': '211004',
            'val': '宏伟区'
        },
        {
            'code': '211005',
            'val': '弓长岭区'
        },
        {
            'code': '211011',
            'val': '太子河区'
        },
        {
            'code': '211021',
            'val': '辽阳县'
        },
        {
            'code': '211081',
            'val': '灯塔市'
        }
    ],
    '211100': [
        {
            'code': '211101',
            'val': '市辖区'
        },
        {
            'code': '211102',
            'val': '双台子区'
        },
        {
            'code': '211103',
            'val': '兴隆台区'
        },
        {
            'code': '211121',
            'val': '大洼县'
        },
        {
            'code': '211122',
            'val': '盘山县'
        }
    ],
    '211200': [
        {
            'code': '211201',
            'val': '市辖区'
        },
        {
            'code': '211202',
            'val': '银州区'
        },
        {
            'code': '211204',
            'val': '清河区'
        },
        {
            'code': '211221',
            'val': '铁岭县'
        },
        {
            'code': '211223',
            'val': '西丰县'
        },
        {
            'code': '211224',
            'val': '昌图县'
        },
        {
            'code': '211281',
            'val': '调兵山市'
        },
        {
            'code': '211282',
            'val': '开原市'
        }
    ],
    '211300': [
        {
            'code': '211301',
            'val': '市辖区'
        },
        {
            'code': '211302',
            'val': '双塔区'
        },
        {
            'code': '211303',
            'val': '龙城区'
        },
        {
            'code': '211321',
            'val': '朝阳县'
        },
        {
            'code': '211322',
            'val': '建平县'
        },
        {
            'code': '211324',
            'val': '喀喇沁左翼蒙古族自治县'
        },
        {
            'code': '211381',
            'val': '北票市'
        },
        {
            'code': '211382',
            'val': '凌源市'
        }
    ],
    '211400': [
        {
            'code': '211401',
            'val': '市辖区'
        },
        {
            'code': '211402',
            'val': '连山区'
        },
        {
            'code': '211403',
            'val': '龙港区'
        },
        {
            'code': '211404',
            'val': '南票区'
        },
        {
            'code': '211421',
            'val': '绥中县'
        },
        {
            'code': '211422',
            'val': '建昌县'
        },
        {
            'code': '211481',
            'val': '兴城市'
        }
    ],
    '220100': [
        {
            'code': '220101',
            'val': '市辖区'
        },
        {
            'code': '220102',
            'val': '南关区'
        },
        {
            'code': '220103',
            'val': '宽城区'
        },
        {
            'code': '220104',
            'val': '朝阳区'
        },
        {
            'code': '220105',
            'val': '二道区'
        },
        {
            'code': '220106',
            'val': '绿园区'
        },
        {
            'code': '220112',
            'val': '双阳区'
        },
        {
            'code': '220122',
            'val': '农安县'
        },
        {
            'code': '220181',
            'val': '九台市'
        },
        {
            'code': '220182',
            'val': '榆树市'
        },
        {
            'code': '220183',
            'val': '德惠市'
        }
    ],
    '220200': [
        {
            'code': '220201',
            'val': '市辖区'
        },
        {
            'code': '220202',
            'val': '昌邑区'
        },
        {
            'code': '220203',
            'val': '龙潭区'
        },
        {
            'code': '220204',
            'val': '船营区'
        },
        {
            'code': '220211',
            'val': '丰满区'
        },
        {
            'code': '220221',
            'val': '永吉县'
        },
        {
            'code': '220281',
            'val': '蛟河市'
        },
        {
            'code': '220282',
            'val': '桦甸市'
        },
        {
            'code': '220283',
            'val': '舒兰市'
        },
        {
            'code': '220284',
            'val': '磐石市'
        }
    ],
    '220300': [
        {
            'code': '220301',
            'val': '市辖区'
        },
        {
            'code': '220302',
            'val': '铁西区'
        },
        {
            'code': '220303',
            'val': '铁东区'
        },
        {
            'code': '220322',
            'val': '梨树县'
        },
        {
            'code': '220323',
            'val': '伊通满族自治县'
        },
        {
            'code': '220381',
            'val': '公主岭市'
        },
        {
            'code': '220382',
            'val': '双辽市'
        }
    ],
    '220400': [
        {
            'code': '220401',
            'val': '市辖区'
        },
        {
            'code': '220402',
            'val': '龙山区'
        },
        {
            'code': '220403',
            'val': '西安区'
        },
        {
            'code': '220421',
            'val': '东丰县'
        },
        {
            'code': '220422',
            'val': '东辽县'
        }
    ],
    '220500': [
        {
            'code': '220501',
            'val': '市辖区'
        },
        {
            'code': '220502',
            'val': '东昌区'
        },
        {
            'code': '220503',
            'val': '二道江区'
        },
        {
            'code': '220521',
            'val': '通化县'
        },
        {
            'code': '220523',
            'val': '辉南县'
        },
        {
            'code': '220524',
            'val': '柳河县'
        },
        {
            'code': '220581',
            'val': '梅河口市'
        },
        {
            'code': '220582',
            'val': '集安市'
        }
    ],
    '220600': [
        {
            'code': '220601',
            'val': '市辖区'
        },
        {
            'code': '220602',
            'val': '八道江区'
        },
        {
            'code': '220621',
            'val': '抚松县'
        },
        {
            'code': '220622',
            'val': '靖宇县'
        },
        {
            'code': '220623',
            'val': '长白朝鲜族自治县'
        },
        {
            'code': '220625',
            'val': '江源县'
        },
        {
            'code': '220681',
            'val': '临江市'
        }
    ],
    '220700': [
        {
            'code': '220701',
            'val': '市辖区'
        },
        {
            'code': '220702',
            'val': '宁江区'
        },
        {
            'code': '220721',
            'val': '前郭尔罗斯蒙古族自治县'
        },
        {
            'code': '220722',
            'val': '长岭县'
        },
        {
            'code': '220723',
            'val': '乾安县'
        },
        {
            'code': '220724',
            'val': '扶余县'
        }
    ],
    '220800': [
        {
            'code': '220801',
            'val': '市辖区'
        },
        {
            'code': '220802',
            'val': '洮北区'
        },
        {
            'code': '220821',
            'val': '镇赉县'
        },
        {
            'code': '220822',
            'val': '通榆县'
        },
        {
            'code': '220881',
            'val': '洮南市'
        },
        {
            'code': '220882',
            'val': '大安市'
        }
    ],
    '222400': [
        {
            'code': '222401',
            'val': '延吉市'
        },
        {
            'code': '222402',
            'val': '图们市'
        },
        {
            'code': '222403',
            'val': '敦化市'
        },
        {
            'code': '222404',
            'val': '珲春市'
        },
        {
            'code': '222405',
            'val': '龙井市'
        },
        {
            'code': '222406',
            'val': '和龙市'
        },
        {
            'code': '222424',
            'val': '汪清县'
        },
        {
            'code': '222426',
            'val': '安图县'
        }
    ],
    '230100': [
        {
            'code': '230101',
            'val': '市辖区'
        },
        {
            'code': '230102',
            'val': '道里区'
        },
        {
            'code': '230103',
            'val': '南岗区'
        },
        {
            'code': '230104',
            'val': '道外区'
        },
        {
            'code': '230106',
            'val': '香坊区'
        },
        {
            'code': '230107',
            'val': '动力区'
        },
        {
            'code': '230108',
            'val': '平房区'
        },
        {
            'code': '230109',
            'val': '松北区'
        },
        {
            'code': '230111',
            'val': '呼兰区'
        },
        {
            'code': '230123',
            'val': '依兰县'
        },
        {
            'code': '230124',
            'val': '方正县'
        },
        {
            'code': '230125',
            'val': '宾县'
        },
        {
            'code': '230126',
            'val': '巴彦县'
        },
        {
            'code': '230127',
            'val': '木兰县'
        },
        {
            'code': '230128',
            'val': '通河县'
        },
        {
            'code': '230129',
            'val': '延寿县'
        },
        {
            'code': '230181',
            'val': '阿城市'
        },
        {
            'code': '230182',
            'val': '双城市'
        },
        {
            'code': '230183',
            'val': '尚志市'
        },
        {
            'code': '230184',
            'val': '五常市'
        }
    ],
    '230200': [
        {
            'code': '230201',
            'val': '市辖区'
        },
        {
            'code': '230202',
            'val': '龙沙区'
        },
        {
            'code': '230203',
            'val': '建华区'
        },
        {
            'code': '230204',
            'val': '铁锋区'
        },
        {
            'code': '230205',
            'val': '昂昂溪区'
        },
        {
            'code': '230206',
            'val': '富拉尔基区'
        },
        {
            'code': '230207',
            'val': '碾子山区'
        },
        {
            'code': '230208',
            'val': '梅里斯达斡尔族区'
        },
        {
            'code': '230221',
            'val': '龙江县'
        },
        {
            'code': '230223',
            'val': '依安县'
        },
        {
            'code': '230224',
            'val': '泰来县'
        },
        {
            'code': '230225',
            'val': '甘南县'
        },
        {
            'code': '230227',
            'val': '富裕县'
        },
        {
            'code': '230229',
            'val': '克山县'
        },
        {
            'code': '230230',
            'val': '克东县'
        },
        {
            'code': '230231',
            'val': '拜泉县'
        },
        {
            'code': '230281',
            'val': '讷河市'
        }
    ],
    '230300': [
        {
            'code': '230301',
            'val': '市辖区'
        },
        {
            'code': '230302',
            'val': '鸡冠区'
        },
        {
            'code': '230303',
            'val': '恒山区'
        },
        {
            'code': '230304',
            'val': '滴道区'
        },
        {
            'code': '230305',
            'val': '梨树区'
        },
        {
            'code': '230306',
            'val': '城子河区'
        },
        {
            'code': '230307',
            'val': '麻山区'
        },
        {
            'code': '230321',
            'val': '鸡东县'
        },
        {
            'code': '230381',
            'val': '虎林市'
        },
        {
            'code': '230382',
            'val': '密山市'
        }
    ],
    '230400': [
        {
            'code': '230401',
            'val': '市辖区'
        },
        {
            'code': '230402',
            'val': '向阳区'
        },
        {
            'code': '230403',
            'val': '工农区'
        },
        {
            'code': '230404',
            'val': '南山区'
        },
        {
            'code': '230405',
            'val': '兴安区'
        },
        {
            'code': '230406',
            'val': '东山区'
        },
        {
            'code': '230407',
            'val': '兴山区'
        },
        {
            'code': '230421',
            'val': '萝北县'
        },
        {
            'code': '230422',
            'val': '绥滨县'
        }
    ],
    '230500': [
        {
            'code': '230501',
            'val': '市辖区'
        },
        {
            'code': '230502',
            'val': '尖山区'
        },
        {
            'code': '230503',
            'val': '岭东区'
        },
        {
            'code': '230505',
            'val': '四方台区'
        },
        {
            'code': '230506',
            'val': '宝山区'
        },
        {
            'code': '230521',
            'val': '集贤县'
        },
        {
            'code': '230522',
            'val': '友谊县'
        },
        {
            'code': '230523',
            'val': '宝清县'
        },
        {
            'code': '230524',
            'val': '饶河县'
        }
    ],
    '230600': [
        {
            'code': '230601',
            'val': '市辖区'
        },
        {
            'code': '230602',
            'val': '萨尔图区'
        },
        {
            'code': '230603',
            'val': '龙凤区'
        },
        {
            'code': '230604',
            'val': '让胡路区'
        },
        {
            'code': '230605',
            'val': '红岗区'
        },
        {
            'code': '230606',
            'val': '大同区'
        },
        {
            'code': '230621',
            'val': '肇州县'
        },
        {
            'code': '230622',
            'val': '肇源县'
        },
        {
            'code': '230623',
            'val': '林甸县'
        },
        {
            'code': '230624',
            'val': '杜尔伯特蒙古族自治县'
        }
    ],
    '230700': [
        {
            'code': '230701',
            'val': '市辖区'
        },
        {
            'code': '230702',
            'val': '伊春区'
        },
        {
            'code': '230703',
            'val': '南岔区'
        },
        {
            'code': '230704',
            'val': '友好区'
        },
        {
            'code': '230705',
            'val': '西林区'
        },
        {
            'code': '230706',
            'val': '翠峦区'
        },
        {
            'code': '230707',
            'val': '新青区'
        },
        {
            'code': '230708',
            'val': '美溪区'
        },
        {
            'code': '230709',
            'val': '金山屯区'
        },
        {
            'code': '230710',
            'val': '五营区'
        },
        {
            'code': '230711',
            'val': '乌马河区'
        },
        {
            'code': '230712',
            'val': '汤旺河区'
        },
        {
            'code': '230713',
            'val': '带岭区'
        },
        {
            'code': '230714',
            'val': '乌伊岭区'
        },
        {
            'code': '230715',
            'val': '红星区'
        },
        {
            'code': '230716',
            'val': '上甘岭区'
        },
        {
            'code': '230722',
            'val': '嘉荫县'
        },
        {
            'code': '230781',
            'val': '铁力市'
        }
    ],
    '230800': [
        {
            'code': '230801',
            'val': '市辖区'
        },
        {
            'code': '230802',
            'val': '永红区'
        },
        {
            'code': '230803',
            'val': '向阳区'
        },
        {
            'code': '230804',
            'val': '前进区'
        },
        {
            'code': '230805',
            'val': '东风区'
        },
        {
            'code': '230811',
            'val': '郊区'
        },
        {
            'code': '230822',
            'val': '桦南县'
        },
        {
            'code': '230826',
            'val': '桦川县'
        },
        {
            'code': '230828',
            'val': '汤原县'
        },
        {
            'code': '230833',
            'val': '抚远县'
        },
        {
            'code': '230881',
            'val': '同江市'
        },
        {
            'code': '230882',
            'val': '富锦市'
        }
    ],
    '230900': [
        {
            'code': '230901',
            'val': '市辖区'
        },
        {
            'code': '230902',
            'val': '新兴区'
        },
        {
            'code': '230903',
            'val': '桃山区'
        },
        {
            'code': '230904',
            'val': '茄子河区'
        },
        {
            'code': '230921',
            'val': '勃利县'
        }
    ],
    '231000': [
        {
            'code': '231001',
            'val': '市辖区'
        },
        {
            'code': '231002',
            'val': '东安区'
        },
        {
            'code': '231003',
            'val': '阳明区'
        },
        {
            'code': '231004',
            'val': '爱民区'
        },
        {
            'code': '231005',
            'val': '西安区'
        },
        {
            'code': '231024',
            'val': '东宁县'
        },
        {
            'code': '231025',
            'val': '林口县'
        },
        {
            'code': '231081',
            'val': '绥芬河市'
        },
        {
            'code': '231083',
            'val': '海林市'
        },
        {
            'code': '231084',
            'val': '宁安市'
        },
        {
            'code': '231085',
            'val': '穆棱市'
        }
    ],
    '231100': [
        {
            'code': '231101',
            'val': '市辖区'
        },
        {
            'code': '231102',
            'val': '爱辉区'
        },
        {
            'code': '231121',
            'val': '嫩江县'
        },
        {
            'code': '231123',
            'val': '逊克县'
        },
        {
            'code': '231124',
            'val': '孙吴县'
        },
        {
            'code': '231181',
            'val': '北安市'
        },
        {
            'code': '231182',
            'val': '五大连池市'
        }
    ],
    '231200': [
        {
            'code': '231201',
            'val': '市辖区'
        },
        {
            'code': '231202',
            'val': '北林区'
        },
        {
            'code': '231221',
            'val': '望奎县'
        },
        {
            'code': '231222',
            'val': '兰西县'
        },
        {
            'code': '231223',
            'val': '青冈县'
        },
        {
            'code': '231224',
            'val': '庆安县'
        },
        {
            'code': '231225',
            'val': '明水县'
        },
        {
            'code': '231226',
            'val': '绥棱县'
        },
        {
            'code': '231281',
            'val': '安达市'
        },
        {
            'code': '231282',
            'val': '肇东市'
        },
        {
            'code': '231283',
            'val': '海伦市'
        }
    ],
    '232700': [
        {
            'code': '232721',
            'val': '呼玛县'
        },
        {
            'code': '232722',
            'val': '塔河县'
        },
        {
            'code': '232723',
            'val': '漠河县'
        }
    ],
    '310100': [
        {
            'code': '310101',
            'val': '黄浦区'
        },
        {
            'code': '310103',
            'val': '卢湾区'
        },
        {
            'code': '310104',
            'val': '徐汇区'
        },
        {
            'code': '310105',
            'val': '长宁区'
        },
        {
            'code': '310106',
            'val': '静安区'
        },
        {
            'code': '310107',
            'val': '普陀区'
        },
        {
            'code': '310108',
            'val': '闸北区'
        },
        {
            'code': '310109',
            'val': '虹口区'
        },
        {
            'code': '310110',
            'val': '杨浦区'
        },
        {
            'code': '310112',
            'val': '闵行区'
        },
        {
            'code': '310113',
            'val': '宝山区'
        },
        {
            'code': '310114',
            'val': '嘉定区'
        },
        {
            'code': '310115',
            'val': '浦东新区'
        },
        {
            'code': '310116',
            'val': '金山区'
        },
        {
            'code': '310117',
            'val': '松江区'
        },
        {
            'code': '310118',
            'val': '青浦区'
        },
        {
            'code': '310119',
            'val': '南汇区'
        },
        {
            'code': '310120',
            'val': '奉贤区'
        }
    ],
    '310200': [
        {
            'code': '310230',
            'val': '崇明'
        }
    ],
    '320100': [
        {
            'code': '320101',
            'val': '市辖区'
        },
        {
            'code': '320102',
            'val': '玄武区'
        },
        {
            'code': '320103',
            'val': '白下区'
        },
        {
            'code': '320104',
            'val': '秦淮区'
        },
        {
            'code': '320105',
            'val': '建邺区'
        },
        {
            'code': '320106',
            'val': '鼓楼区'
        },
        {
            'code': '320107',
            'val': '下关区'
        },
        {
            'code': '320111',
            'val': '浦口区'
        },
        {
            'code': '320113',
            'val': '栖霞区'
        },
        {
            'code': '320114',
            'val': '雨花台区'
        },
        {
            'code': '320115',
            'val': '江宁区'
        },
        {
            'code': '320116',
            'val': '六合区'
        },
        {
            'code': '320124',
            'val': '溧水县'
        },
        {
            'code': '320125',
            'val': '高淳县'
        }
    ],
    '320200': [
        {
            'code': '320201',
            'val': '市辖区'
        },
        {
            'code': '320202',
            'val': '崇安区'
        },
        {
            'code': '320203',
            'val': '南长区'
        },
        {
            'code': '320204',
            'val': '北塘区'
        },
        {
            'code': '320205',
            'val': '锡山区'
        },
        {
            'code': '320206',
            'val': '惠山区'
        },
        {
            'code': '320211',
            'val': '滨湖区'
        },
        {
            'code': '320281',
            'val': '江阴市'
        },
        {
            'code': '320282',
            'val': '宜兴市'
        }
    ],
    '320300': [
        {
            'code': '320301',
            'val': '市辖区'
        },
        {
            'code': '320302',
            'val': '鼓楼区'
        },
        {
            'code': '320303',
            'val': '云龙区'
        },
        {
            'code': '320304',
            'val': '九里区'
        },
        {
            'code': '320305',
            'val': '贾汪区'
        },
        {
            'code': '320311',
            'val': '泉山区'
        },
        {
            'code': '320321',
            'val': '丰县'
        },
        {
            'code': '320322',
            'val': '沛县'
        },
        {
            'code': '320323',
            'val': '铜山县'
        },
        {
            'code': '320324',
            'val': '睢宁县'
        },
        {
            'code': '320381',
            'val': '新沂市'
        },
        {
            'code': '320382',
            'val': '邳州市'
        }
    ],
    '320400': [
        {
            'code': '320401',
            'val': '市辖区'
        },
        {
            'code': '320402',
            'val': '天宁区'
        },
        {
            'code': '320404',
            'val': '钟楼区'
        },
        {
            'code': '320405',
            'val': '戚墅堰区'
        },
        {
            'code': '320411',
            'val': '新北区'
        },
        {
            'code': '320412',
            'val': '武进区'
        },
        {
            'code': '320481',
            'val': '溧阳市'
        },
        {
            'code': '320482',
            'val': '金坛市'
        }
    ],
    '320500': [
        {
            'code': '320501',
            'val': '市辖区'
        },
        {
            'code': '320502',
            'val': '沧浪区'
        },
        {
            'code': '320503',
            'val': '平江区'
        },
        {
            'code': '320504',
            'val': '金阊区'
        },
        {
            'code': '320505',
            'val': '新区'
        },
        {
            'code': '320506',
            'val': '吴中区'
        },
        {
            'code': '320507',
            'val': '相城区'
        },
        {
            'code': '320581',
            'val': '常熟市'
        },
        {
            'code': '320582',
            'val': '张家港市'
        },
        {
            'code': '320583',
            'val': '昆山市'
        },
        {
            'code': '320584',
            'val': '吴江区'
        },
        {
            'code': '320585',
            'val': '太仓市'
        },
        {
            'code': '320586',
            'val': '姑苏区'
        },
        {
            'code': '320587',
            'val': '园区'
        }
    ],
    '320600': [
        {
            'code': '320601',
            'val': '市辖区'
        },
        {
            'code': '320602',
            'val': '崇川区'
        },
        {
            'code': '320611',
            'val': '港闸区'
        },
        {
            'code': '320621',
            'val': '海安县'
        },
        {
            'code': '320623',
            'val': '如东县'
        },
        {
            'code': '320681',
            'val': '启东市'
        },
        {
            'code': '320682',
            'val': '如皋市'
        },
        {
            'code': '320683',
            'val': '通州市'
        },
        {
            'code': '320684',
            'val': '海门市'
        }
    ],
    '320700': [
        {
            'code': '320701',
            'val': '市辖区'
        },
        {
            'code': '320703',
            'val': '连云区'
        },
        {
            'code': '320705',
            'val': '新浦区'
        },
        {
            'code': '320706',
            'val': '海州区'
        },
        {
            'code': '320721',
            'val': '赣榆县'
        },
        {
            'code': '320722',
            'val': '东海县'
        },
        {
            'code': '320723',
            'val': '灌云县'
        },
        {
            'code': '320724',
            'val': '灌南县'
        }
    ],
    '320800': [
        {
            'code': '320801',
            'val': '市辖区'
        },
        {
            'code': '320802',
            'val': '清河区'
        },
        {
            'code': '320803',
            'val': '楚州区'
        },
        {
            'code': '320804',
            'val': '淮阴区'
        },
        {
            'code': '320811',
            'val': '清浦区'
        },
        {
            'code': '320826',
            'val': '涟水县'
        },
        {
            'code': '320829',
            'val': '洪泽县'
        },
        {
            'code': '320830',
            'val': '盱眙县'
        },
        {
            'code': '320831',
            'val': '金湖县'
        }
    ],
    '320900': [
        {
            'code': '320901',
            'val': '市辖区'
        },
        {
            'code': '320902',
            'val': '亭湖区'
        },
        {
            'code': '320903',
            'val': '盐都区'
        },
        {
            'code': '320921',
            'val': '响水县'
        },
        {
            'code': '320922',
            'val': '滨海县'
        },
        {
            'code': '320923',
            'val': '阜宁县'
        },
        {
            'code': '320924',
            'val': '射阳县'
        },
        {
            'code': '320925',
            'val': '建湖县'
        },
        {
            'code': '320981',
            'val': '东台市'
        },
        {
            'code': '320982',
            'val': '大丰市'
        }
    ],
    '321000': [
        {
            'code': '321001',
            'val': '市辖区'
        },
        {
            'code': '321002',
            'val': '广陵区'
        },
        {
            'code': '321003',
            'val': '邗江区'
        },
        {
            'code': '321011',
            'val': '郊区'
        },
        {
            'code': '321023',
            'val': '宝应县'
        },
        {
            'code': '321081',
            'val': '仪征市'
        },
        {
            'code': '321084',
            'val': '高邮市'
        },
        {
            'code': '321088',
            'val': '江都市'
        }
    ],
    '321100': [
        {
            'code': '321101',
            'val': '市辖区'
        },
        {
            'code': '321102',
            'val': '京口区'
        },
        {
            'code': '321111',
            'val': '润州区'
        },
        {
            'code': '321112',
            'val': '丹徒区'
        },
        {
            'code': '321181',
            'val': '丹阳市'
        },
        {
            'code': '321182',
            'val': '扬中市'
        },
        {
            'code': '321183',
            'val': '句容市'
        }
    ],
    '321200': [
        {
            'code': '321201',
            'val': '市辖区'
        },
        {
            'code': '321202',
            'val': '海陵区'
        },
        {
            'code': '321203',
            'val': '高港区'
        },
        {
            'code': '321281',
            'val': '兴化市'
        },
        {
            'code': '321282',
            'val': '靖江市'
        },
        {
            'code': '321283',
            'val': '泰兴市'
        },
        {
            'code': '321284',
            'val': '姜堰市'
        }
    ],
    '321300': [
        {
            'code': '321301',
            'val': '市辖区'
        },
        {
            'code': '321302',
            'val': '宿城区'
        },
        {
            'code': '321311',
            'val': '宿豫区'
        },
        {
            'code': '321322',
            'val': '沭阳县'
        },
        {
            'code': '321323',
            'val': '泗阳县'
        },
        {
            'code': '321324',
            'val': '泗洪县'
        }
    ],
    '330100': [
        {
            'code': '330101',
            'val': '市辖区'
        },
        {
            'code': '330102',
            'val': '上城区'
        },
        {
            'code': '330103',
            'val': '下城区'
        },
        {
            'code': '330104',
            'val': '江干区'
        },
        {
            'code': '330105',
            'val': '拱墅区'
        },
        {
            'code': '330106',
            'val': '西湖区'
        },
        {
            'code': '330108',
            'val': '滨江区'
        },
        {
            'code': '330109',
            'val': '萧山区'
        },
        {
            'code': '330110',
            'val': '余杭区'
        },
        {
            'code': '330122',
            'val': '桐庐县'
        },
        {
            'code': '330127',
            'val': '淳安县'
        },
        {
            'code': '330182',
            'val': '建德市'
        },
        {
            'code': '330183',
            'val': '富阳市'
        },
        {
            'code': '330185',
            'val': '临安市'
        }
    ],
    '330200': [
        {
            'code': '330201',
            'val': '市辖区'
        },
        {
            'code': '330203',
            'val': '海曙区'
        },
        {
            'code': '330204',
            'val': '江东区'
        },
        {
            'code': '330205',
            'val': '江北区'
        },
        {
            'code': '330206',
            'val': '北仑区'
        },
        {
            'code': '330211',
            'val': '镇海区'
        },
        {
            'code': '330212',
            'val': '鄞州区'
        },
        {
            'code': '330225',
            'val': '象山县'
        },
        {
            'code': '330226',
            'val': '宁海县'
        },
        {
            'code': '330281',
            'val': '余姚市'
        },
        {
            'code': '330282',
            'val': '慈溪市'
        },
        {
            'code': '330283',
            'val': '奉化市'
        }
    ],
    '330300': [
        {
            'code': '330301',
            'val': '市辖区'
        },
        {
            'code': '330302',
            'val': '鹿城区'
        },
        {
            'code': '330303',
            'val': '龙湾区'
        },
        {
            'code': '330304',
            'val': '瓯海区'
        },
        {
            'code': '330322',
            'val': '洞头县'
        },
        {
            'code': '330324',
            'val': '永嘉县'
        },
        {
            'code': '330326',
            'val': '平阳县'
        },
        {
            'code': '330327',
            'val': '苍南县'
        },
        {
            'code': '330328',
            'val': '文成县'
        },
        {
            'code': '330329',
            'val': '泰顺县'
        },
        {
            'code': '330381',
            'val': '瑞安市'
        },
        {
            'code': '330382',
            'val': '乐清市'
        }
    ],
    '330400': [
        {
            'code': '330401',
            'val': '市辖区'
        },
        {
            'code': '330402',
            'val': '秀城区'
        },
        {
            'code': '330411',
            'val': '秀洲区'
        },
        {
            'code': '330421',
            'val': '嘉善县'
        },
        {
            'code': '330424',
            'val': '海盐县'
        },
        {
            'code': '330481',
            'val': '海宁市'
        },
        {
            'code': '330482',
            'val': '平湖市'
        },
        {
            'code': '330483',
            'val': '桐乡市'
        }
    ],
    '330500': [
        {
            'code': '330501',
            'val': '市辖区'
        },
        {
            'code': '330502',
            'val': '吴兴区'
        },
        {
            'code': '330503',
            'val': '南浔区'
        },
        {
            'code': '330521',
            'val': '德清县'
        },
        {
            'code': '330522',
            'val': '长兴县'
        },
        {
            'code': '330523',
            'val': '安吉县'
        }
    ],
    '330600': [
        {
            'code': '330601',
            'val': '市辖区'
        },
        {
            'code': '330602',
            'val': '越城区'
        },
        {
            'code': '330621',
            'val': '绍兴县'
        },
        {
            'code': '330624',
            'val': '新昌县'
        },
        {
            'code': '330681',
            'val': '诸暨市'
        },
        {
            'code': '330682',
            'val': '上虞市'
        },
        {
            'code': '330683',
            'val': '嵊州市'
        }
    ],
    '330700': [
        {
            'code': '330701',
            'val': '市辖区'
        },
        {
            'code': '330702',
            'val': '婺城区'
        },
        {
            'code': '330703',
            'val': '金东区'
        },
        {
            'code': '330723',
            'val': '武义县'
        },
        {
            'code': '330726',
            'val': '浦江县'
        },
        {
            'code': '330727',
            'val': '磐安县'
        },
        {
            'code': '330781',
            'val': '兰溪市'
        },
        {
            'code': '330782',
            'val': '义乌市'
        },
        {
            'code': '330783',
            'val': '东阳市'
        },
        {
            'code': '330784',
            'val': '永康市'
        }
    ],
    '330800': [
        {
            'code': '330801',
            'val': '市辖区'
        },
        {
            'code': '330802',
            'val': '柯城区'
        },
        {
            'code': '330803',
            'val': '衢江区'
        },
        {
            'code': '330822',
            'val': '常山县'
        },
        {
            'code': '330824',
            'val': '开化县'
        },
        {
            'code': '330825',
            'val': '龙游县'
        },
        {
            'code': '330881',
            'val': '江山市'
        }
    ],
    '330900': [
        {
            'code': '330901',
            'val': '市辖区'
        },
        {
            'code': '330902',
            'val': '定海区'
        },
        {
            'code': '330903',
            'val': '普陀区'
        },
        {
            'code': '330921',
            'val': '岱山县'
        },
        {
            'code': '330922',
            'val': '嵊泗县'
        }
    ],
    '331000': [
        {
            'code': '331001',
            'val': '市辖区'
        },
        {
            'code': '331002',
            'val': '椒江区'
        },
        {
            'code': '331003',
            'val': '黄岩区'
        },
        {
            'code': '331004',
            'val': '路桥区'
        },
        {
            'code': '331021',
            'val': '玉环县'
        },
        {
            'code': '331022',
            'val': '三门县'
        },
        {
            'code': '331023',
            'val': '天台县'
        },
        {
            'code': '331024',
            'val': '仙居县'
        },
        {
            'code': '331081',
            'val': '温岭市'
        },
        {
            'code': '331082',
            'val': '临海市'
        }
    ],
    '331100': [
        {
            'code': '331101',
            'val': '市辖区'
        },
        {
            'code': '331102',
            'val': '莲都区'
        },
        {
            'code': '331121',
            'val': '青田县'
        },
        {
            'code': '331122',
            'val': '缙云县'
        },
        {
            'code': '331123',
            'val': '遂昌县'
        },
        {
            'code': '331124',
            'val': '松阳县'
        },
        {
            'code': '331125',
            'val': '云和县'
        },
        {
            'code': '331126',
            'val': '庆元县'
        },
        {
            'code': '331127',
            'val': '景宁畲族自治县'
        },
        {
            'code': '331181',
            'val': '龙泉市'
        }
    ],
    '340100': [
        {
            'code': '340101',
            'val': '市辖区'
        },
        {
            'code': '340102',
            'val': '瑶海区'
        },
        {
            'code': '340103',
            'val': '庐阳区'
        },
        {
            'code': '340104',
            'val': '蜀山区'
        },
        {
            'code': '340111',
            'val': '包河区'
        },
        {
            'code': '340121',
            'val': '长丰县'
        },
        {
            'code': '340122',
            'val': '肥东县'
        },
        {
            'code': '340123',
            'val': '肥西县'
        }
    ],
    '340200': [
        {
            'code': '340201',
            'val': '市辖区'
        },
        {
            'code': '340202',
            'val': '镜湖区'
        },
        {
            'code': '340203',
            'val': '马塘区'
        },
        {
            'code': '340204',
            'val': '新芜区'
        },
        {
            'code': '340207',
            'val': '鸠江区'
        },
        {
            'code': '340221',
            'val': '芜湖县'
        },
        {
            'code': '340222',
            'val': '繁昌县'
        },
        {
            'code': '340223',
            'val': '南陵县'
        }
    ],
    '340300': [
        {
            'code': '340301',
            'val': '市辖区'
        },
        {
            'code': '340302',
            'val': '龙子湖区'
        },
        {
            'code': '340303',
            'val': '蚌山区'
        },
        {
            'code': '340304',
            'val': '禹会区'
        },
        {
            'code': '340311',
            'val': '淮上区'
        },
        {
            'code': '340321',
            'val': '怀远县'
        },
        {
            'code': '340322',
            'val': '五河县'
        },
        {
            'code': '340323',
            'val': '固镇县'
        }
    ],
    '340400': [
        {
            'code': '340401',
            'val': '市辖区'
        },
        {
            'code': '340402',
            'val': '大通区'
        },
        {
            'code': '340403',
            'val': '田家庵区'
        },
        {
            'code': '340404',
            'val': '谢家集区'
        },
        {
            'code': '340405',
            'val': '八公山区'
        },
        {
            'code': '340406',
            'val': '潘集区'
        },
        {
            'code': '340421',
            'val': '凤台县'
        }
    ],
    '340500': [
        {
            'code': '340501',
            'val': '市辖区'
        },
        {
            'code': '340502',
            'val': '金家庄区'
        },
        {
            'code': '340503',
            'val': '花山区'
        },
        {
            'code': '340504',
            'val': '雨山区'
        },
        {
            'code': '340521',
            'val': '当涂县'
        }
    ],
    '340600': [
        {
            'code': '340601',
            'val': '市辖区'
        },
        {
            'code': '340602',
            'val': '杜集区'
        },
        {
            'code': '340603',
            'val': '相山区'
        },
        {
            'code': '340604',
            'val': '烈山区'
        },
        {
            'code': '340621',
            'val': '濉溪县'
        }
    ],
    '340700': [
        {
            'code': '340701',
            'val': '市辖区'
        },
        {
            'code': '340702',
            'val': '铜官山区'
        },
        {
            'code': '340703',
            'val': '狮子山区'
        },
        {
            'code': '340711',
            'val': '郊区'
        },
        {
            'code': '340721',
            'val': '铜陵县'
        }
    ],
    '340800': [
        {
            'code': '340801',
            'val': '市辖区'
        },
        {
            'code': '340802',
            'val': '迎江区'
        },
        {
            'code': '340803',
            'val': '大观区'
        },
        {
            'code': '340811',
            'val': '郊区'
        },
        {
            'code': '340822',
            'val': '怀宁县'
        },
        {
            'code': '340823',
            'val': '枞阳县'
        },
        {
            'code': '340824',
            'val': '潜山县'
        },
        {
            'code': '340825',
            'val': '太湖县'
        },
        {
            'code': '340826',
            'val': '宿松县'
        },
        {
            'code': '340827',
            'val': '望江县'
        },
        {
            'code': '340828',
            'val': '岳西县'
        },
        {
            'code': '340881',
            'val': '桐城市'
        }
    ],
    '341000': [
        {
            'code': '341001',
            'val': '市辖区'
        },
        {
            'code': '341002',
            'val': '屯溪区'
        },
        {
            'code': '341003',
            'val': '黄山区'
        },
        {
            'code': '341004',
            'val': '徽州区'
        },
        {
            'code': '341021',
            'val': '歙县'
        },
        {
            'code': '341022',
            'val': '休宁县'
        },
        {
            'code': '341023',
            'val': '黟县'
        },
        {
            'code': '341024',
            'val': '祁门县'
        }
    ],
    '341100': [
        {
            'code': '341101',
            'val': '市辖区'
        },
        {
            'code': '341102',
            'val': '琅琊区'
        },
        {
            'code': '341103',
            'val': '南谯区'
        },
        {
            'code': '341122',
            'val': '来安县'
        },
        {
            'code': '341124',
            'val': '全椒县'
        },
        {
            'code': '341125',
            'val': '定远县'
        },
        {
            'code': '341126',
            'val': '凤阳县'
        },
        {
            'code': '341181',
            'val': '天长市'
        },
        {
            'code': '341182',
            'val': '明光市'
        }
    ],
    '341200': [
        {
            'code': '341201',
            'val': '市辖区'
        },
        {
            'code': '341202',
            'val': '颍州区'
        },
        {
            'code': '341203',
            'val': '颍东区'
        },
        {
            'code': '341204',
            'val': '颍泉区'
        },
        {
            'code': '341221',
            'val': '临泉县'
        },
        {
            'code': '341222',
            'val': '太和县'
        },
        {
            'code': '341225',
            'val': '阜南县'
        },
        {
            'code': '341226',
            'val': '颍上县'
        },
        {
            'code': '341282',
            'val': '界首市'
        }
    ],
    '341300': [
        {
            'code': '341301',
            'val': '市辖区'
        },
        {
            'code': '341302',
            'val': '墉桥区'
        },
        {
            'code': '341321',
            'val': '砀山县'
        },
        {
            'code': '341322',
            'val': '萧县'
        },
        {
            'code': '341323',
            'val': '灵璧县'
        },
        {
            'code': '341324',
            'val': '泗县'
        }
    ],
    '341400': [
        {
            'code': '341401',
            'val': '市辖区'
        },
        {
            'code': '341402',
            'val': '居巢区'
        },
        {
            'code': '341421',
            'val': '庐江县'
        },
        {
            'code': '341422',
            'val': '无为县'
        },
        {
            'code': '341423',
            'val': '含山县'
        },
        {
            'code': '341424',
            'val': '和县'
        }
    ],
    '341500': [
        {
            'code': '341501',
            'val': '市辖区'
        },
        {
            'code': '341502',
            'val': '金安区'
        },
        {
            'code': '341503',
            'val': '裕安区'
        },
        {
            'code': '341521',
            'val': '寿县'
        },
        {
            'code': '341522',
            'val': '霍邱县'
        },
        {
            'code': '341523',
            'val': '舒城县'
        },
        {
            'code': '341524',
            'val': '金寨县'
        },
        {
            'code': '341525',
            'val': '霍山县'
        }
    ],
    '341600': [
        {
            'code': '341601',
            'val': '市辖区'
        },
        {
            'code': '341602',
            'val': '谯城区'
        },
        {
            'code': '341621',
            'val': '涡阳县'
        },
        {
            'code': '341622',
            'val': '蒙城县'
        },
        {
            'code': '341623',
            'val': '利辛县'
        }
    ],
    '341700': [
        {
            'code': '341701',
            'val': '市辖区'
        },
        {
            'code': '341702',
            'val': '贵池区'
        },
        {
            'code': '341721',
            'val': '东至县'
        },
        {
            'code': '341722',
            'val': '石台县'
        },
        {
            'code': '341723',
            'val': '青阳县'
        }
    ],
    '341800': [
        {
            'code': '341801',
            'val': '市辖区'
        },
        {
            'code': '341802',
            'val': '宣州区'
        },
        {
            'code': '341821',
            'val': '郎溪县'
        },
        {
            'code': '341822',
            'val': '广德县'
        },
        {
            'code': '341823',
            'val': '泾县'
        },
        {
            'code': '341824',
            'val': '绩溪县'
        },
        {
            'code': '341825',
            'val': '旌德县'
        },
        {
            'code': '341881',
            'val': '宁国市'
        }
    ],
    '350100': [
        {
            'code': '350101',
            'val': '市辖区'
        },
        {
            'code': '350102',
            'val': '鼓楼区'
        },
        {
            'code': '350103',
            'val': '台江区'
        },
        {
            'code': '350104',
            'val': '仓山区'
        },
        {
            'code': '350105',
            'val': '马尾区'
        },
        {
            'code': '350111',
            'val': '晋安区'
        },
        {
            'code': '350121',
            'val': '闽侯县'
        },
        {
            'code': '350122',
            'val': '连江县'
        },
        {
            'code': '350123',
            'val': '罗源县'
        },
        {
            'code': '350124',
            'val': '闽清县'
        },
        {
            'code': '350125',
            'val': '永泰县'
        },
        {
            'code': '350128',
            'val': '平潭县'
        },
        {
            'code': '350181',
            'val': '福清市'
        },
        {
            'code': '350182',
            'val': '长乐市'
        }
    ],
    '350200': [
        {
            'code': '350201',
            'val': '市辖区'
        },
        {
            'code': '350203',
            'val': '思明区'
        },
        {
            'code': '350205',
            'val': '海沧区'
        },
        {
            'code': '350206',
            'val': '湖里区'
        },
        {
            'code': '350211',
            'val': '集美区'
        },
        {
            'code': '350212',
            'val': '同安区'
        },
        {
            'code': '350213',
            'val': '翔安区'
        }
    ],
    '350300': [
        {
            'code': '350301',
            'val': '市辖区'
        },
        {
            'code': '350302',
            'val': '城厢区'
        },
        {
            'code': '350303',
            'val': '涵江区'
        },
        {
            'code': '350304',
            'val': '荔城区'
        },
        {
            'code': '350305',
            'val': '秀屿区'
        },
        {
            'code': '350322',
            'val': '仙游县'
        }
    ],
    '350400': [
        {
            'code': '350401',
            'val': '市辖区'
        },
        {
            'code': '350402',
            'val': '梅列区'
        },
        {
            'code': '350403',
            'val': '三元区'
        },
        {
            'code': '350421',
            'val': '明溪县'
        },
        {
            'code': '350423',
            'val': '清流县'
        },
        {
            'code': '350424',
            'val': '宁化县'
        },
        {
            'code': '350425',
            'val': '大田县'
        },
        {
            'code': '350426',
            'val': '尤溪县'
        },
        {
            'code': '350427',
            'val': '沙县'
        },
        {
            'code': '350428',
            'val': '将乐县'
        },
        {
            'code': '350429',
            'val': '泰宁县'
        },
        {
            'code': '350430',
            'val': '建宁县'
        },
        {
            'code': '350481',
            'val': '永安市'
        }
    ],
    '350500': [
        {
            'code': '350501',
            'val': '市辖区'
        },
        {
            'code': '350502',
            'val': '鲤城区'
        },
        {
            'code': '350503',
            'val': '丰泽区'
        },
        {
            'code': '350504',
            'val': '洛江区'
        },
        {
            'code': '350505',
            'val': '泉港区'
        },
        {
            'code': '350521',
            'val': '惠安县'
        },
        {
            'code': '350524',
            'val': '安溪县'
        },
        {
            'code': '350525',
            'val': '永春县'
        },
        {
            'code': '350526',
            'val': '德化县'
        },
        {
            'code': '350527',
            'val': '金门县'
        },
        {
            'code': '350581',
            'val': '石狮市'
        },
        {
            'code': '350582',
            'val': '晋江市'
        },
        {
            'code': '350583',
            'val': '南安市'
        }
    ],
    '350600': [
        {
            'code': '350601',
            'val': '市辖区'
        },
        {
            'code': '350602',
            'val': '芗城区'
        },
        {
            'code': '350603',
            'val': '龙文区'
        },
        {
            'code': '350622',
            'val': '云霄县'
        },
        {
            'code': '350623',
            'val': '漳浦县'
        },
        {
            'code': '350624',
            'val': '诏安县'
        },
        {
            'code': '350625',
            'val': '长泰县'
        },
        {
            'code': '350626',
            'val': '东山县'
        },
        {
            'code': '350627',
            'val': '南靖县'
        },
        {
            'code': '350628',
            'val': '平和县'
        },
        {
            'code': '350629',
            'val': '华安县'
        },
        {
            'code': '350681',
            'val': '龙海市'
        }
    ],
    '350700': [
        {
            'code': '350701',
            'val': '市辖区'
        },
        {
            'code': '350702',
            'val': '延平区'
        },
        {
            'code': '350721',
            'val': '顺昌县'
        },
        {
            'code': '350722',
            'val': '浦城县'
        },
        {
            'code': '350723',
            'val': '光泽县'
        },
        {
            'code': '350724',
            'val': '松溪县'
        },
        {
            'code': '350725',
            'val': '政和县'
        },
        {
            'code': '350781',
            'val': '邵武市'
        },
        {
            'code': '350782',
            'val': '武夷山市'
        },
        {
            'code': '350783',
            'val': '建瓯市'
        },
        {
            'code': '350784',
            'val': '建阳市'
        }
    ],
    '350800': [
        {
            'code': '350801',
            'val': '市辖区'
        },
        {
            'code': '350802',
            'val': '新罗区'
        },
        {
            'code': '350821',
            'val': '长汀县'
        },
        {
            'code': '350822',
            'val': '永定县'
        },
        {
            'code': '350823',
            'val': '上杭县'
        },
        {
            'code': '350824',
            'val': '武平县'
        },
        {
            'code': '350825',
            'val': '连城县'
        },
        {
            'code': '350881',
            'val': '漳平市'
        }
    ],
    '350900': [
        {
            'code': '350901',
            'val': '市辖区'
        },
        {
            'code': '350902',
            'val': '蕉城区'
        },
        {
            'code': '350921',
            'val': '霞浦县'
        },
        {
            'code': '350922',
            'val': '古田县'
        },
        {
            'code': '350923',
            'val': '屏南县'
        },
        {
            'code': '350924',
            'val': '寿宁县'
        },
        {
            'code': '350925',
            'val': '周宁县'
        },
        {
            'code': '350926',
            'val': '柘荣县'
        },
        {
            'code': '350981',
            'val': '福安市'
        },
        {
            'code': '350982',
            'val': '福鼎市'
        }
    ],
    '360100': [
        {
            'code': '360101',
            'val': '市辖区'
        },
        {
            'code': '360102',
            'val': '东湖区'
        },
        {
            'code': '360103',
            'val': '西湖区'
        },
        {
            'code': '360104',
            'val': '青云谱区'
        },
        {
            'code': '360105',
            'val': '湾里区'
        },
        {
            'code': '360111',
            'val': '青山湖区'
        },
        {
            'code': '360121',
            'val': '南昌县'
        },
        {
            'code': '360122',
            'val': '新建县'
        },
        {
            'code': '360123',
            'val': '安义县'
        },
        {
            'code': '360124',
            'val': '进贤县'
        }
    ],
    '360200': [
        {
            'code': '360201',
            'val': '市辖区'
        },
        {
            'code': '360202',
            'val': '昌江区'
        },
        {
            'code': '360203',
            'val': '珠山区'
        },
        {
            'code': '360222',
            'val': '浮梁县'
        },
        {
            'code': '360281',
            'val': '乐平市'
        }
    ],
    '360300': [
        {
            'code': '360301',
            'val': '市辖区'
        },
        {
            'code': '360302',
            'val': '安源区'
        },
        {
            'code': '360313',
            'val': '湘东区'
        },
        {
            'code': '360321',
            'val': '莲花县'
        },
        {
            'code': '360322',
            'val': '上栗县'
        },
        {
            'code': '360323',
            'val': '芦溪县'
        }
    ],
    '360400': [
        {
            'code': '360401',
            'val': '市辖区'
        },
        {
            'code': '360402',
            'val': '庐山区'
        },
        {
            'code': '360403',
            'val': '浔阳区'
        },
        {
            'code': '360421',
            'val': '九江县'
        },
        {
            'code': '360423',
            'val': '武宁县'
        },
        {
            'code': '360424',
            'val': '修水县'
        },
        {
            'code': '360425',
            'val': '永修县'
        },
        {
            'code': '360426',
            'val': '德安县'
        },
        {
            'code': '360427',
            'val': '星子县'
        },
        {
            'code': '360428',
            'val': '都昌县'
        },
        {
            'code': '360429',
            'val': '湖口县'
        },
        {
            'code': '360430',
            'val': '彭泽县'
        },
        {
            'code': '360481',
            'val': '瑞昌市'
        }
    ],
    '360500': [
        {
            'code': '360501',
            'val': '市辖区'
        },
        {
            'code': '360502',
            'val': '渝水区'
        },
        {
            'code': '360521',
            'val': '分宜县'
        }
    ],
    '360600': [
        {
            'code': '360601',
            'val': '市辖区'
        },
        {
            'code': '360602',
            'val': '月湖区'
        },
        {
            'code': '360622',
            'val': '余江县'
        },
        {
            'code': '360681',
            'val': '贵溪市'
        }
    ],
    '360700': [
        {
            'code': '360701',
            'val': '市辖区'
        },
        {
            'code': '360702',
            'val': '章贡区'
        },
        {
            'code': '360721',
            'val': '赣县'
        },
        {
            'code': '360722',
            'val': '信丰县'
        },
        {
            'code': '360723',
            'val': '大余县'
        },
        {
            'code': '360724',
            'val': '上犹县'
        },
        {
            'code': '360725',
            'val': '崇义县'
        },
        {
            'code': '360726',
            'val': '安远县'
        },
        {
            'code': '360727',
            'val': '龙南县'
        },
        {
            'code': '360728',
            'val': '定南县'
        },
        {
            'code': '360729',
            'val': '全南县'
        },
        {
            'code': '360730',
            'val': '宁都县'
        },
        {
            'code': '360731',
            'val': '于都县'
        },
        {
            'code': '360732',
            'val': '兴国县'
        },
        {
            'code': '360733',
            'val': '会昌县'
        },
        {
            'code': '360734',
            'val': '寻乌县'
        },
        {
            'code': '360735',
            'val': '石城县'
        },
        {
            'code': '360781',
            'val': '瑞金市'
        },
        {
            'code': '360782',
            'val': '南康市'
        }
    ],
    '360800': [
        {
            'code': '360801',
            'val': '市辖区'
        },
        {
            'code': '360802',
            'val': '吉州区'
        },
        {
            'code': '360803',
            'val': '青原区'
        },
        {
            'code': '360821',
            'val': '吉安县'
        },
        {
            'code': '360822',
            'val': '吉水县'
        },
        {
            'code': '360823',
            'val': '峡江县'
        },
        {
            'code': '360824',
            'val': '新干县'
        },
        {
            'code': '360825',
            'val': '永丰县'
        },
        {
            'code': '360826',
            'val': '泰和县'
        },
        {
            'code': '360827',
            'val': '遂川县'
        },
        {
            'code': '360828',
            'val': '万安县'
        },
        {
            'code': '360829',
            'val': '安福县'
        },
        {
            'code': '360830',
            'val': '永新县'
        },
        {
            'code': '360881',
            'val': '井冈山市'
        }
    ],
    '360900': [
        {
            'code': '360901',
            'val': '市辖区'
        },
        {
            'code': '360902',
            'val': '袁州区'
        },
        {
            'code': '360921',
            'val': '奉新县'
        },
        {
            'code': '360922',
            'val': '万载县'
        },
        {
            'code': '360923',
            'val': '上高县'
        },
        {
            'code': '360924',
            'val': '宜丰县'
        },
        {
            'code': '360925',
            'val': '靖安县'
        },
        {
            'code': '360926',
            'val': '铜鼓县'
        },
        {
            'code': '360981',
            'val': '丰城市'
        },
        {
            'code': '360982',
            'val': '樟树市'
        },
        {
            'code': '360983',
            'val': '高安市'
        }
    ],
    '361000': [
        {
            'code': '361001',
            'val': '市辖区'
        },
        {
            'code': '361002',
            'val': '临川区'
        },
        {
            'code': '361021',
            'val': '南城县'
        },
        {
            'code': '361022',
            'val': '黎川县'
        },
        {
            'code': '361023',
            'val': '南丰县'
        },
        {
            'code': '361024',
            'val': '崇仁县'
        },
        {
            'code': '361025',
            'val': '乐安县'
        },
        {
            'code': '361026',
            'val': '宜黄县'
        },
        {
            'code': '361027',
            'val': '金溪县'
        },
        {
            'code': '361028',
            'val': '资溪县'
        },
        {
            'code': '361029',
            'val': '东乡县'
        },
        {
            'code': '361030',
            'val': '广昌县'
        }
    ],
    '361100': [
        {
            'code': '361101',
            'val': '市辖区'
        },
        {
            'code': '361102',
            'val': '信州区'
        },
        {
            'code': '361121',
            'val': '上饶县'
        },
        {
            'code': '361122',
            'val': '广丰县'
        },
        {
            'code': '361123',
            'val': '玉山县'
        },
        {
            'code': '361124',
            'val': '铅山县'
        },
        {
            'code': '361125',
            'val': '横峰县'
        },
        {
            'code': '361126',
            'val': '弋阳县'
        },
        {
            'code': '361127',
            'val': '余干县'
        },
        {
            'code': '361128',
            'val': '鄱阳县'
        },
        {
            'code': '361129',
            'val': '万年县'
        },
        {
            'code': '361130',
            'val': '婺源县'
        },
        {
            'code': '361181',
            'val': '德兴市'
        }
    ],
    '370100': [
        {
            'code': '370101',
            'val': '市辖区'
        },
        {
            'code': '370102',
            'val': '历下区'
        },
        {
            'code': '370103',
            'val': '市中区'
        },
        {
            'code': '370104',
            'val': '槐荫区'
        },
        {
            'code': '370105',
            'val': '天桥区'
        },
        {
            'code': '370112',
            'val': '历城区'
        },
        {
            'code': '370113',
            'val': '长清区'
        },
        {
            'code': '370124',
            'val': '平阴县'
        },
        {
            'code': '370125',
            'val': '济阳县'
        },
        {
            'code': '370126',
            'val': '商河县'
        },
        {
            'code': '370181',
            'val': '章丘市'
        }
    ],
    '370200': [
        {
            'code': '370201',
            'val': '市辖区'
        },
        {
            'code': '370202',
            'val': '市南区'
        },
        {
            'code': '370203',
            'val': '市北区'
        },
        {
            'code': '370205',
            'val': '四方区'
        },
        {
            'code': '370211',
            'val': '黄岛区'
        },
        {
            'code': '370212',
            'val': '崂山区'
        },
        {
            'code': '370213',
            'val': '李沧区'
        },
        {
            'code': '370214',
            'val': '城阳区'
        },
        {
            'code': '370281',
            'val': '胶州市'
        },
        {
            'code': '370282',
            'val': '即墨市'
        },
        {
            'code': '370283',
            'val': '平度市'
        },
        {
            'code': '370284',
            'val': '胶南市'
        },
        {
            'code': '370285',
            'val': '莱西市'
        }
    ],
    '370300': [
        {
            'code': '370301',
            'val': '市辖区'
        },
        {
            'code': '370302',
            'val': '淄川区'
        },
        {
            'code': '370303',
            'val': '张店区'
        },
        {
            'code': '370304',
            'val': '博山区'
        },
        {
            'code': '370305',
            'val': '临淄区'
        },
        {
            'code': '370306',
            'val': '周村区'
        },
        {
            'code': '370321',
            'val': '桓台县'
        },
        {
            'code': '370322',
            'val': '高青县'
        },
        {
            'code': '370323',
            'val': '沂源县'
        }
    ],
    '370400': [
        {
            'code': '370401',
            'val': '市辖区'
        },
        {
            'code': '370402',
            'val': '市中区'
        },
        {
            'code': '370403',
            'val': '薛城区'
        },
        {
            'code': '370404',
            'val': '峄城区'
        },
        {
            'code': '370405',
            'val': '台儿庄区'
        },
        {
            'code': '370406',
            'val': '山亭区'
        },
        {
            'code': '370481',
            'val': '滕州市'
        }
    ],
    '370500': [
        {
            'code': '370501',
            'val': '市辖区'
        },
        {
            'code': '370502',
            'val': '东营区'
        },
        {
            'code': '370503',
            'val': '河口区'
        },
        {
            'code': '370521',
            'val': '垦利县'
        },
        {
            'code': '370522',
            'val': '利津县'
        },
        {
            'code': '370523',
            'val': '广饶县'
        }
    ],
    '370600': [
        {
            'code': '370601',
            'val': '市辖区'
        },
        {
            'code': '370602',
            'val': '芝罘区'
        },
        {
            'code': '370611',
            'val': '福山区'
        },
        {
            'code': '370612',
            'val': '牟平区'
        },
        {
            'code': '370613',
            'val': '莱山区'
        },
        {
            'code': '370634',
            'val': '长岛县'
        },
        {
            'code': '370681',
            'val': '龙口市'
        },
        {
            'code': '370682',
            'val': '莱阳市'
        },
        {
            'code': '370683',
            'val': '莱州市'
        },
        {
            'code': '370684',
            'val': '蓬莱市'
        },
        {
            'code': '370685',
            'val': '招远市'
        },
        {
            'code': '370686',
            'val': '栖霞市'
        },
        {
            'code': '370687',
            'val': '海阳市'
        }
    ],
    '370700': [
        {
            'code': '370701',
            'val': '市辖区'
        },
        {
            'code': '370702',
            'val': '潍城区'
        },
        {
            'code': '370703',
            'val': '寒亭区'
        },
        {
            'code': '370704',
            'val': '坊子区'
        },
        {
            'code': '370705',
            'val': '奎文区'
        },
        {
            'code': '370724',
            'val': '临朐县'
        },
        {
            'code': '370725',
            'val': '昌乐县'
        },
        {
            'code': '370781',
            'val': '青州市'
        },
        {
            'code': '370782',
            'val': '诸城市'
        },
        {
            'code': '370783',
            'val': '寿光市'
        },
        {
            'code': '370784',
            'val': '安丘市'
        },
        {
            'code': '370785',
            'val': '高密市'
        },
        {
            'code': '370786',
            'val': '昌邑市'
        }
    ],
    '370800': [
        {
            'code': '370801',
            'val': '市辖区'
        },
        {
            'code': '370802',
            'val': '市中区'
        },
        {
            'code': '370811',
            'val': '任城区'
        },
        {
            'code': '370826',
            'val': '微山县'
        },
        {
            'code': '370827',
            'val': '鱼台县'
        },
        {
            'code': '370828',
            'val': '金乡县'
        },
        {
            'code': '370829',
            'val': '嘉祥县'
        },
        {
            'code': '370830',
            'val': '汶上县'
        },
        {
            'code': '370831',
            'val': '泗水县'
        },
        {
            'code': '370832',
            'val': '梁山县'
        },
        {
            'code': '370881',
            'val': '曲阜市'
        },
        {
            'code': '370882',
            'val': '兖州市'
        },
        {
            'code': '370883',
            'val': '邹城市'
        }
    ],
    '370900': [
        {
            'code': '370901',
            'val': '市辖区'
        },
        {
            'code': '370902',
            'val': '泰山区'
        },
        {
            'code': '370903',
            'val': '岱岳区'
        },
        {
            'code': '370921',
            'val': '宁阳县'
        },
        {
            'code': '370923',
            'val': '东平县'
        },
        {
            'code': '370982',
            'val': '新泰市'
        },
        {
            'code': '370983',
            'val': '肥城市'
        }
    ],
    '371000': [
        {
            'code': '371001',
            'val': '市辖区'
        },
        {
            'code': '371002',
            'val': '环翠区'
        },
        {
            'code': '371081',
            'val': '文登市'
        },
        {
            'code': '371082',
            'val': '荣成市'
        },
        {
            'code': '371083',
            'val': '乳山市'
        }
    ],
    '371100': [
        {
            'code': '371101',
            'val': '市辖区'
        },
        {
            'code': '371102',
            'val': '东港区'
        },
        {
            'code': '371121',
            'val': '五莲县'
        },
        {
            'code': '371122',
            'val': '莒县'
        }
    ],
    '371200': [
        {
            'code': '371201',
            'val': '市辖区'
        },
        {
            'code': '371202',
            'val': '莱城区'
        },
        {
            'code': '371203',
            'val': '钢城区'
        }
    ],
    '371300': [
        {
            'code': '371301',
            'val': '市辖区'
        },
        {
            'code': '371302',
            'val': '兰山区'
        },
        {
            'code': '371311',
            'val': '罗庄区'
        },
        {
            'code': '371312',
            'val': '河东区'
        },
        {
            'code': '371321',
            'val': '沂南县'
        },
        {
            'code': '371322',
            'val': '郯城县'
        },
        {
            'code': '371323',
            'val': '沂水县'
        },
        {
            'code': '371324',
            'val': '苍山县'
        },
        {
            'code': '371325',
            'val': '费县'
        },
        {
            'code': '371326',
            'val': '平邑县'
        },
        {
            'code': '371327',
            'val': '莒南县'
        },
        {
            'code': '371328',
            'val': '蒙阴县'
        },
        {
            'code': '371329',
            'val': '临沭县'
        }
    ],
    '371400': [
        {
            'code': '371401',
            'val': '市辖区'
        },
        {
            'code': '371402',
            'val': '德城区'
        },
        {
            'code': '371421',
            'val': '陵县'
        },
        {
            'code': '371422',
            'val': '宁津县'
        },
        {
            'code': '371423',
            'val': '庆云县'
        },
        {
            'code': '371424',
            'val': '临邑县'
        },
        {
            'code': '371425',
            'val': '齐河县'
        },
        {
            'code': '371426',
            'val': '平原县'
        },
        {
            'code': '371427',
            'val': '夏津县'
        },
        {
            'code': '371428',
            'val': '武城县'
        },
        {
            'code': '371481',
            'val': '乐陵市'
        },
        {
            'code': '371482',
            'val': '禹城市'
        }
    ],
    '371500': [
        {
            'code': '371501',
            'val': '市辖区'
        },
        {
            'code': '371502',
            'val': '东昌府区'
        },
        {
            'code': '371521',
            'val': '阳谷县'
        },
        {
            'code': '371522',
            'val': '莘县'
        },
        {
            'code': '371523',
            'val': '茌平县'
        },
        {
            'code': '371524',
            'val': '东阿县'
        },
        {
            'code': '371525',
            'val': '冠县'
        },
        {
            'code': '371526',
            'val': '高唐县'
        },
        {
            'code': '371581',
            'val': '临清市'
        }
    ],
    '371600': [
        {
            'code': '371601',
            'val': '市辖区'
        },
        {
            'code': '371602',
            'val': '滨城区'
        },
        {
            'code': '371621',
            'val': '惠民县'
        },
        {
            'code': '371622',
            'val': '阳信县'
        },
        {
            'code': '371623',
            'val': '无棣县'
        },
        {
            'code': '371624',
            'val': '沾化县'
        },
        {
            'code': '371625',
            'val': '博兴县'
        },
        {
            'code': '371626',
            'val': '邹平县'
        }
    ],
    '371700': [
        {
            'code': '371701',
            'val': '市辖区'
        },
        {
            'code': '371702',
            'val': '牡丹区'
        },
        {
            'code': '371721',
            'val': '曹县'
        },
        {
            'code': '371722',
            'val': '单县'
        },
        {
            'code': '371723',
            'val': '成武县'
        },
        {
            'code': '371724',
            'val': '巨野县'
        },
        {
            'code': '371725',
            'val': '郓城县'
        },
        {
            'code': '371726',
            'val': '鄄城县'
        },
        {
            'code': '371727',
            'val': '定陶县'
        },
        {
            'code': '371728',
            'val': '东明县'
        }
    ],
    '410100': [
        {
            'code': '410101',
            'val': '市辖区'
        },
        {
            'code': '410102',
            'val': '中原区'
        },
        {
            'code': '410103',
            'val': '二七区'
        },
        {
            'code': '410104',
            'val': '管城回族区'
        },
        {
            'code': '410105',
            'val': '金水区'
        },
        {
            'code': '410106',
            'val': '上街区'
        },
        {
            'code': '410108',
            'val': '邙山区'
        },
        {
            'code': '410122',
            'val': '中牟县'
        },
        {
            'code': '410181',
            'val': '巩义市'
        },
        {
            'code': '410182',
            'val': '荥阳市'
        },
        {
            'code': '410183',
            'val': '新密市'
        },
        {
            'code': '410184',
            'val': '新郑市'
        },
        {
            'code': '410185',
            'val': '登封市'
        }
    ],
    '410200': [
        {
            'code': '410201',
            'val': '市辖区'
        },
        {
            'code': '410202',
            'val': '龙亭区'
        },
        {
            'code': '410203',
            'val': '顺河回族区'
        },
        {
            'code': '410204',
            'val': '鼓楼区'
        },
        {
            'code': '410205',
            'val': '南关区'
        },
        {
            'code': '410211',
            'val': '郊区'
        },
        {
            'code': '410221',
            'val': '杞县'
        },
        {
            'code': '410222',
            'val': '通许县'
        },
        {
            'code': '410223',
            'val': '尉氏县'
        },
        {
            'code': '410224',
            'val': '开封县'
        },
        {
            'code': '410225',
            'val': '兰考县'
        }
    ],
    '410300': [
        {
            'code': '410301',
            'val': '市辖区'
        },
        {
            'code': '410302',
            'val': '老城区'
        },
        {
            'code': '410303',
            'val': '西工区'
        },
        {
            'code': '410304',
            'val': '廛河回族区'
        },
        {
            'code': '410305',
            'val': '涧西区'
        },
        {
            'code': '410306',
            'val': '吉利区'
        },
        {
            'code': '410307',
            'val': '洛龙区'
        },
        {
            'code': '410322',
            'val': '孟津县'
        },
        {
            'code': '410323',
            'val': '新安县'
        },
        {
            'code': '410324',
            'val': '栾川县'
        },
        {
            'code': '410325',
            'val': '嵩县'
        },
        {
            'code': '410326',
            'val': '汝阳县'
        },
        {
            'code': '410327',
            'val': '宜阳县'
        },
        {
            'code': '410328',
            'val': '洛宁县'
        },
        {
            'code': '410329',
            'val': '伊川县'
        },
        {
            'code': '410381',
            'val': '偃师市'
        }
    ],
    '410400': [
        {
            'code': '410401',
            'val': '市辖区'
        },
        {
            'code': '410402',
            'val': '新华区'
        },
        {
            'code': '410403',
            'val': '卫东区'
        },
        {
            'code': '410404',
            'val': '石龙区'
        },
        {
            'code': '410411',
            'val': '湛河区'
        },
        {
            'code': '410421',
            'val': '宝丰县'
        },
        {
            'code': '410422',
            'val': '叶县'
        },
        {
            'code': '410423',
            'val': '鲁山县'
        },
        {
            'code': '410425',
            'val': '郏县'
        },
        {
            'code': '410481',
            'val': '舞钢市'
        },
        {
            'code': '410482',
            'val': '汝州市'
        }
    ],
    '410500': [
        {
            'code': '410501',
            'val': '市辖区'
        },
        {
            'code': '410502',
            'val': '文峰区'
        },
        {
            'code': '410503',
            'val': '北关区'
        },
        {
            'code': '410505',
            'val': '殷都区'
        },
        {
            'code': '410506',
            'val': '龙安区'
        },
        {
            'code': '410522',
            'val': '安阳县'
        },
        {
            'code': '410523',
            'val': '汤阴县'
        },
        {
            'code': '410526',
            'val': '滑县'
        },
        {
            'code': '410527',
            'val': '内黄县'
        },
        {
            'code': '410581',
            'val': '林州市'
        }
    ],
    '410600': [
        {
            'code': '410601',
            'val': '市辖区'
        },
        {
            'code': '410602',
            'val': '鹤山区'
        },
        {
            'code': '410603',
            'val': '山城区'
        },
        {
            'code': '410611',
            'val': '淇滨区'
        },
        {
            'code': '410621',
            'val': '浚县'
        },
        {
            'code': '410622',
            'val': '淇县'
        }
    ],
    '410700': [
        {
            'code': '410701',
            'val': '市辖区'
        },
        {
            'code': '410702',
            'val': '红旗区'
        },
        {
            'code': '410703',
            'val': '卫滨区'
        },
        {
            'code': '410704',
            'val': '凤泉区'
        },
        {
            'code': '410711',
            'val': '牧野区'
        },
        {
            'code': '410721',
            'val': '新乡县'
        },
        {
            'code': '410724',
            'val': '获嘉县'
        },
        {
            'code': '410725',
            'val': '原阳县'
        },
        {
            'code': '410726',
            'val': '延津县'
        },
        {
            'code': '410727',
            'val': '封丘县'
        },
        {
            'code': '410728',
            'val': '长垣县'
        },
        {
            'code': '410781',
            'val': '卫辉市'
        },
        {
            'code': '410782',
            'val': '辉县市'
        }
    ],
    '410800': [
        {
            'code': '410801',
            'val': '市辖区'
        },
        {
            'code': '410802',
            'val': '解放区'
        },
        {
            'code': '410803',
            'val': '中站区'
        },
        {
            'code': '410804',
            'val': '马村区'
        },
        {
            'code': '410811',
            'val': '山阳区'
        },
        {
            'code': '410821',
            'val': '修武县'
        },
        {
            'code': '410822',
            'val': '博爱县'
        },
        {
            'code': '410823',
            'val': '武陟县'
        },
        {
            'code': '410825',
            'val': '温县'
        },
        {
            'code': '410881',
            'val': '济源市'
        },
        {
            'code': '410882',
            'val': '沁阳市'
        },
        {
            'code': '410883',
            'val': '孟州市'
        }
    ],
    '410900': [
        {
            'code': '410901',
            'val': '市辖区'
        },
        {
            'code': '410902',
            'val': '华龙区'
        },
        {
            'code': '410922',
            'val': '清丰县'
        },
        {
            'code': '410923',
            'val': '南乐县'
        },
        {
            'code': '410926',
            'val': '范县'
        },
        {
            'code': '410927',
            'val': '台前县'
        },
        {
            'code': '410928',
            'val': '濮阳县'
        }
    ],
    '411000': [
        {
            'code': '411001',
            'val': '市辖区'
        },
        {
            'code': '411002',
            'val': '魏都区'
        },
        {
            'code': '411023',
            'val': '许昌县'
        },
        {
            'code': '411024',
            'val': '鄢陵县'
        },
        {
            'code': '411025',
            'val': '襄城县'
        },
        {
            'code': '411081',
            'val': '禹州市'
        },
        {
            'code': '411082',
            'val': '长葛市'
        }
    ],
    '411100': [
        {
            'code': '411101',
            'val': '市辖区'
        },
        {
            'code': '411102',
            'val': '源汇区'
        },
        {
            'code': '411121',
            'val': '舞阳县'
        },
        {
            'code': '411122',
            'val': '临颍县'
        },
        {
            'code': '411123',
            'val': '郾城县'
        }
    ],
    '411200': [
        {
            'code': '411201',
            'val': '市辖区'
        },
        {
            'code': '411202',
            'val': '湖滨区'
        },
        {
            'code': '411221',
            'val': '渑池县'
        },
        {
            'code': '411222',
            'val': '陕县'
        },
        {
            'code': '411224',
            'val': '卢氏县'
        },
        {
            'code': '411281',
            'val': '义马市'
        },
        {
            'code': '411282',
            'val': '灵宝市'
        }
    ],
    '411300': [
        {
            'code': '411301',
            'val': '市辖区'
        },
        {
            'code': '411302',
            'val': '宛城区'
        },
        {
            'code': '411303',
            'val': '卧龙区'
        },
        {
            'code': '411321',
            'val': '南召县'
        },
        {
            'code': '411322',
            'val': '方城县'
        },
        {
            'code': '411323',
            'val': '西峡县'
        },
        {
            'code': '411324',
            'val': '镇平县'
        },
        {
            'code': '411325',
            'val': '内乡县'
        },
        {
            'code': '411326',
            'val': '淅川县'
        },
        {
            'code': '411327',
            'val': '社旗县'
        },
        {
            'code': '411328',
            'val': '唐河县'
        },
        {
            'code': '411329',
            'val': '新野县'
        },
        {
            'code': '411330',
            'val': '桐柏县'
        },
        {
            'code': '411381',
            'val': '邓州市'
        }
    ],
    '411400': [
        {
            'code': '411401',
            'val': '市辖区'
        },
        {
            'code': '411402',
            'val': '梁园区'
        },
        {
            'code': '411403',
            'val': '睢阳区'
        },
        {
            'code': '411421',
            'val': '民权县'
        },
        {
            'code': '411422',
            'val': '睢县'
        },
        {
            'code': '411423',
            'val': '宁陵县'
        },
        {
            'code': '411424',
            'val': '柘城县'
        },
        {
            'code': '411425',
            'val': '虞城县'
        },
        {
            'code': '411426',
            'val': '夏邑县'
        },
        {
            'code': '411481',
            'val': '永城市'
        }
    ],
    '411500': [
        {
            'code': '411501',
            'val': '市辖区'
        },
        {
            'code': '411502',
            'val': '师河区'
        },
        {
            'code': '411503',
            'val': '平桥区'
        },
        {
            'code': '411521',
            'val': '罗山县'
        },
        {
            'code': '411522',
            'val': '光山县'
        },
        {
            'code': '411523',
            'val': '新县'
        },
        {
            'code': '411524',
            'val': '商城县'
        },
        {
            'code': '411525',
            'val': '固始县'
        },
        {
            'code': '411526',
            'val': '潢川县'
        },
        {
            'code': '411527',
            'val': '淮滨县'
        },
        {
            'code': '411528',
            'val': '息县'
        }
    ],
    '411600': [
        {
            'code': '411601',
            'val': '市辖区'
        },
        {
            'code': '411602',
            'val': '川汇区'
        },
        {
            'code': '411621',
            'val': '扶沟县'
        },
        {
            'code': '411622',
            'val': '西华县'
        },
        {
            'code': '411623',
            'val': '商水县'
        },
        {
            'code': '411624',
            'val': '沈丘县'
        },
        {
            'code': '411625',
            'val': '郸城县'
        },
        {
            'code': '411626',
            'val': '淮阳县'
        },
        {
            'code': '411627',
            'val': '太康县'
        },
        {
            'code': '411628',
            'val': '鹿邑县'
        },
        {
            'code': '411681',
            'val': '项城市'
        }
    ],
    '411700': [
        {
            'code': '411701',
            'val': '市辖区'
        },
        {
            'code': '411702',
            'val': '驿城区'
        },
        {
            'code': '411721',
            'val': '西平县'
        },
        {
            'code': '411722',
            'val': '上蔡县'
        },
        {
            'code': '411723',
            'val': '平舆县'
        },
        {
            'code': '411724',
            'val': '正阳县'
        },
        {
            'code': '411725',
            'val': '确山县'
        },
        {
            'code': '411726',
            'val': '泌阳县'
        },
        {
            'code': '411727',
            'val': '汝南县'
        },
        {
            'code': '411728',
            'val': '遂平县'
        },
        {
            'code': '411729',
            'val': '新蔡县'
        }
    ],
    '420100': [
        {
            'code': '420102',
            'val': '江岸区'
        },
        {
            'code': '420103',
            'val': '江汉区'
        },
        {
            'code': '420104',
            'val': '乔口区'
        },
        {
            'code': '420105',
            'val': '汉阳区'
        },
        {
            'code': '420106',
            'val': '武昌区'
        },
        {
            'code': '420107',
            'val': '青山区'
        },
        {
            'code': '420111',
            'val': '洪山区'
        },
        {
            'code': '420112',
            'val': '东西湖区'
        },
        {
            'code': '420113',
            'val': '汉南区'
        },
        {
            'code': '420114',
            'val': '蔡甸区'
        },
        {
            'code': '420115',
            'val': '江夏区'
        },
        {
            'code': '420116',
            'val': '黄陂区'
        },
        {
            'code': '420117',
            'val': '新洲区'
        }
    ],
    '420200': [
        {
            'code': '420201',
            'val': '市辖区'
        },
        {
            'code': '420202',
            'val': '黄石港区'
        },
        {
            'code': '420203',
            'val': '西塞山区'
        },
        {
            'code': '420204',
            'val': '下陆区'
        },
        {
            'code': '420205',
            'val': '铁山区'
        },
        {
            'code': '420222',
            'val': '阳新县'
        },
        {
            'code': '420281',
            'val': '大冶市'
        }
    ],
    '420300': [
        {
            'code': '420301',
            'val': '市辖区'
        },
        {
            'code': '420302',
            'val': '茅箭区'
        },
        {
            'code': '420303',
            'val': '张湾区'
        },
        {
            'code': '420321',
            'val': '郧县'
        },
        {
            'code': '420322',
            'val': '郧西县'
        },
        {
            'code': '420323',
            'val': '竹山县'
        },
        {
            'code': '420324',
            'val': '竹溪县'
        },
        {
            'code': '420325',
            'val': '房县'
        },
        {
            'code': '420381',
            'val': '丹江口市'
        }
    ],
    '420500': [
        {
            'code': '420501',
            'val': '市辖区'
        },
        {
            'code': '420502',
            'val': '西陵区'
        },
        {
            'code': '420503',
            'val': '伍家岗区'
        },
        {
            'code': '420504',
            'val': '点军区'
        },
        {
            'code': '420505',
            'val': '虎亭区'
        },
        {
            'code': '420506',
            'val': '夷陵区'
        },
        {
            'code': '420525',
            'val': '远安县'
        },
        {
            'code': '420526',
            'val': '兴山县'
        },
        {
            'code': '420527',
            'val': '秭归县'
        },
        {
            'code': '420528',
            'val': '长阳土家族自治县'
        },
        {
            'code': '420529',
            'val': '五峰土家族自治县'
        },
        {
            'code': '420581',
            'val': '宜都市'
        },
        {
            'code': '420582',
            'val': '当阳市'
        },
        {
            'code': '420583',
            'val': '枝江市'
        }
    ],
    '420600': [
        {
            'code': '420601',
            'val': '市辖区'
        },
        {
            'code': '420602',
            'val': '襄城区'
        },
        {
            'code': '420606',
            'val': '樊城区'
        },
        {
            'code': '420607',
            'val': '襄阳区'
        },
        {
            'code': '420624',
            'val': '南漳县'
        },
        {
            'code': '420625',
            'val': '谷城县'
        },
        {
            'code': '420626',
            'val': '保康县'
        },
        {
            'code': '420682',
            'val': '老河口市'
        },
        {
            'code': '420683',
            'val': '枣阳市'
        },
        {
            'code': '420684',
            'val': '宜城市'
        }
    ],
    '420700': [
        {
            'code': '420701',
            'val': '市辖区'
        },
        {
            'code': '420702',
            'val': '梁子湖区'
        },
        {
            'code': '420703',
            'val': '华容区'
        },
        {
            'code': '420704',
            'val': '鄂城区'
        }
    ],
    '420800': [
        {
            'code': '420801',
            'val': '市辖区'
        },
        {
            'code': '420802',
            'val': '东宝区'
        },
        {
            'code': '420804',
            'val': '掇刀区'
        },
        {
            'code': '420821',
            'val': '京山县'
        },
        {
            'code': '420822',
            'val': '沙洋县'
        },
        {
            'code': '420881',
            'val': '钟祥市'
        }
    ],
    '420900': [
        {
            'code': '420901',
            'val': '市辖区'
        },
        {
            'code': '420902',
            'val': '孝南区'
        },
        {
            'code': '420921',
            'val': '孝昌县'
        },
        {
            'code': '420922',
            'val': '大悟县'
        },
        {
            'code': '420923',
            'val': '云梦县'
        },
        {
            'code': '420981',
            'val': '应城市'
        },
        {
            'code': '420982',
            'val': '安陆市'
        },
        {
            'code': '420984',
            'val': '汉川市'
        }
    ],
    '421000': [
        {
            'code': '421001',
            'val': '市辖区'
        },
        {
            'code': '421002',
            'val': '沙市区'
        },
        {
            'code': '421003',
            'val': '荆州区'
        },
        {
            'code': '421022',
            'val': '公安县'
        },
        {
            'code': '421023',
            'val': '监利县'
        },
        {
            'code': '421024',
            'val': '江陵县'
        },
        {
            'code': '421081',
            'val': '石首市'
        },
        {
            'code': '421083',
            'val': '洪湖市'
        },
        {
            'code': '421087',
            'val': '松滋市'
        }
    ],
    '421100': [
        {
            'code': '421101',
            'val': '市辖区'
        },
        {
            'code': '421102',
            'val': '黄州区'
        },
        {
            'code': '421121',
            'val': '团风县'
        },
        {
            'code': '421122',
            'val': '红安县'
        },
        {
            'code': '421123',
            'val': '罗田县'
        },
        {
            'code': '421124',
            'val': '英山县'
        },
        {
            'code': '421125',
            'val': '浠水县'
        },
        {
            'code': '421126',
            'val': '蕲春县'
        },
        {
            'code': '421127',
            'val': '黄梅县'
        },
        {
            'code': '421181',
            'val': '麻城市'
        },
        {
            'code': '421182',
            'val': '武穴市'
        }
    ],
    '421200': [
        {
            'code': '421201',
            'val': '市辖区'
        },
        {
            'code': '421202',
            'val': '咸安区'
        },
        {
            'code': '421221',
            'val': '嘉鱼县'
        },
        {
            'code': '421222',
            'val': '通城县'
        },
        {
            'code': '421223',
            'val': '崇阳县'
        },
        {
            'code': '421224',
            'val': '通山县'
        },
        {
            'code': '421281',
            'val': '赤壁市'
        }
    ],
    '421300': [
        {
            'code': '421302',
            'val': '曾都区'
        },
        {
            'code': '421381',
            'val': '广水市'
        }
    ],
    '422800': [
        {
            'code': '422801',
            'val': '恩施市'
        },
        {
            'code': '422802',
            'val': '利川市'
        },
        {
            'code': '422822',
            'val': '建始县'
        },
        {
            'code': '422823',
            'val': '巴东县'
        },
        {
            'code': '422825',
            'val': '宣恩县'
        },
        {
            'code': '422826',
            'val': '咸丰县'
        },
        {
            'code': '422827',
            'val': '来凤县'
        },
        {
            'code': '422828',
            'val': '鹤峰县'
        }
    ],
    '429000': [
        {
            'code': '429004',
            'val': '仙桃市'
        },
        {
            'code': '429005',
            'val': '潜江市'
        },
        {
            'code': '429006',
            'val': '天门市'
        },
        {
            'code': '429021',
            'val': '神农架林区'
        }
    ],
    '430100': [
        {
            'code': '430101',
            'val': '市辖区'
        },
        {
            'code': '430102',
            'val': '芙蓉区'
        },
        {
            'code': '430103',
            'val': '天心区'
        },
        {
            'code': '430104',
            'val': '岳麓区'
        },
        {
            'code': '430105',
            'val': '开福区'
        },
        {
            'code': '430111',
            'val': '雨花区'
        },
        {
            'code': '430121',
            'val': '长沙县'
        },
        {
            'code': '430122',
            'val': '望城县'
        },
        {
            'code': '430124',
            'val': '宁乡县'
        },
        {
            'code': '430181',
            'val': '浏阳市'
        }
    ],
    '430200': [
        {
            'code': '430201',
            'val': '市辖区'
        },
        {
            'code': '430202',
            'val': '荷塘区'
        },
        {
            'code': '430203',
            'val': '芦淞区'
        },
        {
            'code': '430204',
            'val': '石峰区'
        },
        {
            'code': '430211',
            'val': '天元区'
        },
        {
            'code': '430221',
            'val': '株洲县'
        },
        {
            'code': '430223',
            'val': '攸县'
        },
        {
            'code': '430224',
            'val': '茶陵县'
        },
        {
            'code': '430225',
            'val': '炎陵县'
        },
        {
            'code': '430281',
            'val': '醴陵市'
        }
    ],
    '430300': [
        {
            'code': '430301',
            'val': '市辖区'
        },
        {
            'code': '430302',
            'val': '雨湖区'
        },
        {
            'code': '430304',
            'val': '岳塘区'
        },
        {
            'code': '430321',
            'val': '湘潭县'
        },
        {
            'code': '430381',
            'val': '湘乡市'
        },
        {
            'code': '430382',
            'val': '韶山市'
        }
    ],
    '430400': [
        {
            'code': '430401',
            'val': '市辖区'
        },
        {
            'code': '430405',
            'val': '珠晖区'
        },
        {
            'code': '430406',
            'val': '雁峰区'
        },
        {
            'code': '430407',
            'val': '石鼓区'
        },
        {
            'code': '430408',
            'val': '蒸湘区'
        },
        {
            'code': '430412',
            'val': '南岳区'
        },
        {
            'code': '430421',
            'val': '衡阳县'
        },
        {
            'code': '430422',
            'val': '衡南县'
        },
        {
            'code': '430423',
            'val': '衡山县'
        },
        {
            'code': '430424',
            'val': '衡东县'
        },
        {
            'code': '430426',
            'val': '祁东县'
        },
        {
            'code': '430481',
            'val': '耒阳市'
        },
        {
            'code': '430482',
            'val': '常宁市'
        }
    ],
    '430500': [
        {
            'code': '430501',
            'val': '市辖区'
        },
        {
            'code': '430502',
            'val': '双清区'
        },
        {
            'code': '430503',
            'val': '大祥区'
        },
        {
            'code': '430511',
            'val': '北塔区'
        },
        {
            'code': '430521',
            'val': '邵东县'
        },
        {
            'code': '430522',
            'val': '新邵县'
        },
        {
            'code': '430523',
            'val': '邵阳县'
        },
        {
            'code': '430524',
            'val': '隆回县'
        },
        {
            'code': '430525',
            'val': '洞口县'
        },
        {
            'code': '430527',
            'val': '绥宁县'
        },
        {
            'code': '430528',
            'val': '新宁县'
        },
        {
            'code': '430529',
            'val': '城步苗族自治县'
        },
        {
            'code': '430581',
            'val': '武冈市'
        }
    ],
    '430600': [
        {
            'code': '430601',
            'val': '市辖区'
        },
        {
            'code': '430602',
            'val': '岳阳楼区'
        },
        {
            'code': '430603',
            'val': '云溪区'
        },
        {
            'code': '430611',
            'val': '君山区'
        },
        {
            'code': '430621',
            'val': '岳阳县'
        },
        {
            'code': '430623',
            'val': '华容县'
        },
        {
            'code': '430624',
            'val': '湘阴县'
        },
        {
            'code': '430626',
            'val': '平江县'
        },
        {
            'code': '430681',
            'val': '汨罗市'
        },
        {
            'code': '430682',
            'val': '临湘市'
        }
    ],
    '430700': [
        {
            'code': '430701',
            'val': '市辖区'
        },
        {
            'code': '430702',
            'val': '武陵区'
        },
        {
            'code': '430703',
            'val': '鼎城区'
        },
        {
            'code': '430721',
            'val': '安乡县'
        },
        {
            'code': '430722',
            'val': '汉寿县'
        },
        {
            'code': '430723',
            'val': '澧县'
        },
        {
            'code': '430724',
            'val': '临澧县'
        },
        {
            'code': '430725',
            'val': '桃源县'
        },
        {
            'code': '430726',
            'val': '石门县'
        },
        {
            'code': '430781',
            'val': '津市市'
        }
    ],
    '430800': [
        {
            'code': '430801',
            'val': '市辖区'
        },
        {
            'code': '430802',
            'val': '永定区'
        },
        {
            'code': '430811',
            'val': '武陵源区'
        },
        {
            'code': '430821',
            'val': '慈利县'
        },
        {
            'code': '430822',
            'val': '桑植县'
        }
    ],
    '430900': [
        {
            'code': '430901',
            'val': '市辖区'
        },
        {
            'code': '430902',
            'val': '资阳区'
        },
        {
            'code': '430903',
            'val': '赫山区'
        },
        {
            'code': '430921',
            'val': '南县'
        },
        {
            'code': '430922',
            'val': '桃江县'
        },
        {
            'code': '430923',
            'val': '安化县'
        },
        {
            'code': '430981',
            'val': '沅江市'
        }
    ],
    '431000': [
        {
            'code': '431001',
            'val': '市辖区'
        },
        {
            'code': '431002',
            'val': '北湖区'
        },
        {
            'code': '431003',
            'val': '苏仙区'
        },
        {
            'code': '431021',
            'val': '桂阳县'
        },
        {
            'code': '431022',
            'val': '宜章县'
        },
        {
            'code': '431023',
            'val': '永兴县'
        },
        {
            'code': '431024',
            'val': '嘉禾县'
        },
        {
            'code': '431025',
            'val': '临武县'
        },
        {
            'code': '431026',
            'val': '汝城县'
        },
        {
            'code': '431027',
            'val': '桂东县'
        },
        {
            'code': '431028',
            'val': '安仁县'
        },
        {
            'code': '431081',
            'val': '资兴市'
        }
    ],
    '431100': [
        {
            'code': '431101',
            'val': '市辖区'
        },
        {
            'code': '431102',
            'val': '芝山区'
        },
        {
            'code': '431103',
            'val': '冷水滩区'
        },
        {
            'code': '431121',
            'val': '祁阳县'
        },
        {
            'code': '431122',
            'val': '东安县'
        },
        {
            'code': '431123',
            'val': '双牌县'
        },
        {
            'code': '431124',
            'val': '道县'
        },
        {
            'code': '431125',
            'val': '江永县'
        },
        {
            'code': '431126',
            'val': '宁远县'
        },
        {
            'code': '431127',
            'val': '蓝山县'
        },
        {
            'code': '431128',
            'val': '新田县'
        },
        {
            'code': '431129',
            'val': '江华瑶族自治县'
        }
    ],
    '431200': [
        {
            'code': '431201',
            'val': '市辖区'
        },
        {
            'code': '431202',
            'val': '鹤城区'
        },
        {
            'code': '431221',
            'val': '中方县'
        },
        {
            'code': '431222',
            'val': '沅陵县'
        },
        {
            'code': '431223',
            'val': '辰溪县'
        },
        {
            'code': '431224',
            'val': '溆浦县'
        },
        {
            'code': '431225',
            'val': '会同县'
        },
        {
            'code': '431226',
            'val': '麻阳苗族自治县'
        },
        {
            'code': '431227',
            'val': '新晃侗族自治县'
        },
        {
            'code': '431228',
            'val': '芷江侗族自治县'
        },
        {
            'code': '431229',
            'val': '靖州苗族侗族自治县'
        },
        {
            'code': '431230',
            'val': '通道侗族自治县'
        },
        {
            'code': '431281',
            'val': '洪江市'
        }
    ],
    '431300': [
        {
            'code': '431301',
            'val': '市辖区'
        },
        {
            'code': '431302',
            'val': '娄星区'
        },
        {
            'code': '431321',
            'val': '双峰县'
        },
        {
            'code': '431322',
            'val': '新化县'
        },
        {
            'code': '431381',
            'val': '冷水江市'
        },
        {
            'code': '431382',
            'val': '涟源市'
        }
    ],
    '433100': [
        {
            'code': '433101',
            'val': '吉首市'
        },
        {
            'code': '433122',
            'val': '泸溪县'
        },
        {
            'code': '433123',
            'val': '凤凰县'
        },
        {
            'code': '433124',
            'val': '花垣县'
        },
        {
            'code': '433125',
            'val': '保靖县'
        },
        {
            'code': '433126',
            'val': '古丈县'
        },
        {
            'code': '433127',
            'val': '永顺县'
        },
        {
            'code': '433130',
            'val': '龙山县'
        }
    ],
    '440100': [
        {
            'code': '440101',
            'val': '市辖区'
        },
        {
            'code': '440102',
            'val': '南沙区'
        },
        {
            'code': '440103',
            'val': '荔湾区'
        },
        {
            'code': '440104',
            'val': '越秀区'
        },
        {
            'code': '440105',
            'val': '海珠区'
        },
        {
            'code': '440106',
            'val': '天河区'
        },
        {
            'code': '440107',
            'val': '萝岗区'
        },
        {
            'code': '440111',
            'val': '白云区'
        },
        {
            'code': '440112',
            'val': '黄埔区'
        },
        {
            'code': '440113',
            'val': '番禺区'
        },
        {
            'code': '440114',
            'val': '花都区'
        },
        {
            'code': '440183',
            'val': '增城市'
        },
        {
            'code': '440184',
            'val': '从化市'
        }
    ],
    '440200': [
        {
            'code': '440201',
            'val': '市辖区'
        },
        {
            'code': '440202',
            'val': '北江区'
        },
        {
            'code': '440203',
            'val': '武江区'
        },
        {
            'code': '440204',
            'val': '浈江区'
        },
        {
            'code': '440221',
            'val': '曲江县'
        },
        {
            'code': '440222',
            'val': '始兴县'
        },
        {
            'code': '440224',
            'val': '仁化县'
        },
        {
            'code': '440229',
            'val': '翁源县'
        },
        {
            'code': '440232',
            'val': '乳源瑶族自治县'
        },
        {
            'code': '440233',
            'val': '新丰县'
        },
        {
            'code': '440281',
            'val': '乐昌市'
        },
        {
            'code': '440282',
            'val': '南雄市'
        }
    ],
    '440300': [
        {
            'code': '440301',
            'val': '市辖区'
        },
        {
            'code': '440303',
            'val': '罗湖区'
        },
        {
            'code': '440304',
            'val': '福田区'
        },
        {
            'code': '440305',
            'val': '南山区'
        },
        {
            'code': '440306',
            'val': '宝安区'
        },
        {
            'code': '440307',
            'val': '龙岗区'
        },
        {
            'code': '440308',
            'val': '盐田区'
        }
    ],
    '440400': [
        {
            'code': '440401',
            'val': '市辖区'
        },
        {
            'code': '440402',
            'val': '香洲区'
        },
        {
            'code': '440403',
            'val': '斗门区'
        },
        {
            'code': '440404',
            'val': '金湾区'
        }
    ],
    '440500': [
        {
            'code': '440501',
            'val': '市辖区'
        },
        {
            'code': '440507',
            'val': '龙湖区'
        },
        {
            'code': '440511',
            'val': '金平区'
        },
        {
            'code': '440512',
            'val': '濠江区'
        },
        {
            'code': '440513',
            'val': '潮阳区'
        },
        {
            'code': '440514',
            'val': '潮南区'
        },
        {
            'code': '440515',
            'val': '澄海区'
        },
        {
            'code': '440523',
            'val': '南澳县'
        }
    ],
    '440600': [
        {
            'code': '440601',
            'val': '市辖区'
        },
        {
            'code': '440604',
            'val': '禅城区'
        },
        {
            'code': '440605',
            'val': '南海区'
        },
        {
            'code': '440606',
            'val': '顺德区'
        },
        {
            'code': '440607',
            'val': '三水区'
        },
        {
            'code': '440608',
            'val': '高明区'
        }
    ],
    '440700': [
        {
            'code': '440701',
            'val': '市辖区'
        },
        {
            'code': '440703',
            'val': '蓬江区'
        },
        {
            'code': '440704',
            'val': '江海区'
        },
        {
            'code': '440705',
            'val': '新会区'
        },
        {
            'code': '440781',
            'val': '台山市'
        },
        {
            'code': '440783',
            'val': '开平市'
        },
        {
            'code': '440784',
            'val': '鹤山市'
        },
        {
            'code': '440785',
            'val': '恩平市'
        }
    ],
    '440800': [
        {
            'code': '440801',
            'val': '市辖区'
        },
        {
            'code': '440802',
            'val': '赤坎区'
        },
        {
            'code': '440803',
            'val': '霞山区'
        },
        {
            'code': '440804',
            'val': '坡头区'
        },
        {
            'code': '440811',
            'val': '麻章区'
        },
        {
            'code': '440823',
            'val': '遂溪县'
        },
        {
            'code': '440825',
            'val': '徐闻县'
        },
        {
            'code': '440881',
            'val': '廉江市'
        },
        {
            'code': '440882',
            'val': '雷州市'
        },
        {
            'code': '440883',
            'val': '吴川市'
        }
    ],
    '440900': [
        {
            'code': '440901',
            'val': '市辖区'
        },
        {
            'code': '440902',
            'val': '茂南区'
        },
        {
            'code': '440903',
            'val': '茂港区'
        },
        {
            'code': '440923',
            'val': '电白县'
        },
        {
            'code': '440981',
            'val': '高州市'
        },
        {
            'code': '440982',
            'val': '化州市'
        },
        {
            'code': '440983',
            'val': '信宜市'
        }
    ],
    '441200': [
        {
            'code': '441201',
            'val': '市辖区'
        },
        {
            'code': '441202',
            'val': '端州区'
        },
        {
            'code': '441203',
            'val': '鼎湖区'
        },
        {
            'code': '441223',
            'val': '广宁县'
        },
        {
            'code': '441224',
            'val': '怀集县'
        },
        {
            'code': '441225',
            'val': '封开县'
        },
        {
            'code': '441226',
            'val': '德庆县'
        },
        {
            'code': '441283',
            'val': '高要市'
        },
        {
            'code': '441284',
            'val': '四会市'
        }
    ],
    '441300': [
        {
            'code': '441301',
            'val': '市辖区'
        },
        {
            'code': '441302',
            'val': '惠城区'
        },
        {
            'code': '441303',
            'val': '惠阳区'
        },
        {
            'code': '441322',
            'val': '博罗县'
        },
        {
            'code': '441323',
            'val': '惠东县'
        },
        {
            'code': '441324',
            'val': '龙门县'
        }
    ],
    '441400': [
        {
            'code': '441401',
            'val': '市辖区'
        },
        {
            'code': '441402',
            'val': '梅江区'
        },
        {
            'code': '441421',
            'val': '梅县'
        },
        {
            'code': '441422',
            'val': '大埔县'
        },
        {
            'code': '441423',
            'val': '丰顺县'
        },
        {
            'code': '441424',
            'val': '五华县'
        },
        {
            'code': '441426',
            'val': '平远县'
        },
        {
            'code': '441427',
            'val': '蕉岭县'
        },
        {
            'code': '441481',
            'val': '兴宁市'
        }
    ],
    '441500': [
        {
            'code': '441501',
            'val': '市辖区'
        },
        {
            'code': '441502',
            'val': '城区'
        },
        {
            'code': '441521',
            'val': '海丰县'
        },
        {
            'code': '441523',
            'val': '陆河县'
        },
        {
            'code': '441581',
            'val': '陆丰市'
        }
    ],
    '441600': [
        {
            'code': '441601',
            'val': '市辖区'
        },
        {
            'code': '441602',
            'val': '源城区'
        },
        {
            'code': '441621',
            'val': '紫金县'
        },
        {
            'code': '441622',
            'val': '龙川县'
        },
        {
            'code': '441623',
            'val': '连平县'
        },
        {
            'code': '441624',
            'val': '和平县'
        },
        {
            'code': '441625',
            'val': '东源县'
        }
    ],
    '441700': [
        {
            'code': '441701',
            'val': '市辖区'
        },
        {
            'code': '441702',
            'val': '江城区'
        },
        {
            'code': '441721',
            'val': '阳西县'
        },
        {
            'code': '441723',
            'val': '阳东县'
        },
        {
            'code': '441781',
            'val': '阳春市'
        }
    ],
    '441800': [
        {
            'code': '441801',
            'val': '市辖区'
        },
        {
            'code': '441802',
            'val': '清城区'
        },
        {
            'code': '441821',
            'val': '佛冈县'
        },
        {
            'code': '441823',
            'val': '阳山县'
        },
        {
            'code': '441825',
            'val': '连山壮族瑶族自治县'
        },
        {
            'code': '441826',
            'val': '连南瑶族自治县'
        },
        {
            'code': '441827',
            'val': '清新县'
        },
        {
            'code': '441881',
            'val': '英德市'
        },
        {
            'code': '441882',
            'val': '连州市'
        }
    ],
    '441900': [
        {
            'code': '441901',
            'val': '莞城区'
        },
        {
            'code': '441902',
            'val': '东城区'
        },
        {
            'code': '441903',
            'val': '南城区'
        },
        {
            'code': '441904',
            'val': '万江区'
        },
        {
            'code': '441905',
            'val': '麻涌镇'
        },
        {
            'code': '441906',
            'val': '石碣镇'
        },
        {
            'code': '441907',
            'val': '寮步镇'
        },
        {
            'code': '441908',
            'val': '望牛墩镇'
        },
        {
            'code': '441909',
            'val': '中堂镇'
        },
        {
            'code': '441910',
            'val': '石龙镇'
        },
        {
            'code': '441911',
            'val': '大朗镇'
        },
        {
            'code': '441912',
            'val': '大岭山镇'
        },
        {
            'code': '441913',
            'val': '洪梅镇'
        },
        {
            'code': '441914',
            'val': '石排镇'
        },
        {
            'code': '441915',
            'val': '东坑镇'
        },
        {
            'code': '441916',
            'val': '樟木头镇'
        },
        {
            'code': '441917',
            'val': '道滘镇'
        },
        {
            'code': '441918',
            'val': '企石镇'
        },
        {
            'code': '441919',
            'val': '横沥镇'
        },
        {
            'code': '441920',
            'val': '沙田镇'
        },
        {
            'code': '441921',
            'val': '虎门镇'
        },
        {
            'code': '441922',
            'val': '常平镇'
        },
        {
            'code': '441923',
            'val': '厚街镇'
        },
        {
            'code': '441924',
            'val': '长安镇'
        },
        {
            'code': '441925',
            'val': '黄江镇'
        },
        {
            'code': '441926',
            'val': '高埗镇'
        },
        {
            'code': '441927',
            'val': '茶山镇'
        },
        {
            'code': '441928',
            'val': '塘厦镇'
        },
        {
            'code': '441929',
            'val': '凤岗镇'
        },
        {
            'code': '441930',
            'val': '清溪镇'
        },
        {
            'code': '441931',
            'val': '桥头镇'
        },
        {
            'code': '441932',
            'val': '谢岗镇'
        },
        {
            'code': '441933',
            'val': '松山湖'
        }
    ],
    '442000': [
        {
            'code': '442010',
            'val': '火炬区'
        },
        {
            'code': '442011',
            'val': '石岐区'
        },
        {
            'code': '442012',
            'val': '东区'
        },
        {
            'code': '442013',
            'val': '西区'
        },
        {
            'code': '442014',
            'val': '南区'
        },
        {
            'code': '442015',
            'val': '五桂山'
        },
        {
            'code': '442020',
            'val': '黄圃镇'
        },
        {
            'code': '442021',
            'val': '南头镇'
        },
        {
            'code': '442022',
            'val': '东凤镇'
        },
        {
            'code': '442023',
            'val': '阜沙镇'
        },
        {
            'code': '442024',
            'val': '小榄镇'
        },
        {
            'code': '442025',
            'val': '东升镇'
        },
        {
            'code': '442026',
            'val': '古镇镇'
        },
        {
            'code': '442027',
            'val': '横栏镇'
        },
        {
            'code': '442028',
            'val': '三角镇'
        },
        {
            'code': '442029',
            'val': '民众镇'
        },
        {
            'code': '442030',
            'val': '南朗镇'
        },
        {
            'code': '442031',
            'val': '港口镇'
        },
        {
            'code': '442032',
            'val': '大涌镇'
        },
        {
            'code': '442033',
            'val': '沙溪镇'
        },
        {
            'code': '442034',
            'val': '三乡镇'
        },
        {
            'code': '442035',
            'val': '板芙镇'
        },
        {
            'code': '442036',
            'val': '神湾镇'
        },
        {
            'code': '442037',
            'val': '坦洲镇'
        },
        {
            'code': '442038',
            'val': '沌口区'
        },
        {
            'code': '442039',
            'val': '盘龙城'
        },
        {
            'code': '442040',
            'val': '东湖高新'
        },
        {
            'code': '442041',
            'val': '温泉城区'
        },
        {
            'code': '442042',
            'val': '阳逻区'
        }
    ],
    '445100': [
        {
            'code': '445101',
            'val': '市辖区'
        },
        {
            'code': '445102',
            'val': '湘桥区'
        },
        {
            'code': '445121',
            'val': '潮安县'
        },
        {
            'code': '445122',
            'val': '饶平县'
        }
    ],
    '445200': [
        {
            'code': '445201',
            'val': '市辖区'
        },
        {
            'code': '445202',
            'val': '榕城区'
        },
        {
            'code': '445221',
            'val': '揭东县'
        },
        {
            'code': '445222',
            'val': '揭西县'
        },
        {
            'code': '445224',
            'val': '惠来县'
        },
        {
            'code': '445281',
            'val': '普宁市'
        }
    ],
    '445300': [
        {
            'code': '445301',
            'val': '市辖区'
        },
        {
            'code': '445302',
            'val': '云城区'
        },
        {
            'code': '445321',
            'val': '新兴县'
        },
        {
            'code': '445322',
            'val': '郁南县'
        },
        {
            'code': '445323',
            'val': '云安县'
        },
        {
            'code': '445381',
            'val': '罗定市'
        }
    ],
    '450100': [
        {
            'code': '450101',
            'val': '市辖区'
        },
        {
            'code': '450102',
            'val': '兴宁区'
        },
        {
            'code': '450103',
            'val': '新城区'
        },
        {
            'code': '450104',
            'val': '城北区'
        },
        {
            'code': '450105',
            'val': '江南区'
        },
        {
            'code': '450106',
            'val': '永新区'
        },
        {
            'code': '450121',
            'val': '邕宁县'
        },
        {
            'code': '450122',
            'val': '武鸣县'
        },
        {
            'code': '450123',
            'val': '隆安县'
        },
        {
            'code': '450124',
            'val': '马山县'
        },
        {
            'code': '450125',
            'val': '上林县'
        },
        {
            'code': '450126',
            'val': '宾阳县'
        },
        {
            'code': '450127',
            'val': '横县'
        }
    ],
    '450200': [
        {
            'code': '450201',
            'val': '市辖区'
        },
        {
            'code': '450202',
            'val': '城中区'
        },
        {
            'code': '450203',
            'val': '鱼峰区'
        },
        {
            'code': '450204',
            'val': '柳南区'
        },
        {
            'code': '450205',
            'val': '柳北区'
        },
        {
            'code': '450221',
            'val': '柳江县'
        },
        {
            'code': '450222',
            'val': '柳城县'
        },
        {
            'code': '450223',
            'val': '鹿寨县'
        },
        {
            'code': '450224',
            'val': '融安县'
        },
        {
            'code': '450225',
            'val': '融水苗族自治县'
        },
        {
            'code': '450226',
            'val': '三江侗族自治县'
        }
    ],
    '450300': [
        {
            'code': '450301',
            'val': '市辖区'
        },
        {
            'code': '450302',
            'val': '秀峰区'
        },
        {
            'code': '450303',
            'val': '叠彩区'
        },
        {
            'code': '450304',
            'val': '象山区'
        },
        {
            'code': '450305',
            'val': '七星区'
        },
        {
            'code': '450311',
            'val': '雁山区'
        },
        {
            'code': '450321',
            'val': '阳朔县'
        },
        {
            'code': '450322',
            'val': '临桂县'
        },
        {
            'code': '450323',
            'val': '灵川县'
        },
        {
            'code': '450324',
            'val': '全州县'
        },
        {
            'code': '450325',
            'val': '兴安县'
        },
        {
            'code': '450326',
            'val': '永福县'
        },
        {
            'code': '450327',
            'val': '灌阳县'
        },
        {
            'code': '450328',
            'val': '龙胜各族自治县'
        },
        {
            'code': '450329',
            'val': '资源县'
        },
        {
            'code': '450330',
            'val': '平乐县'
        },
        {
            'code': '450331',
            'val': '荔蒲县'
        },
        {
            'code': '450332',
            'val': '恭城瑶族自治县'
        }
    ],
    '450400': [
        {
            'code': '450401',
            'val': '市辖区'
        },
        {
            'code': '450403',
            'val': '万秀区'
        },
        {
            'code': '450404',
            'val': '蝶山区'
        },
        {
            'code': '450405',
            'val': '长洲区'
        },
        {
            'code': '450421',
            'val': '苍梧县'
        },
        {
            'code': '450422',
            'val': '藤县'
        },
        {
            'code': '450423',
            'val': '蒙山县'
        },
        {
            'code': '450481',
            'val': '岑溪市'
        }
    ],
    '450500': [
        {
            'code': '450501',
            'val': '市辖区'
        },
        {
            'code': '450502',
            'val': '海城区'
        },
        {
            'code': '450503',
            'val': '银海区'
        },
        {
            'code': '450512',
            'val': '铁山港区'
        },
        {
            'code': '450521',
            'val': '合浦县'
        }
    ],
    '450600': [
        {
            'code': '450601',
            'val': '市辖区'
        },
        {
            'code': '450602',
            'val': '港口区'
        },
        {
            'code': '450603',
            'val': '防城区'
        },
        {
            'code': '450621',
            'val': '上思县'
        },
        {
            'code': '450681',
            'val': '东兴市'
        }
    ],
    '450700': [
        {
            'code': '450701',
            'val': '市辖区'
        },
        {
            'code': '450702',
            'val': '钦南区'
        },
        {
            'code': '450703',
            'val': '钦北区'
        },
        {
            'code': '450721',
            'val': '灵山县'
        },
        {
            'code': '450722',
            'val': '浦北县'
        }
    ],
    '450800': [
        {
            'code': '450801',
            'val': '市辖区'
        },
        {
            'code': '450802',
            'val': '港北区'
        },
        {
            'code': '450803',
            'val': '港南区'
        },
        {
            'code': '450804',
            'val': '覃塘区'
        },
        {
            'code': '450821',
            'val': '平南县'
        },
        {
            'code': '450881',
            'val': '桂平市'
        }
    ],
    '450900': [
        {
            'code': '450901',
            'val': '市辖区'
        },
        {
            'code': '450902',
            'val': '玉州区'
        },
        {
            'code': '450921',
            'val': '容县'
        },
        {
            'code': '450922',
            'val': '陆川县'
        },
        {
            'code': '450923',
            'val': '博白县'
        },
        {
            'code': '450924',
            'val': '兴业县'
        },
        {
            'code': '450981',
            'val': '北流市'
        }
    ],
    '451000': [
        {
            'code': '451001',
            'val': '市辖区'
        },
        {
            'code': '451002',
            'val': '右江区'
        },
        {
            'code': '451021',
            'val': '田阳县'
        },
        {
            'code': '451022',
            'val': '田东县'
        },
        {
            'code': '451023',
            'val': '平果县'
        },
        {
            'code': '451024',
            'val': '德保县'
        },
        {
            'code': '451025',
            'val': '靖西县'
        },
        {
            'code': '451026',
            'val': '那坡县'
        },
        {
            'code': '451027',
            'val': '凌云县'
        },
        {
            'code': '451028',
            'val': '乐业县'
        },
        {
            'code': '451029',
            'val': '田林县'
        },
        {
            'code': '451030',
            'val': '西林县'
        },
        {
            'code': '451031',
            'val': '隆林各族自治县'
        }
    ],
    '451100': [
        {
            'code': '451101',
            'val': '市辖区'
        },
        {
            'code': '451102',
            'val': '八步区'
        },
        {
            'code': '451121',
            'val': '昭平县'
        },
        {
            'code': '451122',
            'val': '钟山县'
        },
        {
            'code': '451123',
            'val': '富川瑶族自治县'
        }
    ],
    '451200': [
        {
            'code': '451201',
            'val': '市辖区'
        },
        {
            'code': '451202',
            'val': '金城江区'
        },
        {
            'code': '451221',
            'val': '南丹县'
        },
        {
            'code': '451222',
            'val': '天峨县'
        },
        {
            'code': '451223',
            'val': '凤山县'
        },
        {
            'code': '451224',
            'val': '东兰县'
        },
        {
            'code': '451225',
            'val': '罗城仫佬族自治县'
        },
        {
            'code': '451226',
            'val': '环江毛南族自治县'
        },
        {
            'code': '451227',
            'val': '巴马瑶族自治县'
        },
        {
            'code': '451228',
            'val': '都安瑶族自治县'
        },
        {
            'code': '451229',
            'val': '大化瑶族自治县'
        },
        {
            'code': '451281',
            'val': '宜州市'
        }
    ],
    '451300': [
        {
            'code': '451301',
            'val': '市辖区'
        },
        {
            'code': '451302',
            'val': '兴宾区'
        },
        {
            'code': '451321',
            'val': '忻城县'
        },
        {
            'code': '451322',
            'val': '象州县'
        },
        {
            'code': '451323',
            'val': '武宣县'
        },
        {
            'code': '451324',
            'val': '金秀瑶族自治县'
        },
        {
            'code': '451381',
            'val': '合山市'
        }
    ],
    '451400': [
        {
            'code': '451401',
            'val': '市辖区'
        },
        {
            'code': '451402',
            'val': '江洲区'
        },
        {
            'code': '451421',
            'val': '扶绥县'
        },
        {
            'code': '451422',
            'val': '宁明县'
        },
        {
            'code': '451423',
            'val': '龙州县'
        },
        {
            'code': '451424',
            'val': '大新县'
        },
        {
            'code': '451425',
            'val': '天等县'
        },
        {
            'code': '451481',
            'val': '凭祥市'
        }
    ],
    '460100': [
        {
            'code': '460101',
            'val': '市辖区'
        },
        {
            'code': '460105',
            'val': '秀英区'
        },
        {
            'code': '460106',
            'val': '龙华区'
        },
        {
            'code': '460107',
            'val': '琼山区'
        },
        {
            'code': '460108',
            'val': '美兰区'
        }
    ],
    '460200': [
        {
            'code': '460201',
            'val': '市辖区'
        }
    ],
    '469000': [
        {
            'code': '469001',
            'val': '五指山市'
        },
        {
            'code': '469002',
            'val': '琼海市'
        },
        {
            'code': '469003',
            'val': '儋州市'
        },
        {
            'code': '469005',
            'val': '文昌市'
        },
        {
            'code': '469006',
            'val': '万宁市'
        },
        {
            'code': '469007',
            'val': '东方市'
        },
        {
            'code': '469025',
            'val': '定安县'
        },
        {
            'code': '469026',
            'val': '屯昌县'
        },
        {
            'code': '469027',
            'val': '澄迈县'
        },
        {
            'code': '469028',
            'val': '临高县'
        },
        {
            'code': '469030',
            'val': '白沙黎族自治县'
        },
        {
            'code': '469031',
            'val': '昌江黎族自治县'
        },
        {
            'code': '469033',
            'val': '乐东黎族自治县'
        },
        {
            'code': '469034',
            'val': '陵水黎族自治县'
        },
        {
            'code': '469035',
            'val': '保亭黎族苗族自治县'
        },
        {
            'code': '469036',
            'val': '琼中黎族苗族自治县'
        },
        {
            'code': '469037',
            'val': '西沙群岛'
        },
        {
            'code': '469038',
            'val': '南沙群岛'
        },
        {
            'code': '469039',
            'val': '中沙群岛的岛礁及其海域'
        }
    ],
    '500100': [
        {
            'code': '500101',
            'val': '万州区'
        },
        {
            'code': '500102',
            'val': '涪陵区'
        },
        {
            'code': '500103',
            'val': '渝中区'
        },
        {
            'code': '500104',
            'val': '大渡口区'
        },
        {
            'code': '500105',
            'val': '江北区'
        },
        {
            'code': '500106',
            'val': '沙坪坝区'
        },
        {
            'code': '500107',
            'val': '九龙坡区'
        },
        {
            'code': '500108',
            'val': '南岸区'
        },
        {
            'code': '500109',
            'val': '北碚区'
        },
        {
            'code': '500110',
            'val': '万盛区'
        },
        {
            'code': '500111',
            'val': '双桥区'
        },
        {
            'code': '500112',
            'val': '渝北区'
        },
        {
            'code': '500113',
            'val': '巴南区'
        },
        {
            'code': '500114',
            'val': '黔江区'
        },
        {
            'code': '500115',
            'val': '长寿区'
        }
    ],
    '500200': [
        {
            'code': '500222',
            'val': '綦江县'
        },
        {
            'code': '500223',
            'val': '潼南县'
        },
        {
            'code': '500224',
            'val': '铜梁县'
        },
        {
            'code': '500225',
            'val': '大足县'
        },
        {
            'code': '500226',
            'val': '荣昌县'
        },
        {
            'code': '500227',
            'val': '璧山县'
        },
        {
            'code': '500228',
            'val': '梁平县'
        },
        {
            'code': '500229',
            'val': '城口县'
        },
        {
            'code': '500230',
            'val': '丰都县'
        },
        {
            'code': '500231',
            'val': '垫江县'
        },
        {
            'code': '500232',
            'val': '武隆县'
        },
        {
            'code': '500233',
            'val': '忠县'
        },
        {
            'code': '500234',
            'val': '开县'
        },
        {
            'code': '500235',
            'val': '云阳县'
        },
        {
            'code': '500236',
            'val': '奉节县'
        },
        {
            'code': '500237',
            'val': '巫山县'
        },
        {
            'code': '500238',
            'val': '巫溪县'
        },
        {
            'code': '500240',
            'val': '石柱土家族自治县'
        },
        {
            'code': '500241',
            'val': '秀山土家族苗族自治县'
        },
        {
            'code': '500242',
            'val': '酉阳土家族苗族自治县'
        },
        {
            'code': '500243',
            'val': '彭水苗族土家族自治县'
        }
    ],
    '500300': [
        {
            'code': '500381',
            'val': '江津市'
        },
        {
            'code': '500382',
            'val': '合川市'
        },
        {
            'code': '500383',
            'val': '永川市'
        },
        {
            'code': '500384',
            'val': '南川市'
        }
    ],
    '510100': [
        {
            'code': '510101',
            'val': '市辖区'
        },
        {
            'code': '510104',
            'val': '锦江区'
        },
        {
            'code': '510105',
            'val': '青羊区'
        },
        {
            'code': '510106',
            'val': '金牛区'
        },
        {
            'code': '510107',
            'val': '武侯区'
        },
        {
            'code': '510108',
            'val': '成华区'
        },
        {
            'code': '510112',
            'val': '龙泉驿区'
        },
        {
            'code': '510113',
            'val': '青白江区'
        },
        {
            'code': '510114',
            'val': '新都区'
        },
        {
            'code': '510115',
            'val': '温江区'
        },
        {
            'code': '510121',
            'val': '金堂县'
        },
        {
            'code': '510122',
            'val': '双流县'
        },
        {
            'code': '510124',
            'val': '郫县'
        },
        {
            'code': '510129',
            'val': '大邑县'
        },
        {
            'code': '510131',
            'val': '蒲江县'
        },
        {
            'code': '510132',
            'val': '新津县'
        },
        {
            'code': '510181',
            'val': '都江堰市'
        },
        {
            'code': '510182',
            'val': '彭州市'
        },
        {
            'code': '510183',
            'val': '邛崃市'
        },
        {
            'code': '510184',
            'val': '崇州市'
        }
    ],
    '510300': [
        {
            'code': '510301',
            'val': '市辖区'
        },
        {
            'code': '510302',
            'val': '自流井区'
        },
        {
            'code': '510303',
            'val': '贡井区'
        },
        {
            'code': '510304',
            'val': '大安区'
        },
        {
            'code': '510311',
            'val': '沿滩区'
        },
        {
            'code': '510321',
            'val': '荣县'
        },
        {
            'code': '510322',
            'val': '富顺县'
        }
    ],
    '510400': [
        {
            'code': '510401',
            'val': '市辖区'
        },
        {
            'code': '510402',
            'val': '东区'
        },
        {
            'code': '510403',
            'val': '西区'
        },
        {
            'code': '510411',
            'val': '仁和区'
        },
        {
            'code': '510421',
            'val': '米易县'
        },
        {
            'code': '510422',
            'val': '盐边县'
        }
    ],
    '510500': [
        {
            'code': '510501',
            'val': '市辖区'
        },
        {
            'code': '510502',
            'val': '江阳区'
        },
        {
            'code': '510503',
            'val': '纳溪区'
        },
        {
            'code': '510504',
            'val': '龙马潭区'
        },
        {
            'code': '510521',
            'val': '泸县'
        },
        {
            'code': '510522',
            'val': '合江县'
        },
        {
            'code': '510524',
            'val': '叙永县'
        },
        {
            'code': '510525',
            'val': '古蔺县'
        }
    ],
    '510600': [
        {
            'code': '510601',
            'val': '市辖区'
        },
        {
            'code': '510603',
            'val': '旌阳区'
        },
        {
            'code': '510623',
            'val': '中江县'
        },
        {
            'code': '510626',
            'val': '罗江县'
        },
        {
            'code': '510681',
            'val': '广汉市'
        },
        {
            'code': '510682',
            'val': '什邡市'
        },
        {
            'code': '510683',
            'val': '绵竹市'
        }
    ],
    '510700': [
        {
            'code': '510701',
            'val': '市辖区'
        },
        {
            'code': '510703',
            'val': '涪城区'
        },
        {
            'code': '510704',
            'val': '游仙区'
        },
        {
            'code': '510722',
            'val': '三台县'
        },
        {
            'code': '510723',
            'val': '盐亭县'
        },
        {
            'code': '510724',
            'val': '安县'
        },
        {
            'code': '510725',
            'val': '梓潼县'
        },
        {
            'code': '510726',
            'val': '北川羌族自治县'
        },
        {
            'code': '510727',
            'val': '平武县'
        },
        {
            'code': '510781',
            'val': '江油市'
        }
    ],
    '510800': [
        {
            'code': '510801',
            'val': '市辖区'
        },
        {
            'code': '510802',
            'val': '市中区'
        },
        {
            'code': '510811',
            'val': '元坝区'
        },
        {
            'code': '510812',
            'val': '朝天区'
        },
        {
            'code': '510821',
            'val': '旺苍县'
        },
        {
            'code': '510822',
            'val': '青川县'
        },
        {
            'code': '510823',
            'val': '剑阁县'
        },
        {
            'code': '510824',
            'val': '苍溪县'
        }
    ],
    '510900': [
        {
            'code': '510901',
            'val': '市辖区'
        },
        {
            'code': '510903',
            'val': '船山区'
        },
        {
            'code': '510904',
            'val': '安居区'
        },
        {
            'code': '510921',
            'val': '蓬溪县'
        },
        {
            'code': '510922',
            'val': '射洪县'
        },
        {
            'code': '510923',
            'val': '大英县'
        }
    ],
    '511000': [
        {
            'code': '511001',
            'val': '市辖区'
        },
        {
            'code': '511002',
            'val': '市中区'
        },
        {
            'code': '511011',
            'val': '东兴区'
        },
        {
            'code': '511024',
            'val': '威远县'
        },
        {
            'code': '511025',
            'val': '资中县'
        },
        {
            'code': '511028',
            'val': '隆昌县'
        }
    ],
    '511100': [
        {
            'code': '511101',
            'val': '市辖区'
        },
        {
            'code': '511102',
            'val': '市中区'
        },
        {
            'code': '511111',
            'val': '沙湾区'
        },
        {
            'code': '511112',
            'val': '五通桥区'
        },
        {
            'code': '511113',
            'val': '金口河区'
        },
        {
            'code': '511123',
            'val': '犍为县'
        },
        {
            'code': '511124',
            'val': '井研县'
        },
        {
            'code': '511126',
            'val': '夹江县'
        },
        {
            'code': '511129',
            'val': '沐川县'
        },
        {
            'code': '511132',
            'val': '峨边彝族自治县'
        },
        {
            'code': '511133',
            'val': '马边彝族自治县'
        },
        {
            'code': '511181',
            'val': '峨眉山市'
        }
    ],
    '511300': [
        {
            'code': '511301',
            'val': '市辖区'
        },
        {
            'code': '511302',
            'val': '顺庆区'
        },
        {
            'code': '511303',
            'val': '高坪区'
        },
        {
            'code': '511304',
            'val': '嘉陵区'
        },
        {
            'code': '511321',
            'val': '南部县'
        },
        {
            'code': '511322',
            'val': '营山县'
        },
        {
            'code': '511323',
            'val': '蓬安县'
        },
        {
            'code': '511324',
            'val': '仪陇县'
        },
        {
            'code': '511325',
            'val': '西充县'
        },
        {
            'code': '511381',
            'val': '阆中市'
        }
    ],
    '511400': [
        {
            'code': '511401',
            'val': '市辖区'
        },
        {
            'code': '511402',
            'val': '东坡区'
        },
        {
            'code': '511421',
            'val': '仁寿县'
        },
        {
            'code': '511422',
            'val': '彭山县'
        },
        {
            'code': '511423',
            'val': '洪雅县'
        },
        {
            'code': '511424',
            'val': '丹棱县'
        },
        {
            'code': '511425',
            'val': '青神县'
        }
    ],
    '511500': [
        {
            'code': '511501',
            'val': '市辖区'
        },
        {
            'code': '511502',
            'val': '翠屏区'
        },
        {
            'code': '511521',
            'val': '宜宾县'
        },
        {
            'code': '511522',
            'val': '南溪县'
        },
        {
            'code': '511523',
            'val': '江安县'
        },
        {
            'code': '511524',
            'val': '长宁县'
        },
        {
            'code': '511525',
            'val': '高县'
        },
        {
            'code': '511526',
            'val': '珙县'
        },
        {
            'code': '511527',
            'val': '筠连县'
        },
        {
            'code': '511528',
            'val': '兴文县'
        },
        {
            'code': '511529',
            'val': '屏山县'
        }
    ],
    '511600': [
        {
            'code': '511601',
            'val': '市辖区'
        },
        {
            'code': '511602',
            'val': '广安区'
        },
        {
            'code': '511621',
            'val': '岳池县'
        },
        {
            'code': '511622',
            'val': '武胜县'
        },
        {
            'code': '511623',
            'val': '邻水县'
        },
        {
            'code': '511681',
            'val': '华莹市'
        }
    ],
    '511700': [
        {
            'code': '511701',
            'val': '市辖区'
        },
        {
            'code': '511702',
            'val': '通川区'
        },
        {
            'code': '511721',
            'val': '达县'
        },
        {
            'code': '511722',
            'val': '宣汉县'
        },
        {
            'code': '511723',
            'val': '开江县'
        },
        {
            'code': '511724',
            'val': '大竹县'
        },
        {
            'code': '511725',
            'val': '渠县'
        },
        {
            'code': '511781',
            'val': '万源市'
        }
    ],
    '511800': [
        {
            'code': '511801',
            'val': '市辖区'
        },
        {
            'code': '511802',
            'val': '雨城区'
        },
        {
            'code': '511821',
            'val': '名山县'
        },
        {
            'code': '511822',
            'val': '荥经县'
        },
        {
            'code': '511823',
            'val': '汉源县'
        },
        {
            'code': '511824',
            'val': '石棉县'
        },
        {
            'code': '511825',
            'val': '天全县'
        },
        {
            'code': '511826',
            'val': '芦山县'
        },
        {
            'code': '511827',
            'val': '宝兴县'
        }
    ],
    '511900': [
        {
            'code': '511901',
            'val': '市辖区'
        },
        {
            'code': '511902',
            'val': '巴州区'
        },
        {
            'code': '511921',
            'val': '通江县'
        },
        {
            'code': '511922',
            'val': '南江县'
        },
        {
            'code': '511923',
            'val': '平昌县'
        }
    ],
    '512000': [
        {
            'code': '512001',
            'val': '市辖区'
        },
        {
            'code': '512002',
            'val': '雁江区'
        },
        {
            'code': '512021',
            'val': '安岳县'
        },
        {
            'code': '512022',
            'val': '乐至县'
        },
        {
            'code': '512081',
            'val': '简阳市'
        }
    ],
    '513200': [
        {
            'code': '513221',
            'val': '汶川县'
        },
        {
            'code': '513222',
            'val': '理县'
        },
        {
            'code': '513223',
            'val': '茂县'
        },
        {
            'code': '513224',
            'val': '松潘县'
        },
        {
            'code': '513225',
            'val': '九寨沟县'
        },
        {
            'code': '513226',
            'val': '金川县'
        },
        {
            'code': '513227',
            'val': '小金县'
        },
        {
            'code': '513228',
            'val': '黑水县'
        },
        {
            'code': '513229',
            'val': '马尔康县'
        },
        {
            'code': '513230',
            'val': '壤塘县'
        },
        {
            'code': '513231',
            'val': '阿坝县'
        },
        {
            'code': '513232',
            'val': '若尔盖县'
        },
        {
            'code': '513233',
            'val': '红原县'
        }
    ],
    '513300': [
        {
            'code': '513321',
            'val': '康定县'
        },
        {
            'code': '513322',
            'val': '泸定县'
        },
        {
            'code': '513323',
            'val': '丹巴县'
        },
        {
            'code': '513324',
            'val': '九龙县'
        },
        {
            'code': '513325',
            'val': '雅江县'
        },
        {
            'code': '513326',
            'val': '道孚县'
        },
        {
            'code': '513327',
            'val': '炉霍县'
        },
        {
            'code': '513328',
            'val': '甘孜县'
        },
        {
            'code': '513329',
            'val': '新龙县'
        },
        {
            'code': '513330',
            'val': '德格县'
        },
        {
            'code': '513331',
            'val': '白玉县'
        },
        {
            'code': '513332',
            'val': '石渠县'
        },
        {
            'code': '513333',
            'val': '色达县'
        },
        {
            'code': '513334',
            'val': '理塘县'
        },
        {
            'code': '513335',
            'val': '巴塘县'
        },
        {
            'code': '513336',
            'val': '乡城县'
        },
        {
            'code': '513337',
            'val': '稻城县'
        },
        {
            'code': '513338',
            'val': '得荣县'
        }
    ],
    '513400': [
        {
            'code': '513401',
            'val': '西昌市'
        },
        {
            'code': '513422',
            'val': '木里藏族自治县'
        },
        {
            'code': '513423',
            'val': '盐源县'
        },
        {
            'code': '513424',
            'val': '德昌县'
        },
        {
            'code': '513425',
            'val': '会理县'
        },
        {
            'code': '513426',
            'val': '会东县'
        },
        {
            'code': '513427',
            'val': '宁南县'
        },
        {
            'code': '513428',
            'val': '普格县'
        },
        {
            'code': '513429',
            'val': '布拖县'
        },
        {
            'code': '513430',
            'val': '金阳县'
        },
        {
            'code': '513431',
            'val': '昭觉县'
        },
        {
            'code': '513432',
            'val': '喜德县'
        },
        {
            'code': '513433',
            'val': '冕宁县'
        },
        {
            'code': '513434',
            'val': '越西县'
        },
        {
            'code': '513435',
            'val': '甘洛县'
        },
        {
            'code': '513436',
            'val': '美姑县'
        },
        {
            'code': '513437',
            'val': '雷波县'
        }
    ],
    '520100': [
        {
            'code': '520101',
            'val': '市辖区'
        },
        {
            'code': '520102',
            'val': '南明区'
        },
        {
            'code': '520103',
            'val': '云岩区'
        },
        {
            'code': '520111',
            'val': '花溪区'
        },
        {
            'code': '520112',
            'val': '乌当区'
        },
        {
            'code': '520113',
            'val': '白云区'
        },
        {
            'code': '520114',
            'val': '小河区'
        },
        {
            'code': '520121',
            'val': '开阳县'
        },
        {
            'code': '520122',
            'val': '息烽县'
        },
        {
            'code': '520123',
            'val': '修文县'
        },
        {
            'code': '520181',
            'val': '清镇市'
        }
    ],
    '520200': [
        {
            'code': '520201',
            'val': '钟山区'
        },
        {
            'code': '520203',
            'val': '六枝特区'
        },
        {
            'code': '520221',
            'val': '水城县'
        },
        {
            'code': '520222',
            'val': '盘县'
        }
    ],
    '520300': [
        {
            'code': '520301',
            'val': '市辖区'
        },
        {
            'code': '520302',
            'val': '红花岗区'
        },
        {
            'code': '520303',
            'val': '汇川区'
        },
        {
            'code': '520321',
            'val': '遵义县'
        },
        {
            'code': '520322',
            'val': '桐梓县'
        },
        {
            'code': '520323',
            'val': '绥阳县'
        },
        {
            'code': '520324',
            'val': '正安县'
        },
        {
            'code': '520325',
            'val': '道真仡佬族苗族自治县'
        },
        {
            'code': '520326',
            'val': '务川仡佬族苗族自治县'
        },
        {
            'code': '520327',
            'val': '凤冈县'
        },
        {
            'code': '520328',
            'val': '湄潭县'
        },
        {
            'code': '520329',
            'val': '余庆县'
        },
        {
            'code': '520330',
            'val': '习水县'
        },
        {
            'code': '520381',
            'val': '赤水市'
        },
        {
            'code': '520382',
            'val': '仁怀市'
        }
    ],
    '520400': [
        {
            'code': '520401',
            'val': '市辖区'
        },
        {
            'code': '520402',
            'val': '西秀区'
        },
        {
            'code': '520421',
            'val': '平坝县'
        },
        {
            'code': '520422',
            'val': '普定县'
        },
        {
            'code': '520423',
            'val': '镇宁布依族苗族自治县'
        },
        {
            'code': '520424',
            'val': '关岭布依族苗族自治县'
        },
        {
            'code': '520425',
            'val': '紫云苗族布依族自治县'
        }
    ],
    '522200': [
        {
            'code': '522201',
            'val': '铜仁市'
        },
        {
            'code': '522222',
            'val': '江口县'
        },
        {
            'code': '522223',
            'val': '玉屏侗族自治县'
        },
        {
            'code': '522224',
            'val': '石阡县'
        },
        {
            'code': '522225',
            'val': '思南县'
        },
        {
            'code': '522226',
            'val': '印江土家族苗族自治县'
        },
        {
            'code': '522227',
            'val': '德江县'
        },
        {
            'code': '522228',
            'val': '沿河土家族自治县'
        },
        {
            'code': '522229',
            'val': '松桃苗族自治县'
        },
        {
            'code': '522230',
            'val': '万山特区'
        }
    ],
    '522300': [
        {
            'code': '522301',
            'val': '兴义市'
        },
        {
            'code': '522322',
            'val': '兴仁县'
        },
        {
            'code': '522323',
            'val': '普安县'
        },
        {
            'code': '522324',
            'val': '晴隆县'
        },
        {
            'code': '522325',
            'val': '贞丰县'
        },
        {
            'code': '522326',
            'val': '望谟县'
        },
        {
            'code': '522327',
            'val': '册亨县'
        },
        {
            'code': '522328',
            'val': '安龙县'
        }
    ],
    '522400': [
        {
            'code': '522401',
            'val': '毕节市'
        },
        {
            'code': '522422',
            'val': '大方县'
        },
        {
            'code': '522423',
            'val': '黔西县'
        },
        {
            'code': '522424',
            'val': '金沙县'
        },
        {
            'code': '522425',
            'val': '织金县'
        },
        {
            'code': '522426',
            'val': '纳雍县'
        },
        {
            'code': '522427',
            'val': '威宁彝族回族苗族自治县'
        },
        {
            'code': '522428',
            'val': '赫章县'
        }
    ],
    '522600': [
        {
            'code': '522601',
            'val': '凯里市'
        },
        {
            'code': '522622',
            'val': '黄平县'
        },
        {
            'code': '522623',
            'val': '施秉县'
        },
        {
            'code': '522624',
            'val': '三穗县'
        },
        {
            'code': '522625',
            'val': '镇远县'
        },
        {
            'code': '522626',
            'val': '岑巩县'
        },
        {
            'code': '522627',
            'val': '天柱县'
        },
        {
            'code': '522628',
            'val': '锦屏县'
        },
        {
            'code': '522629',
            'val': '剑河县'
        },
        {
            'code': '522630',
            'val': '台江县'
        },
        {
            'code': '522631',
            'val': '黎平县'
        },
        {
            'code': '522632',
            'val': '榕江县'
        },
        {
            'code': '522633',
            'val': '从江县'
        },
        {
            'code': '522634',
            'val': '雷山县'
        },
        {
            'code': '522635',
            'val': '麻江县'
        },
        {
            'code': '522636',
            'val': '丹寨县'
        }
    ],
    '522700': [
        {
            'code': '522701',
            'val': '都匀市'
        },
        {
            'code': '522702',
            'val': '福泉市'
        },
        {
            'code': '522722',
            'val': '荔波县'
        },
        {
            'code': '522723',
            'val': '贵定县'
        },
        {
            'code': '522725',
            'val': '瓮安县'
        },
        {
            'code': '522726',
            'val': '独山县'
        },
        {
            'code': '522727',
            'val': '平塘县'
        },
        {
            'code': '522728',
            'val': '罗甸县'
        },
        {
            'code': '522729',
            'val': '长顺县'
        },
        {
            'code': '522730',
            'val': '龙里县'
        },
        {
            'code': '522731',
            'val': '惠水县'
        },
        {
            'code': '522732',
            'val': '三都水族自治县'
        }
    ],
    '530100': [
        {
            'code': '530101',
            'val': '市辖区'
        },
        {
            'code': '530102',
            'val': '五华区'
        },
        {
            'code': '530103',
            'val': '盘龙区'
        },
        {
            'code': '530111',
            'val': '官渡区'
        },
        {
            'code': '530112',
            'val': '西山区'
        },
        {
            'code': '530113',
            'val': '东川区'
        },
        {
            'code': '530121',
            'val': '呈贡县'
        },
        {
            'code': '530122',
            'val': '晋宁县'
        },
        {
            'code': '530124',
            'val': '富民县'
        },
        {
            'code': '530125',
            'val': '宜良县'
        },
        {
            'code': '530126',
            'val': '石林彝族自治县'
        },
        {
            'code': '530127',
            'val': '嵩明县'
        },
        {
            'code': '530128',
            'val': '禄劝彝族苗族自治县'
        },
        {
            'code': '530129',
            'val': '寻甸回族彝族自治县'
        },
        {
            'code': '530181',
            'val': '安宁市'
        }
    ],
    '530300': [
        {
            'code': '530301',
            'val': '市辖区'
        },
        {
            'code': '530302',
            'val': '麒麟区'
        },
        {
            'code': '530321',
            'val': '马龙县'
        },
        {
            'code': '530322',
            'val': '陆良县'
        },
        {
            'code': '530323',
            'val': '师宗县'
        },
        {
            'code': '530324',
            'val': '罗平县'
        },
        {
            'code': '530325',
            'val': '富源县'
        },
        {
            'code': '530326',
            'val': '会泽县'
        },
        {
            'code': '530328',
            'val': '沾益县'
        },
        {
            'code': '530381',
            'val': '宣威市'
        }
    ],
    '530400': [
        {
            'code': '530401',
            'val': '市辖区'
        },
        {
            'code': '530402',
            'val': '红塔区'
        },
        {
            'code': '530421',
            'val': '江川县'
        },
        {
            'code': '530422',
            'val': '澄江县'
        },
        {
            'code': '530423',
            'val': '通海县'
        },
        {
            'code': '530424',
            'val': '华宁县'
        },
        {
            'code': '530425',
            'val': '易门县'
        },
        {
            'code': '530426',
            'val': '峨山彝族自治县'
        },
        {
            'code': '530427',
            'val': '新平彝族傣族自治县'
        },
        {
            'code': '530428',
            'val': '元江哈尼族彝族傣族自治县'
        }
    ],
    '530500': [
        {
            'code': '530501',
            'val': '市辖区'
        },
        {
            'code': '530502',
            'val': '隆阳区'
        },
        {
            'code': '530521',
            'val': '施甸县'
        },
        {
            'code': '530522',
            'val': '腾冲县'
        },
        {
            'code': '530523',
            'val': '龙陵县'
        },
        {
            'code': '530524',
            'val': '昌宁县'
        }
    ],
    '530600': [
        {
            'code': '530601',
            'val': '市辖区'
        },
        {
            'code': '530602',
            'val': '昭阳区'
        },
        {
            'code': '530621',
            'val': '鲁甸县'
        },
        {
            'code': '530622',
            'val': '巧家县'
        },
        {
            'code': '530623',
            'val': '盐津县'
        },
        {
            'code': '530624',
            'val': '大关县'
        },
        {
            'code': '530625',
            'val': '永善县'
        },
        {
            'code': '530626',
            'val': '绥江县'
        },
        {
            'code': '530627',
            'val': '镇雄县'
        },
        {
            'code': '530628',
            'val': '彝良县'
        },
        {
            'code': '530629',
            'val': '威信县'
        },
        {
            'code': '530630',
            'val': '水富县'
        }
    ],
    '530700': [
        {
            'code': '530701',
            'val': '市辖区'
        },
        {
            'code': '530702',
            'val': '古城区'
        },
        {
            'code': '530721',
            'val': '玉龙纳西族自治县'
        },
        {
            'code': '530722',
            'val': '永胜县'
        },
        {
            'code': '530723',
            'val': '华坪县'
        },
        {
            'code': '530724',
            'val': '宁蒗彝族自治县'
        }
    ],
    '530800': [
        {
            'code': '530801',
            'val': '市辖区'
        },
        {
            'code': '530802',
            'val': '翠云区'
        },
        {
            'code': '530821',
            'val': '普洱哈尼族彝族自治县'
        },
        {
            'code': '530822',
            'val': '墨江哈尼族自治县'
        },
        {
            'code': '530823',
            'val': '景东彝族自治县'
        },
        {
            'code': '530824',
            'val': '景谷傣族彝族自治县'
        },
        {
            'code': '530825',
            'val': '镇沅彝族哈尼族拉祜族自治县'
        },
        {
            'code': '530826',
            'val': '江城哈尼族彝族自治县'
        },
        {
            'code': '530827',
            'val': '孟连傣族拉祜族佤族自治县'
        },
        {
            'code': '530828',
            'val': '澜沧拉祜族自治县'
        },
        {
            'code': '530829',
            'val': '西盟佤族自治县'
        }
    ],
    '530900': [
        {
            'code': '530901',
            'val': '市辖区'
        },
        {
            'code': '530902',
            'val': '临翔区'
        },
        {
            'code': '530921',
            'val': '凤庆县'
        },
        {
            'code': '530922',
            'val': '云县'
        },
        {
            'code': '530923',
            'val': '永德县'
        },
        {
            'code': '530924',
            'val': '镇康县'
        },
        {
            'code': '530926',
            'val': '耿马傣族佤族自治县'
        },
        {
            'code': '530927',
            'val': '沧源佤族自治县'
        }
    ],
    '532300': [
        {
            'code': '532301',
            'val': '楚雄市'
        },
        {
            'code': '532322',
            'val': '双柏县'
        },
        {
            'code': '532323',
            'val': '牟定县'
        },
        {
            'code': '532324',
            'val': '南华县'
        },
        {
            'code': '532325',
            'val': '姚安县'
        },
        {
            'code': '532326',
            'val': '大姚县'
        },
        {
            'code': '532327',
            'val': '永仁县'
        },
        {
            'code': '532328',
            'val': '元谋县'
        },
        {
            'code': '532329',
            'val': '武定县'
        },
        {
            'code': '532331',
            'val': '禄丰县'
        }
    ],
    '532500': [
        {
            'code': '532501',
            'val': '个旧市'
        },
        {
            'code': '532502',
            'val': '开远市'
        },
        {
            'code': '532522',
            'val': '蒙自县'
        },
        {
            'code': '532523',
            'val': '屏边苗族自治县'
        },
        {
            'code': '532524',
            'val': '建水县'
        },
        {
            'code': '532525',
            'val': '石屏县'
        },
        {
            'code': '532526',
            'val': '弥勒县'
        },
        {
            'code': '532527',
            'val': '泸西县'
        },
        {
            'code': '532528',
            'val': '元阳县'
        },
        {
            'code': '532529',
            'val': '红河县'
        },
        {
            'code': '532530',
            'val': '金平苗族瑶族傣族自治县'
        },
        {
            'code': '532531',
            'val': '绿春县'
        },
        {
            'code': '532532',
            'val': '河口瑶族自治县'
        }
    ],
    '532600': [
        {
            'code': '532621',
            'val': '文山县'
        },
        {
            'code': '532622',
            'val': '砚山县'
        },
        {
            'code': '532623',
            'val': '西畴县'
        },
        {
            'code': '532624',
            'val': '麻栗坡县'
        },
        {
            'code': '532625',
            'val': '马关县'
        },
        {
            'code': '532626',
            'val': '丘北县'
        },
        {
            'code': '532627',
            'val': '广南县'
        },
        {
            'code': '532628',
            'val': '富宁县'
        }
    ],
    '532800': [
        {
            'code': '532801',
            'val': '景洪市'
        },
        {
            'code': '532822',
            'val': '勐海县'
        },
        {
            'code': '532823',
            'val': '勐腊县'
        }
    ],
    '532900': [
        {
            'code': '532901',
            'val': '大理市'
        },
        {
            'code': '532922',
            'val': '漾濞彝族自治县'
        },
        {
            'code': '532923',
            'val': '祥云县'
        },
        {
            'code': '532924',
            'val': '宾川县'
        },
        {
            'code': '532925',
            'val': '弥渡县'
        },
        {
            'code': '532926',
            'val': '南涧彝族自治县'
        },
        {
            'code': '532927',
            'val': '巍山彝族回族自治县'
        },
        {
            'code': '532928',
            'val': '永平县'
        },
        {
            'code': '532929',
            'val': '云龙县'
        },
        {
            'code': '532930',
            'val': '洱源县'
        },
        {
            'code': '532931',
            'val': '剑川县'
        },
        {
            'code': '532932',
            'val': '鹤庆县'
        }
    ],
    '533100': [
        {
            'code': '533102',
            'val': '瑞丽市'
        },
        {
            'code': '533103',
            'val': '潞西市'
        },
        {
            'code': '533122',
            'val': '梁河县'
        },
        {
            'code': '533123',
            'val': '盈江县'
        },
        {
            'code': '533124',
            'val': '陇川县'
        }
    ],
    '533300': [
        {
            'code': '533321',
            'val': '泸水县'
        },
        {
            'code': '533323',
            'val': '福贡县'
        },
        {
            'code': '533324',
            'val': '贡山独龙族怒族自治县'
        },
        {
            'code': '533325',
            'val': '兰坪白族普米族自治县'
        }
    ],
    '533400': [
        {
            'code': '533421',
            'val': '香格里拉县'
        },
        {
            'code': '533422',
            'val': '德钦县'
        },
        {
            'code': '533423',
            'val': '维西傈僳族自治县'
        }
    ],
    '540100': [
        {
            'code': '540101',
            'val': '市辖区'
        },
        {
            'code': '540102',
            'val': '城关区'
        },
        {
            'code': '540121',
            'val': '林周县'
        },
        {
            'code': '540122',
            'val': '当雄县'
        },
        {
            'code': '540123',
            'val': '尼木县'
        },
        {
            'code': '540124',
            'val': '曲水县'
        },
        {
            'code': '540125',
            'val': '堆龙德庆县'
        },
        {
            'code': '540126',
            'val': '达孜县'
        },
        {
            'code': '540127',
            'val': '墨竹工卡县'
        }
    ],
    '542100': [
        {
            'code': '542121',
            'val': '昌都县'
        },
        {
            'code': '542122',
            'val': '江达县'
        },
        {
            'code': '542123',
            'val': '贡觉县'
        },
        {
            'code': '542124',
            'val': '类乌齐县'
        },
        {
            'code': '542125',
            'val': '丁青县'
        },
        {
            'code': '542126',
            'val': '察雅县'
        },
        {
            'code': '542127',
            'val': '八宿县'
        },
        {
            'code': '542128',
            'val': '左贡县'
        },
        {
            'code': '542129',
            'val': '芒康县'
        },
        {
            'code': '542132',
            'val': '洛隆县'
        },
        {
            'code': '542133',
            'val': '边坝县'
        }
    ],
    '542200': [
        {
            'code': '542221',
            'val': '乃东县'
        },
        {
            'code': '542222',
            'val': '扎囊县'
        },
        {
            'code': '542223',
            'val': '贡嘎县'
        },
        {
            'code': '542224',
            'val': '桑日县'
        },
        {
            'code': '542225',
            'val': '琼结县'
        },
        {
            'code': '542226',
            'val': '曲松县'
        },
        {
            'code': '542227',
            'val': '措美县'
        },
        {
            'code': '542228',
            'val': '洛扎县'
        },
        {
            'code': '542229',
            'val': '加查县'
        },
        {
            'code': '542231',
            'val': '隆子县'
        },
        {
            'code': '542232',
            'val': '错那县'
        },
        {
            'code': '542233',
            'val': '浪卡子县'
        }
    ],
    '542300': [
        {
            'code': '542301',
            'val': '日喀则市'
        },
        {
            'code': '542322',
            'val': '南木林县'
        },
        {
            'code': '542323',
            'val': '江孜县'
        },
        {
            'code': '542324',
            'val': '定日县'
        },
        {
            'code': '542325',
            'val': '萨迦县'
        },
        {
            'code': '542326',
            'val': '拉孜县'
        },
        {
            'code': '542327',
            'val': '昂仁县'
        },
        {
            'code': '542328',
            'val': '谢通门县'
        },
        {
            'code': '542329',
            'val': '白朗县'
        },
        {
            'code': '542330',
            'val': '仁布县'
        },
        {
            'code': '542331',
            'val': '康马县'
        },
        {
            'code': '542332',
            'val': '定结县'
        },
        {
            'code': '542333',
            'val': '仲巴县'
        },
        {
            'code': '542334',
            'val': '亚东县'
        },
        {
            'code': '542335',
            'val': '吉隆县'
        },
        {
            'code': '542336',
            'val': '聂拉木县'
        },
        {
            'code': '542337',
            'val': '萨嘎县'
        },
        {
            'code': '542338',
            'val': '岗巴县'
        }
    ],
    '542400': [
        {
            'code': '542421',
            'val': '那曲县'
        },
        {
            'code': '542422',
            'val': '嘉黎县'
        },
        {
            'code': '542423',
            'val': '比如县'
        },
        {
            'code': '542424',
            'val': '聂荣县'
        },
        {
            'code': '542425',
            'val': '安多县'
        },
        {
            'code': '542426',
            'val': '申扎县'
        },
        {
            'code': '542427',
            'val': '索县'
        },
        {
            'code': '542428',
            'val': '班戈县'
        },
        {
            'code': '542429',
            'val': '巴青县'
        },
        {
            'code': '542430',
            'val': '尼玛县'
        }
    ],
    '542500': [
        {
            'code': '542521',
            'val': '普兰县'
        },
        {
            'code': '542522',
            'val': '札达县'
        },
        {
            'code': '542523',
            'val': '噶尔县'
        },
        {
            'code': '542524',
            'val': '日土县'
        },
        {
            'code': '542525',
            'val': '革吉县'
        },
        {
            'code': '542526',
            'val': '改则县'
        },
        {
            'code': '542527',
            'val': '措勤县'
        }
    ],
    '542600': [
        {
            'code': '542621',
            'val': '林芝县'
        },
        {
            'code': '542622',
            'val': '工布江达县'
        },
        {
            'code': '542623',
            'val': '米林县'
        },
        {
            'code': '542624',
            'val': '墨脱县'
        },
        {
            'code': '542625',
            'val': '波密县'
        },
        {
            'code': '542626',
            'val': '察隅县'
        },
        {
            'code': '542627',
            'val': '朗县'
        }
    ],
    '610100': [
        {
            'code': '610101',
            'val': '市辖区'
        },
        {
            'code': '610102',
            'val': '新城区'
        },
        {
            'code': '610103',
            'val': '碑林区'
        },
        {
            'code': '610104',
            'val': '莲湖区'
        },
        {
            'code': '610111',
            'val': '灞桥区'
        },
        {
            'code': '610112',
            'val': '未央区'
        },
        {
            'code': '610113',
            'val': '雁塔区'
        },
        {
            'code': '610114',
            'val': '阎良区'
        },
        {
            'code': '610115',
            'val': '临潼区'
        },
        {
            'code': '610116',
            'val': '长安区'
        },
        {
            'code': '610122',
            'val': '蓝田县'
        },
        {
            'code': '610124',
            'val': '周至县'
        },
        {
            'code': '610125',
            'val': '户县'
        },
        {
            'code': '610126',
            'val': '高陵县'
        }
    ],
    '610200': [
        {
            'code': '610201',
            'val': '市辖区'
        },
        {
            'code': '610202',
            'val': '王益区'
        },
        {
            'code': '610203',
            'val': '印台区'
        },
        {
            'code': '610204',
            'val': '耀州区'
        },
        {
            'code': '610222',
            'val': '宜君县'
        }
    ],
    '610300': [
        {
            'code': '610301',
            'val': '市辖区'
        },
        {
            'code': '610302',
            'val': '渭滨区'
        },
        {
            'code': '610303',
            'val': '金台区'
        },
        {
            'code': '610304',
            'val': '陈仓区'
        },
        {
            'code': '610322',
            'val': '凤翔县'
        },
        {
            'code': '610323',
            'val': '岐山县'
        },
        {
            'code': '610324',
            'val': '扶风县'
        },
        {
            'code': '610326',
            'val': '眉县'
        },
        {
            'code': '610327',
            'val': '陇县'
        },
        {
            'code': '610328',
            'val': '千阳县'
        },
        {
            'code': '610329',
            'val': '麟游县'
        },
        {
            'code': '610330',
            'val': '凤县'
        },
        {
            'code': '610331',
            'val': '太白县'
        }
    ],
    '610400': [
        {
            'code': '610401',
            'val': '市辖区'
        },
        {
            'code': '610402',
            'val': '秦都区'
        },
        {
            'code': '610403',
            'val': '杨凌区'
        },
        {
            'code': '610404',
            'val': '渭城区'
        },
        {
            'code': '610422',
            'val': '三原县'
        },
        {
            'code': '610423',
            'val': '泾阳县'
        },
        {
            'code': '610424',
            'val': '乾县'
        },
        {
            'code': '610425',
            'val': '礼泉县'
        },
        {
            'code': '610426',
            'val': '永寿县'
        },
        {
            'code': '610427',
            'val': '彬县'
        },
        {
            'code': '610428',
            'val': '长武县'
        },
        {
            'code': '610429',
            'val': '旬邑县'
        },
        {
            'code': '610430',
            'val': '淳化县'
        },
        {
            'code': '610431',
            'val': '武功县'
        },
        {
            'code': '610481',
            'val': '兴平市'
        }
    ],
    '610500': [
        {
            'code': '610501',
            'val': '市辖区'
        },
        {
            'code': '610502',
            'val': '临渭区'
        },
        {
            'code': '610521',
            'val': '华县'
        },
        {
            'code': '610522',
            'val': '潼关县'
        },
        {
            'code': '610523',
            'val': '大荔县'
        },
        {
            'code': '610524',
            'val': '合阳县'
        },
        {
            'code': '610525',
            'val': '澄城县'
        },
        {
            'code': '610526',
            'val': '蒲城县'
        },
        {
            'code': '610527',
            'val': '白水县'
        },
        {
            'code': '610528',
            'val': '富平县'
        },
        {
            'code': '610581',
            'val': '韩城市'
        },
        {
            'code': '610582',
            'val': '华阴市'
        }
    ],
    '610600': [
        {
            'code': '610601',
            'val': '市辖区'
        },
        {
            'code': '610602',
            'val': '宝塔区'
        },
        {
            'code': '610621',
            'val': '延长县'
        },
        {
            'code': '610622',
            'val': '延川县'
        },
        {
            'code': '610623',
            'val': '子长县'
        },
        {
            'code': '610624',
            'val': '安塞县'
        },
        {
            'code': '610625',
            'val': '志丹县'
        },
        {
            'code': '610626',
            'val': '吴旗县'
        },
        {
            'code': '610627',
            'val': '甘泉县'
        },
        {
            'code': '610628',
            'val': '富县'
        },
        {
            'code': '610629',
            'val': '洛川县'
        },
        {
            'code': '610630',
            'val': '宜川县'
        },
        {
            'code': '610631',
            'val': '黄龙县'
        },
        {
            'code': '610632',
            'val': '黄陵县'
        }
    ],
    '610700': [
        {
            'code': '610701',
            'val': '市辖区'
        },
        {
            'code': '610702',
            'val': '汉台区'
        },
        {
            'code': '610721',
            'val': '南郑县'
        },
        {
            'code': '610722',
            'val': '城固县'
        },
        {
            'code': '610723',
            'val': '洋县'
        },
        {
            'code': '610724',
            'val': '西乡县'
        },
        {
            'code': '610725',
            'val': '勉县'
        },
        {
            'code': '610726',
            'val': '宁强县'
        },
        {
            'code': '610727',
            'val': '略阳县'
        },
        {
            'code': '610728',
            'val': '镇巴县'
        },
        {
            'code': '610729',
            'val': '留坝县'
        },
        {
            'code': '610730',
            'val': '佛坪县'
        }
    ],
    '610800': [
        {
            'code': '610801',
            'val': '市辖区'
        },
        {
            'code': '610802',
            'val': '榆阳区'
        },
        {
            'code': '610821',
            'val': '神木县'
        },
        {
            'code': '610822',
            'val': '府谷县'
        },
        {
            'code': '610823',
            'val': '横山县'
        },
        {
            'code': '610824',
            'val': '靖边县'
        },
        {
            'code': '610825',
            'val': '定边县'
        },
        {
            'code': '610826',
            'val': '绥德县'
        },
        {
            'code': '610827',
            'val': '米脂县'
        },
        {
            'code': '610828',
            'val': '佳县'
        },
        {
            'code': '610829',
            'val': '吴堡县'
        },
        {
            'code': '610830',
            'val': '清涧县'
        },
        {
            'code': '610831',
            'val': '子洲县'
        }
    ],
    '610900': [
        {
            'code': '610901',
            'val': '市辖区'
        },
        {
            'code': '610902',
            'val': '汉滨区'
        },
        {
            'code': '610921',
            'val': '汉阴县'
        },
        {
            'code': '610922',
            'val': '石泉县'
        },
        {
            'code': '610923',
            'val': '宁陕县'
        },
        {
            'code': '610924',
            'val': '紫阳县'
        },
        {
            'code': '610925',
            'val': '岚皋县'
        },
        {
            'code': '610926',
            'val': '平利县'
        },
        {
            'code': '610927',
            'val': '镇坪县'
        },
        {
            'code': '610928',
            'val': '旬阳县'
        },
        {
            'code': '610929',
            'val': '白河县'
        }
    ],
    '611000': [
        {
            'code': '611001',
            'val': '市辖区'
        },
        {
            'code': '611002',
            'val': '商州区'
        },
        {
            'code': '611021',
            'val': '洛南县'
        },
        {
            'code': '611022',
            'val': '丹凤县'
        },
        {
            'code': '611023',
            'val': '商南县'
        },
        {
            'code': '611024',
            'val': '山阳县'
        },
        {
            'code': '611025',
            'val': '镇安县'
        },
        {
            'code': '611026',
            'val': '柞水县'
        }
    ],
    '620100': [
        {
            'code': '620101',
            'val': '市辖区'
        },
        {
            'code': '620102',
            'val': '城关区'
        },
        {
            'code': '620103',
            'val': '七里河区'
        },
        {
            'code': '620104',
            'val': '西固区'
        },
        {
            'code': '620105',
            'val': '安宁区'
        },
        {
            'code': '620111',
            'val': '红古区'
        },
        {
            'code': '620121',
            'val': '永登县'
        },
        {
            'code': '620122',
            'val': '皋兰县'
        },
        {
            'code': '620123',
            'val': '榆中县'
        }
    ],
    '620200': [
        {
            'code': '620201',
            'val': '市辖区'
        }
    ],
    '620300': [
        {
            'code': '620301',
            'val': '市辖区'
        },
        {
            'code': '620302',
            'val': '金川区'
        },
        {
            'code': '620321',
            'val': '永昌县'
        }
    ],
    '620400': [
        {
            'code': '620401',
            'val': '市辖区'
        },
        {
            'code': '620402',
            'val': '白银区'
        },
        {
            'code': '620403',
            'val': '平川区'
        },
        {
            'code': '620421',
            'val': '靖远县'
        },
        {
            'code': '620422',
            'val': '会宁县'
        },
        {
            'code': '620423',
            'val': '景泰县'
        }
    ],
    '620500': [
        {
            'code': '620501',
            'val': '市辖区'
        },
        {
            'code': '620502',
            'val': '秦城区'
        },
        {
            'code': '620503',
            'val': '北道区'
        },
        {
            'code': '620521',
            'val': '清水县'
        },
        {
            'code': '620522',
            'val': '秦安县'
        },
        {
            'code': '620523',
            'val': '甘谷县'
        },
        {
            'code': '620524',
            'val': '武山县'
        },
        {
            'code': '620525',
            'val': '张家川回族自治县'
        }
    ],
    '620600': [
        {
            'code': '620601',
            'val': '市辖区'
        },
        {
            'code': '620602',
            'val': '凉州区'
        },
        {
            'code': '620621',
            'val': '民勤县'
        },
        {
            'code': '620622',
            'val': '古浪县'
        },
        {
            'code': '620623',
            'val': '天祝藏族自治县'
        }
    ],
    '620700': [
        {
            'code': '620701',
            'val': '市辖区'
        },
        {
            'code': '620702',
            'val': '甘州区'
        },
        {
            'code': '620721',
            'val': '肃南裕固族自治县'
        },
        {
            'code': '620722',
            'val': '民乐县'
        },
        {
            'code': '620723',
            'val': '临泽县'
        },
        {
            'code': '620724',
            'val': '高台县'
        },
        {
            'code': '620725',
            'val': '山丹县'
        }
    ],
    '620800': [
        {
            'code': '620801',
            'val': '市辖区'
        },
        {
            'code': '620802',
            'val': '崆峒区'
        },
        {
            'code': '620821',
            'val': '泾川县'
        },
        {
            'code': '620822',
            'val': '灵台县'
        },
        {
            'code': '620823',
            'val': '崇信县'
        },
        {
            'code': '620824',
            'val': '华亭县'
        },
        {
            'code': '620825',
            'val': '庄浪县'
        },
        {
            'code': '620826',
            'val': '静宁县'
        }
    ],
    '620900': [
        {
            'code': '620901',
            'val': '市辖区'
        },
        {
            'code': '620902',
            'val': '肃州区'
        },
        {
            'code': '620921',
            'val': '金塔县'
        },
        {
            'code': '620922',
            'val': '安西县'
        },
        {
            'code': '620923',
            'val': '肃北蒙古族自治县'
        },
        {
            'code': '620924',
            'val': '阿克塞哈萨克族自治县'
        },
        {
            'code': '620981',
            'val': '玉门市'
        },
        {
            'code': '620982',
            'val': '敦煌市'
        }
    ],
    '621000': [
        {
            'code': '621001',
            'val': '市辖区'
        },
        {
            'code': '621002',
            'val': '西峰区'
        },
        {
            'code': '621021',
            'val': '庆城县'
        },
        {
            'code': '621022',
            'val': '环县'
        },
        {
            'code': '621023',
            'val': '华池县'
        },
        {
            'code': '621024',
            'val': '合水县'
        },
        {
            'code': '621025',
            'val': '正宁县'
        },
        {
            'code': '621026',
            'val': '宁县'
        },
        {
            'code': '621027',
            'val': '镇原县'
        }
    ],
    '621100': [
        {
            'code': '621101',
            'val': '市辖区'
        },
        {
            'code': '621102',
            'val': '安定区'
        },
        {
            'code': '621121',
            'val': '通渭县'
        },
        {
            'code': '621122',
            'val': '陇西县'
        },
        {
            'code': '621123',
            'val': '渭源县'
        },
        {
            'code': '621124',
            'val': '临洮县'
        },
        {
            'code': '621125',
            'val': '漳县'
        },
        {
            'code': '621126',
            'val': '岷县'
        }
    ],
    '621200': [
        {
            'code': '621201',
            'val': '市辖区'
        },
        {
            'code': '621202',
            'val': '武都区'
        },
        {
            'code': '621221',
            'val': '成县'
        },
        {
            'code': '621222',
            'val': '文县'
        },
        {
            'code': '621223',
            'val': '宕昌县'
        },
        {
            'code': '621224',
            'val': '康县'
        },
        {
            'code': '621225',
            'val': '西和县'
        },
        {
            'code': '621226',
            'val': '礼县'
        },
        {
            'code': '621227',
            'val': '徽县'
        },
        {
            'code': '621228',
            'val': '两当县'
        }
    ],
    '622900': [
        {
            'code': '622901',
            'val': '临夏市'
        },
        {
            'code': '622921',
            'val': '临夏县'
        },
        {
            'code': '622922',
            'val': '康乐县'
        },
        {
            'code': '622923',
            'val': '永靖县'
        },
        {
            'code': '622924',
            'val': '广河县'
        },
        {
            'code': '622925',
            'val': '和政县'
        },
        {
            'code': '622926',
            'val': '东乡族自治县'
        }
    ],
    '623000': [
        {
            'code': '623001',
            'val': '合作市'
        },
        {
            'code': '623021',
            'val': '临潭县'
        },
        {
            'code': '623022',
            'val': '卓尼县'
        },
        {
            'code': '623023',
            'val': '舟曲县'
        },
        {
            'code': '623024',
            'val': '迭部县'
        },
        {
            'code': '623025',
            'val': '玛曲县'
        },
        {
            'code': '623026',
            'val': '碌曲县'
        },
        {
            'code': '623027',
            'val': '夏河县'
        }
    ],
    '630100': [
        {
            'code': '630101',
            'val': '市辖区'
        },
        {
            'code': '630102',
            'val': '城东区'
        },
        {
            'code': '630103',
            'val': '城中区'
        },
        {
            'code': '630104',
            'val': '城西区'
        },
        {
            'code': '630105',
            'val': '城北区'
        },
        {
            'code': '630121',
            'val': '大通回族土族自治县'
        },
        {
            'code': '630122',
            'val': '湟中县'
        },
        {
            'code': '630123',
            'val': '湟源县'
        }
    ],
    '632100': [
        {
            'code': '632121',
            'val': '平安县'
        },
        {
            'code': '632122',
            'val': '民和回族土族自治县'
        },
        {
            'code': '632123',
            'val': '乐都县'
        },
        {
            'code': '632126',
            'val': '互助土族自治县'
        },
        {
            'code': '632127',
            'val': '化隆回族自治县'
        },
        {
            'code': '632128',
            'val': '循化撒拉族自治县'
        }
    ],
    '632200': [
        {
            'code': '632221',
            'val': '门源回族自治县'
        },
        {
            'code': '632222',
            'val': '祁连县'
        },
        {
            'code': '632223',
            'val': '海晏县'
        },
        {
            'code': '632224',
            'val': '刚察县'
        }
    ],
    '632300': [
        {
            'code': '632321',
            'val': '同仁县'
        },
        {
            'code': '632322',
            'val': '尖扎县'
        },
        {
            'code': '632323',
            'val': '泽库县'
        },
        {
            'code': '632324',
            'val': '河南蒙古族自治县'
        }
    ],
    '632500': [
        {
            'code': '632521',
            'val': '共和县'
        },
        {
            'code': '632522',
            'val': '同德县'
        },
        {
            'code': '632523',
            'val': '贵德县'
        },
        {
            'code': '632524',
            'val': '兴海县'
        },
        {
            'code': '632525',
            'val': '贵南县'
        }
    ],
    '632600': [
        {
            'code': '632621',
            'val': '玛沁县'
        },
        {
            'code': '632622',
            'val': '班玛县'
        },
        {
            'code': '632623',
            'val': '甘德县'
        },
        {
            'code': '632624',
            'val': '达日县'
        },
        {
            'code': '632625',
            'val': '久治县'
        },
        {
            'code': '632626',
            'val': '玛多县'
        }
    ],
    '632700': [
        {
            'code': '632721',
            'val': '玉树县'
        },
        {
            'code': '632722',
            'val': '杂多县'
        },
        {
            'code': '632723',
            'val': '称多县'
        },
        {
            'code': '632724',
            'val': '治多县'
        },
        {
            'code': '632725',
            'val': '囊谦县'
        },
        {
            'code': '632726',
            'val': '曲麻莱县'
        }
    ],
    '632800': [
        {
            'code': '632801',
            'val': '格尔木市'
        },
        {
            'code': '632802',
            'val': '德令哈市'
        },
        {
            'code': '632821',
            'val': '乌兰县'
        },
        {
            'code': '632822',
            'val': '都兰县'
        },
        {
            'code': '632823',
            'val': '天峻县'
        }
    ],
    '640100': [
        {
            'code': '640101',
            'val': '市辖区'
        },
        {
            'code': '640104',
            'val': '兴庆区'
        },
        {
            'code': '640105',
            'val': '西夏区'
        },
        {
            'code': '640106',
            'val': '金凤区'
        },
        {
            'code': '640121',
            'val': '永宁县'
        },
        {
            'code': '640122',
            'val': '贺兰县'
        },
        {
            'code': '640181',
            'val': '灵武市'
        }
    ],
    '640200': [
        {
            'code': '640201',
            'val': '市辖区'
        },
        {
            'code': '640202',
            'val': '大武口区'
        },
        {
            'code': '640205',
            'val': '惠农区'
        },
        {
            'code': '640221',
            'val': '平罗县'
        }
    ],
    '640300': [
        {
            'code': '640301',
            'val': '市辖区'
        },
        {
            'code': '640302',
            'val': '利通区'
        },
        {
            'code': '640323',
            'val': '盐池县'
        },
        {
            'code': '640324',
            'val': '同心县'
        },
        {
            'code': '640381',
            'val': '青铜峡市'
        }
    ],
    '640400': [
        {
            'code': '640401',
            'val': '市辖区'
        },
        {
            'code': '640402',
            'val': '原州区'
        },
        {
            'code': '640422',
            'val': '西吉县'
        },
        {
            'code': '640423',
            'val': '隆德县'
        },
        {
            'code': '640424',
            'val': '泾源县'
        },
        {
            'code': '640425',
            'val': '彭阳县'
        }
    ],
    '640500': [
        {
            'code': '640501',
            'val': '市辖区'
        },
        {
            'code': '640502',
            'val': '沙坡头区'
        },
        {
            'code': '640521',
            'val': '中宁县'
        },
        {
            'code': '640522',
            'val': '海原县'
        }
    ],
    '650100': [
        {
            'code': '650101',
            'val': '市辖区'
        },
        {
            'code': '650102',
            'val': '天山区'
        },
        {
            'code': '650103',
            'val': '沙依巴克区'
        },
        {
            'code': '650104',
            'val': '新市区'
        },
        {
            'code': '650105',
            'val': '水磨沟区'
        },
        {
            'code': '650106',
            'val': '头屯河区'
        },
        {
            'code': '650107',
            'val': '达坂城区'
        },
        {
            'code': '650108',
            'val': '东山区'
        },
        {
            'code': '650121',
            'val': '乌鲁木齐县'
        }
    ],
    '650200': [
        {
            'code': '650201',
            'val': '市辖区'
        },
        {
            'code': '650202',
            'val': '独山子区'
        },
        {
            'code': '650203',
            'val': '克拉玛依区'
        },
        {
            'code': '650204',
            'val': '白碱滩区'
        },
        {
            'code': '650205',
            'val': '乌尔禾区'
        }
    ],
    '652100': [
        {
            'code': '652101',
            'val': '吐鲁番市'
        },
        {
            'code': '652122',
            'val': '鄯善县'
        },
        {
            'code': '652123',
            'val': '托克逊县'
        }
    ],
    '652200': [
        {
            'code': '652201',
            'val': '哈密市'
        },
        {
            'code': '652222',
            'val': '巴里坤哈萨克自治县'
        },
        {
            'code': '652223',
            'val': '伊吾县'
        }
    ],
    '652300': [
        {
            'code': '652301',
            'val': '昌吉市'
        },
        {
            'code': '652302',
            'val': '阜康市'
        },
        {
            'code': '652303',
            'val': '米泉市'
        },
        {
            'code': '652323',
            'val': '呼图壁县'
        },
        {
            'code': '652324',
            'val': '玛纳斯县'
        },
        {
            'code': '652325',
            'val': '奇台县'
        },
        {
            'code': '652327',
            'val': '吉木萨尔县'
        },
        {
            'code': '652328',
            'val': '木垒哈萨克自治县'
        }
    ],
    '652700': [
        {
            'code': '652701',
            'val': '博乐市'
        },
        {
            'code': '652722',
            'val': '精河县'
        },
        {
            'code': '652723',
            'val': '温泉县'
        }
    ],
    '652800': [
        {
            'code': '652801',
            'val': '库尔勒市'
        },
        {
            'code': '652822',
            'val': '轮台县'
        },
        {
            'code': '652823',
            'val': '尉犁县'
        },
        {
            'code': '652824',
            'val': '若羌县'
        },
        {
            'code': '652825',
            'val': '且末县'
        },
        {
            'code': '652826',
            'val': '焉耆回族自治县'
        },
        {
            'code': '652827',
            'val': '和静县'
        },
        {
            'code': '652828',
            'val': '和硕县'
        },
        {
            'code': '652829',
            'val': '博湖县'
        }
    ],
    '652900': [
        {
            'code': '652901',
            'val': '阿克苏市'
        },
        {
            'code': '652922',
            'val': '温宿县'
        },
        {
            'code': '652923',
            'val': '库车县'
        },
        {
            'code': '652924',
            'val': '沙雅县'
        },
        {
            'code': '652925',
            'val': '新和县'
        },
        {
            'code': '652926',
            'val': '拜城县'
        },
        {
            'code': '652927',
            'val': '乌什县'
        },
        {
            'code': '652928',
            'val': '阿瓦提县'
        },
        {
            'code': '652929',
            'val': '柯坪县'
        }
    ],
    '653000': [
        {
            'code': '653001',
            'val': '阿图什市'
        },
        {
            'code': '653022',
            'val': '阿克陶县'
        },
        {
            'code': '653023',
            'val': '阿合奇县'
        },
        {
            'code': '653024',
            'val': '乌恰县'
        }
    ],
    '653100': [
        {
            'code': '653101',
            'val': '喀什市'
        },
        {
            'code': '653121',
            'val': '疏附县'
        },
        {
            'code': '653122',
            'val': '疏勒县'
        },
        {
            'code': '653123',
            'val': '英吉沙县'
        },
        {
            'code': '653124',
            'val': '泽普县'
        },
        {
            'code': '653125',
            'val': '莎车县'
        },
        {
            'code': '653126',
            'val': '叶城县'
        },
        {
            'code': '653127',
            'val': '麦盖提县'
        },
        {
            'code': '653128',
            'val': '岳普湖县'
        },
        {
            'code': '653129',
            'val': '伽师县'
        },
        {
            'code': '653130',
            'val': '巴楚县'
        },
        {
            'code': '653131',
            'val': '塔什库尔干塔吉克自治县'
        }
    ],
    '653200': [
        {
            'code': '653201',
            'val': '和田市'
        },
        {
            'code': '653221',
            'val': '和田县'
        },
        {
            'code': '653222',
            'val': '墨玉县'
        },
        {
            'code': '653223',
            'val': '皮山县'
        },
        {
            'code': '653224',
            'val': '洛浦县'
        },
        {
            'code': '653225',
            'val': '策勒县'
        },
        {
            'code': '653226',
            'val': '于田县'
        },
        {
            'code': '653227',
            'val': '民丰县'
        }
    ],
    '654000': [
        {
            'code': '654002',
            'val': '伊宁市'
        },
        {
            'code': '654003',
            'val': '奎屯市'
        },
        {
            'code': '654021',
            'val': '伊宁县'
        },
        {
            'code': '654022',
            'val': '察布查尔锡伯自治县'
        },
        {
            'code': '654023',
            'val': '霍城县'
        },
        {
            'code': '654024',
            'val': '巩留县'
        },
        {
            'code': '654025',
            'val': '新源县'
        },
        {
            'code': '654026',
            'val': '昭苏县'
        },
        {
            'code': '654027',
            'val': '特克斯县'
        },
        {
            'code': '654028',
            'val': '尼勒克县'
        }
    ],
    '654200': [
        {
            'code': '654201',
            'val': '塔城市'
        },
        {
            'code': '654202',
            'val': '乌苏市'
        },
        {
            'code': '654221',
            'val': '额敏县'
        },
        {
            'code': '654223',
            'val': '沙湾县'
        },
        {
            'code': '654224',
            'val': '托里县'
        },
        {
            'code': '654225',
            'val': '裕民县'
        },
        {
            'code': '654226',
            'val': '和布克赛尔蒙古自治县'
        }
    ],
    '654300': [
        {
            'code': '654301',
            'val': '阿勒泰市'
        },
        {
            'code': '654321',
            'val': '布尔津县'
        },
        {
            'code': '654322',
            'val': '富蕴县'
        },
        {
            'code': '654323',
            'val': '福海县'
        },
        {
            'code': '654324',
            'val': '哈巴河县'
        },
        {
            'code': '654325',
            'val': '青河县'
        },
        {
            'code': '654326',
            'val': '吉木乃县'
        }
    ],
    '659000': [
        {
            'code': '659001',
            'val': '石河子市'
        },
        {
            'code': '659002',
            'val': '阿拉尔市'
        },
        {
            'code': '659003',
            'val': '图木舒克市'
        },
        {
            'code': '659004',
            'val': '五家渠市'
        }
    ]
};
