/**
 * Created by admin on 2017/5/25.
 */
export const hkProvinces = [
    {
        'code': '110000',
        'val': '北京市'
    },
    {
        'code': '310000',
        'val': '上海市'
    },
    {
        'code': '320000',
        'val': '江苏省'
    },
    {
        'code': '410000',
        'val': '河南省'
    }
];

export const hkCitys = {
    '110000': [
        {
            'code': '110100',
            'val': '市辖区'
        },
        {
            'code': '110200',
            'val': '县'
        }
    ],
    '310000': [
        {
            'code': '310100',
            'val': '市辖区'
        },
        {
            'code': '310200',
            'val': '县'
        }
    ],
    '320000': [
        {
            'code': '320100',
            'val': '南京市'
        },
        {
            'code': '320200',
            'val': '无锡市'
        },
        {
            'code': '320300',
            'val': '徐州市'
        },
        {
            'code': '320400',
            'val': '常州市'
        },
        {
            'code': '320500',
            'val': '苏州市'
        },
        {
            'code': '320600',
            'val': '南通市'
        },
        {
            'code': '320700',
            'val': '连云港市'
        },
        {
            'code': '320800',
            'val': '淮安市'
        },
        {
            'code': '320900',
            'val': '盐城市'
        },
        {
            'code': '321000',
            'val': '扬州市'
        },
        {
            'code': '321100',
            'val': '镇江市'
        },
        {
            'code': '321200',
            'val': '泰州市'
        },
        {
            'code': '321300',
            'val': '宿迁市'
        }
    ],
    '410000': [
        {
            'code': '410100',
            'val': '郑州市'
        },
        {
            'code': '410200',
            'val': '开封市'
        },
        {
            'code': '410300',
            'val': '洛阳市'
        },
        {
            'code': '410400',
            'val': '平顶山市'
        },
        {
            'code': '410500',
            'val': '安阳市'
        },
        {
            'code': '410600',
            'val': '鹤壁市'
        },
        {
            'code': '410700',
            'val': '新乡市'
        },
        {
            'code': '410800',
            'val': '焦作市'
        },
        {
            'code': '410900',
            'val': '濮阳市'
        },
        {
            'code': '411000',
            'val': '许昌市'
        },
        {
            'code': '411100',
            'val': '漯河市'
        },
        {
            'code': '411200',
            'val': '三门峡市'
        },
        {
            'code': '411300',
            'val': '南阳市'
        },
        {
            'code': '411400',
            'val': '商丘市'
        },
        {
            'code': '411500',
            'val': '信阳市'
        },
        {
            'code': '411600',
            'val': '周口市'
        },
        {
            'code': '411700',
            'val': '驻马店市'
        },
        {
            'code': '419000',
            'val': '省直辖县级行政区划'
        }
    ]
};

export const hkDistricts = {
    '110100': [
        {
            'code': '110101',
            'val': '东城区'
        },
        {
            'code': '110102',
            'val': '西城区'
        },
        {
            'code': '110103',
            'val': '崇文区'
        },
        {
            'code': '110104',
            'val': '宣武区'
        },
        {
            'code': '110105',
            'val': '朝阳区'
        },
        {
            'code': '110106',
            'val': '丰台区'
        },
        {
            'code': '110107',
            'val': '石景山区'
        },
        {
            'code': '110108',
            'val': '海淀区'
        },
        {
            'code': '110109',
            'val': '门头沟区'
        },
        {
            'code': '110111',
            'val': '房山区'
        },
        {
            'code': '110112',
            'val': '通州区'
        },
        {
            'code': '110113',
            'val': '顺义区'
        },
        {
            'code': '110114',
            'val': '昌平区'
        },
        {
            'code': '110115',
            'val': '大兴区'
        },
        {
            'code': '110116',
            'val': '怀柔区'
        },
        {
            'code': '110117',
            'val': '平谷区'
        }
    ],
    '110200': [
        {
            'code': '110228',
            'val': '密云县'
        },
        {
            'code': '110229',
            'val': '延庆县'
        }
    ],
    '310100': [
        {
            'code': '310100',
            'val': '市辖区'
        },
        {
            'code': '310101',
            'val': '黄浦区'
        },
        {
            'code': '310104',
            'val': '徐汇区'
        },
        {
            'code': '310105',
            'val': '长宁区'
        },
        {
            'code': '310106',
            'val': '静安区'
        },
        {
            'code': '310107',
            'val': '普陀区'
        },
        {
            'code': '310108',
            'val': '闸北区'
        },
        {
            'code': '310109',
            'val': '虹口区'
        },
        {
            'code': '310110',
            'val': '杨浦区'
        },
        {
            'code': '310112',
            'val': '闵行区'
        },
        {
            'code': '310113',
            'val': '宝山区'
        },
        {
            'code': '310114',
            'val': '嘉定区'
        },
        {
            'code': '310115',
            'val': '浦东新区'
        },
        {
            'code': '310116',
            'val': '金山区'
        },
        {
            'code': '310117',
            'val': '松江区'
        },
        {
            'code': '310118',
            'val': '青浦区'
        },
        {
            'code': '310120',
            'val': '奉贤区'
        }
    ],
    '310200': [
        {
            'code': '310230',
            'val': '崇明县'
        }
    ],
    '320100': [
        {
            'code': '320101',
            'val': '市辖区'
        },
        {
            'code': '320102',
            'val': '玄武区'
        },
        {
            'code': '320104',
            'val': '秦淮区'
        },
        {
            'code': '320105',
            'val': '建邺区'
        },
        {
            'code': '320106',
            'val': '鼓楼区'
        },
        {
            'code': '320111',
            'val': '浦口区'
        },
        {
            'code': '320113',
            'val': '栖霞区'
        },
        {
            'code': '320114',
            'val': '雨花台区'
        },
        {
            'code': '320115',
            'val': '江宁区'
        },
        {
            'code': '320116',
            'val': '六合区'
        },
        {
            'code': '320117',
            'val': '溧水区'
        },
        {
            'code': '320118',
            'val': '高淳区'
        }
    ],
    '320200': [
        {
            'code': '320201',
            'val': '市辖区'
        },
        {
            'code': '320202',
            'val': '崇安区'
        },
        {
            'code': '320203',
            'val': '南长区'
        },
        {
            'code': '320204',
            'val': '北塘区'
        },
        {
            'code': '320205',
            'val': '锡山区'
        },
        {
            'code': '320206',
            'val': '惠山区'
        },
        {
            'code': '320211',
            'val': '滨湖区'
        },
        {
            'code': '320281',
            'val': '江阴市'
        },
        {
            'code': '320282',
            'val': '宜兴市'
        }
    ],
    '320300': [
        {
            'code': '320301',
            'val': '市辖区'
        },
        {
            'code': '320302',
            'val': '鼓楼区'
        },
        {
            'code': '320303',
            'val': '云龙区'
        },
        {
            'code': '320305',
            'val': '贾汪区'
        },
        {
            'code': '320311',
            'val': '泉山区'
        },
        {
            'code': '320312',
            'val': '铜山区'
        },
        {
            'code': '320321',
            'val': '丰县'
        },
        {
            'code': '320322',
            'val': '沛县'
        },
        {
            'code': '320324',
            'val': '睢宁县'
        },
        {
            'code': '320381',
            'val': '新沂市'
        },
        {
            'code': '320382',
            'val': '邳州市'
        }
    ],
    '320400': [
        {
            'code': '320401',
            'val': '市辖区'
        },
        {
            'code': '320402',
            'val': '天宁区'
        },
        {
            'code': '320404',
            'val': '钟楼区'
        },
        {
            'code': '320405',
            'val': '戚墅堰区'
        },
        {
            'code': '320411',
            'val': '新北区'
        },
        {
            'code': '320412',
            'val': '武进区'
        },
        {
            'code': '320413',
            'val': '金坛区'
        },
        {
            'code': '320481',
            'val': '溧阳市'
        },
        {
            'code': '320482',
            'val': '金坛市'
        }
    ],
    '320500': [
        {
            'code': '320501',
            'val': '市辖区'
        },
        {
            'code': '320505',
            'val': '虎丘区'
        },
        {
            'code': '320506',
            'val': '吴中区'
        },
        {
            'code': '320507',
            'val': '相城区'
        },
        {
            'code': '320508',
            'val': '姑苏区'
        },
        {
            'code': '320509',
            'val': '吴江区'
        },
        {
            'code': '320581',
            'val': '常熟市'
        },
        {
            'code': '320582',
            'val': '张家港市'
        },
        {
            'code': '320583',
            'val': '昆山市'
        },
        {
            'code': '320585',
            'val': '太仓市'
        }
    ],
    '320600': [
        {
            'code': '320601',
            'val': '市辖区'
        },
        {
            'code': '320602',
            'val': '崇川区'
        },
        {
            'code': '320611',
            'val': '港闸区'
        },
        {
            'code': '320612',
            'val': '通州区'
        },
        {
            'code': '320621',
            'val': '海安县'
        },
        {
            'code': '320623',
            'val': '如东县'
        },
        {
            'code': '320681',
            'val': '启东市'
        },
        {
            'code': '320682',
            'val': '如皋市'
        },
        {
            'code': '320684',
            'val': '海门市'
        }
    ],
    '320700': [
        {
            'code': '320701',
            'val': '市辖区'
        },
        {
            'code': '320703',
            'val': '连云区'
        },
        {
            'code': '320706',
            'val': '海州区'
        },
        {
            'code': '320707',
            'val': '赣榆区'
        },
        {
            'code': '320722',
            'val': '东海县'
        },
        {
            'code': '320723',
            'val': '灌云县'
        },
        {
            'code': '320724',
            'val': '灌南县'
        }
    ],
    '320800': [
        {
            'code': '320801',
            'val': '市辖区'
        },
        {
            'code': '320802',
            'val': '清河区'
        },
        {
            'code': '320803',
            'val': '淮安区'
        },
        {
            'code': '320804',
            'val': '淮阴区'
        },
        {
            'code': '320811',
            'val': '清浦区'
        },
        {
            'code': '320826',
            'val': '涟水县'
        },
        {
            'code': '320829',
            'val': '洪泽县'
        },
        {
            'code': '320830',
            'val': '盱眙县'
        },
        {
            'code': '320831',
            'val': '金湖县'
        }
    ],
    '320900': [
        {
            'code': '320901',
            'val': '市辖区'
        },
        {
            'code': '320902',
            'val': '亭湖区'
        },
        {
            'code': '320903',
            'val': '盐都区'
        },
        {
            'code': '320904',
            'val': '大丰区'
        },
        {
            'code': '320921',
            'val': '响水县'
        },
        {
            'code': '320922',
            'val': '滨海县'
        },
        {
            'code': '320923',
            'val': '阜宁县'
        },
        {
            'code': '320924',
            'val': '射阳县'
        },
        {
            'code': '320925',
            'val': '建湖县'
        },
        {
            'code': '320981',
            'val': '东台市'
        },
        {
            'code': '320982',
            'val': '大丰市'
        }
    ],
    '321000': [
        {
            'code': '321001',
            'val': '市辖区'
        },
        {
            'code': '321002',
            'val': '广陵区'
        },
        {
            'code': '321003',
            'val': '邗江区'
        },
        {
            'code': '321012',
            'val': '江都区'
        },
        {
            'code': '321023',
            'val': '宝应县'
        },
        {
            'code': '321081',
            'val': '仪征市'
        },
        {
            'code': '321084',
            'val': '高邮市'
        }
    ],
    '321100': [
        {
            'code': '321101',
            'val': '市辖区'
        },
        {
            'code': '321102',
            'val': '京口区'
        },
        {
            'code': '321111',
            'val': '润州区'
        },
        {
            'code': '321112',
            'val': '丹徒区'
        },
        {
            'code': '321181',
            'val': '丹阳市'
        },
        {
            'code': '321182',
            'val': '扬中市'
        },
        {
            'code': '321183',
            'val': '句容市'
        }
    ],
    '321200': [
        {
            'code': '321201',
            'val': '市辖区'
        },
        {
            'code': '321202',
            'val': '海陵区'
        },
        {
            'code': '321203',
            'val': '高港区'
        },
        {
            'code': '321204',
            'val': '姜堰区'
        },
        {
            'code': '321281',
            'val': '兴化市'
        },
        {
            'code': '321282',
            'val': '靖江市'
        },
        {
            'code': '321283',
            'val': '泰兴市'
        }
    ],
    '321300': [
        {
            'code': '321301',
            'val': '市辖区'
        },
        {
            'code': '321302',
            'val': '宿城区'
        },
        {
            'code': '321311',
            'val': '宿豫区'
        },
        {
            'code': '321322',
            'val': '沭阳县'
        },
        {
            'code': '321323',
            'val': '泗阳县'
        },
        {
            'code': '321324',
            'val': '泗洪县'
        }
    ],
    '410100': [
        {
            'code': '410101',
            'val': '市辖区'
        },
        {
            'code': '410102',
            'val': '中原区'
        },
        {
            'code': '410103',
            'val': '二七区'
        },
        {
            'code': '410104',
            'val': '管城回族区'
        },
        {
            'code': '410105',
            'val': '金水区'
        },
        {
            'code': '410106',
            'val': '上街区'
        },
        {
            'code': '410108',
            'val': '惠济区'
        },
        {
            'code': '410122',
            'val': '中牟县'
        },
        {
            'code': '410181',
            'val': '巩义市'
        },
        {
            'code': '410182',
            'val': '荥阳市'
        },
        {
            'code': '410183',
            'val': '新密市'
        },
        {
            'code': '410184',
            'val': '新郑市'
        },
        {
            'code': '410185',
            'val': '登封市'
        }
    ],
    '410200': [
        {
            'code': '410201',
            'val': '市辖区'
        },
        {
            'code': '410202',
            'val': '龙亭区'
        },
        {
            'code': '410203',
            'val': '顺河回族区'
        },
        {
            'code': '410204',
            'val': '鼓楼区'
        },
        {
            'code': '410205',
            'val': '禹王台区'
        },
        {
            'code': '410211',
            'val': '金明区'
        },
        {
            'code': '410212',
            'val': '祥符区'
        },
        {
            'code': '410221',
            'val': '杞县'
        },
        {
            'code': '410222',
            'val': '通许县'
        },
        {
            'code': '410223',
            'val': '尉氏县'
        },
        {
            'code': '410224',
            'val': '开封县'
        },
        {
            'code': '410225',
            'val': '兰考县'
        }
    ],
    '410300': [
        {
            'code': '410301',
            'val': '市辖区'
        },
        {
            'code': '410302',
            'val': '老城区'
        },
        {
            'code': '410303',
            'val': '西工区'
        },
        {
            'code': '410304',
            'val': '瀍河回族区'
        },
        {
            'code': '410305',
            'val': '涧西区'
        },
        {
            'code': '410306',
            'val': '吉利区'
        },
        {
            'code': '410311',
            'val': '洛龙区'
        },
        {
            'code': '410322',
            'val': '孟津县'
        },
        {
            'code': '410323',
            'val': '新安县'
        },
        {
            'code': '410324',
            'val': '栾川县'
        },
        {
            'code': '410325',
            'val': '嵩县'
        },
        {
            'code': '410326',
            'val': '汝阳县'
        },
        {
            'code': '410327',
            'val': '宜阳县'
        },
        {
            'code': '410328',
            'val': '洛宁县'
        },
        {
            'code': '410329',
            'val': '伊川县'
        },
        {
            'code': '410381',
            'val': '偃师市'
        }
    ],
    '410400': [
        {
            'code': '410401',
            'val': '市辖区'
        },
        {
            'code': '410402',
            'val': '新华区'
        },
        {
            'code': '410403',
            'val': '卫东区'
        },
        {
            'code': '410404',
            'val': '石龙区'
        },
        {
            'code': '410411',
            'val': '湛河区'
        },
        {
            'code': '410421',
            'val': '宝丰县'
        },
        {
            'code': '410422',
            'val': '叶县'
        },
        {
            'code': '410423',
            'val': '鲁山县'
        },
        {
            'code': '410425',
            'val': '郏县'
        },
        {
            'code': '410481',
            'val': '舞钢市'
        },
        {
            'code': '410482',
            'val': '汝州市'
        }
    ],
    '410500': [
        {
            'code': '410501',
            'val': '市辖区'
        },
        {
            'code': '410502',
            'val': '文峰区'
        },
        {
            'code': '410503',
            'val': '北关区'
        },
        {
            'code': '410505',
            'val': '殷都区'
        },
        {
            'code': '410506',
            'val': '龙安区'
        },
        {
            'code': '410522',
            'val': '安阳县'
        },
        {
            'code': '410523',
            'val': '汤阴县'
        },
        {
            'code': '410526',
            'val': '滑县'
        },
        {
            'code': '410527',
            'val': '内黄县'
        },
        {
            'code': '410581',
            'val': '林州市'
        }
    ],
    '410600': [
        {
            'code': '410601',
            'val': '市辖区'
        },
        {
            'code': '410602',
            'val': '鹤山区'
        },
        {
            'code': '410603',
            'val': '山城区'
        },
        {
            'code': '410611',
            'val': '淇滨区'
        },
        {
            'code': '410621',
            'val': '浚县'
        },
        {
            'code': '410622',
            'val': '淇县'
        }
    ],
    '410700': [
        {
            'code': '410701',
            'val': '市辖区'
        },
        {
            'code': '410702',
            'val': '红旗区'
        },
        {
            'code': '410703',
            'val': '卫滨区'
        },
        {
            'code': '410704',
            'val': '凤泉区'
        },
        {
            'code': '410711',
            'val': '牧野区'
        },
        {
            'code': '410721',
            'val': '新乡县'
        },
        {
            'code': '410724',
            'val': '获嘉县'
        },
        {
            'code': '410725',
            'val': '原阳县'
        },
        {
            'code': '410726',
            'val': '延津县'
        },
        {
            'code': '410727',
            'val': '封丘县'
        },
        {
            'code': '410728',
            'val': '长垣县'
        },
        {
            'code': '410781',
            'val': '卫辉市'
        },
        {
            'code': '410782',
            'val': '辉县市'
        }
    ],
    '410800': [
        {
            'code': '410801',
            'val': '市辖区'
        },
        {
            'code': '410802',
            'val': '解放区'
        },
        {
            'code': '410803',
            'val': '中站区'
        },
        {
            'code': '410804',
            'val': '马村区'
        },
        {
            'code': '410811',
            'val': '山阳区'
        },
        {
            'code': '410821',
            'val': '修武县'
        },
        {
            'code': '410822',
            'val': '博爱县'
        },
        {
            'code': '410823',
            'val': '武陟县'
        },
        {
            'code': '410825',
            'val': '温县'
        },
        {
            'code': '410882',
            'val': '沁阳市'
        },
        {
            'code': '410883',
            'val': '孟州市'
        }
    ],
    '410900': [
        {
            'code': '410901',
            'val': '市辖区'
        },
        {
            'code': '410902',
            'val': '华龙区'
        },
        {
            'code': '410922',
            'val': '清丰县'
        },
        {
            'code': '410923',
            'val': '南乐县'
        },
        {
            'code': '410926',
            'val': '范县'
        },
        {
            'code': '410927',
            'val': '台前县'
        },
        {
            'code': '410928',
            'val': '濮阳县'
        }
    ],
    '411000': [
        {
            'code': '411001',
            'val': '市辖区'
        },
        {
            'code': '411002',
            'val': '魏都区'
        },
        {
            'code': '411023',
            'val': '许昌县'
        },
        {
            'code': '411024',
            'val': '鄢陵县'
        },
        {
            'code': '411025',
            'val': '襄城县'
        },
        {
            'code': '411081',
            'val': '禹州市'
        },
        {
            'code': '411082',
            'val': '长葛市'
        }
    ],
    '411100': [
        {
            'code': '411101',
            'val': '市辖区'
        },
        {
            'code': '411102',
            'val': '源汇区'
        },
        {
            'code': '411103',
            'val': '郾城区'
        },
        {
            'code': '411104',
            'val': '召陵区'
        },
        {
            'code': '411121',
            'val': '舞阳县'
        },
        {
            'code': '411122',
            'val': '临颍县'
        }
    ],
    '411200': [
        {
            'code': '411201',
            'val': '市辖区'
        },
        {
            'code': '411202',
            'val': '湖滨区'
        },
        {
            'code': '411203',
            'val': '陕州区'
        },
        {
            'code': '411221',
            'val': '渑池县'
        },
        {
            'code': '411222',
            'val': '陕县'
        },
        {
            'code': '411224',
            'val': '卢氏县'
        },
        {
            'code': '411281',
            'val': '义马市'
        },
        {
            'code': '411282',
            'val': '灵宝市'
        }
    ],
    '411300': [
        {
            'code': '411301',
            'val': '市辖区'
        },
        {
            'code': '411302',
            'val': '宛城区'
        },
        {
            'code': '411303',
            'val': '卧龙区'
        },
        {
            'code': '411321',
            'val': '南召县'
        },
        {
            'code': '411322',
            'val': '方城县'
        },
        {
            'code': '411323',
            'val': '西峡县'
        },
        {
            'code': '411324',
            'val': '镇平县'
        },
        {
            'code': '411325',
            'val': '内乡县'
        },
        {
            'code': '411326',
            'val': '淅川县'
        },
        {
            'code': '411327',
            'val': '社旗县'
        },
        {
            'code': '411328',
            'val': '唐河县'
        },
        {
            'code': '411329',
            'val': '新野县'
        },
        {
            'code': '411330',
            'val': '桐柏县'
        },
        {
            'code': '411381',
            'val': '邓州市'
        }
    ],
    '411400': [
        {
            'code': '411401',
            'val': '市辖区'
        },
        {
            'code': '411402',
            'val': '梁园区'
        },
        {
            'code': '411403',
            'val': '睢阳区'
        },
        {
            'code': '411421',
            'val': '民权县'
        },
        {
            'code': '411422',
            'val': '睢县'
        },
        {
            'code': '411423',
            'val': '宁陵县'
        },
        {
            'code': '411424',
            'val': '柘城县'
        },
        {
            'code': '411425',
            'val': '虞城县'
        },
        {
            'code': '411426',
            'val': '夏邑县'
        },
        {
            'code': '411481',
            'val': '永城市'
        }
    ],
    '411500': [
        {
            'code': '411501',
            'val': '市辖区'
        },
        {
            'code': '411502',
            'val': '浉河区'
        },
        {
            'code': '411503',
            'val': '平桥区'
        },
        {
            'code': '411521',
            'val': '罗山县'
        },
        {
            'code': '411522',
            'val': '光山县'
        },
        {
            'code': '411523',
            'val': '新县'
        },
        {
            'code': '411524',
            'val': '商城县'
        },
        {
            'code': '411525',
            'val': '固始县'
        },
        {
            'code': '411526',
            'val': '潢川县'
        },
        {
            'code': '411527',
            'val': '淮滨县'
        },
        {
            'code': '411528',
            'val': '息县'
        }
    ],
    '411600': [
        {
            'code': '411601',
            'val': '市辖区'
        },
        {
            'code': '411602',
            'val': '川汇区'
        },
        {
            'code': '411621',
            'val': '扶沟县'
        },
        {
            'code': '411622',
            'val': '西华县'
        },
        {
            'code': '411623',
            'val': '商水县'
        },
        {
            'code': '411624',
            'val': '沈丘县'
        },
        {
            'code': '411625',
            'val': '郸城县'
        },
        {
            'code': '411626',
            'val': '淮阳县'
        },
        {
            'code': '411627',
            'val': '太康县'
        },
        {
            'code': '411628',
            'val': '鹿邑县'
        },
        {
            'code': '411681',
            'val': '项城市'
        }
    ],
    '411700': [
        {
            'code': '411701',
            'val': '市辖区'
        },
        {
            'code': '411702',
            'val': '驿城区'
        },
        {
            'code': '411721',
            'val': '西平县'
        },
        {
            'code': '411722',
            'val': '上蔡县'
        },
        {
            'code': '411723',
            'val': '平舆县'
        },
        {
            'code': '411724',
            'val': '正阳县'
        },
        {
            'code': '411725',
            'val': '确山县'
        },
        {
            'code': '411726',
            'val': '泌阳县'
        },
        {
            'code': '411727',
            'val': '汝南县'
        },
        {
            'code': '411728',
            'val': '遂平县'
        },
        {
            'code': '411729',
            'val': '新蔡县'
        }
    ],
    '419000': [
        {
            'code': '419001',
            'val': '济源市'
        }
    ]
};



export const dhProvinces = [
    {
        'code': '320000',
        'val': '江苏省'
    },
    {
        'code': '370000',
        'val': '山东省'
    }
];

export const dhCitys = {
    '320000': [
        {
            'code': '320100',
            'val': '南京市'
        },
        {
            'code': '320200',
            'val': '无锡市'
        },
        {
            'code': '320300',
            'val': '徐州市'
        },
        {
            'code': '320400',
            'val': '常州市'
        },
        {
            'code': '320500',
            'val': '苏州市'
        },
        {
            'code': '320600',
            'val': '南通市'
        },
        {
            'code': '320700',
            'val': '连云港市'
        },
        {
            'code': '320800',
            'val': '淮安市'
        },
        {
            'code': '320900',
            'val': '盐城市'
        },
        {
            'code': '321000',
            'val': '扬州市'
        },
        {
            'code': '321100',
            'val': '镇江市'
        },
        {
            'code': '321200',
            'val': '泰州市'
        },
        {
            'code': '321300',
            'val': '宿迁市'
        }
    ],
    '370000': [
        {
            'code': '370100',
            'val': '济南市'
        },
        {
            'code': '370200',
            'val': '青岛市'
        },
        {
            'code': '370300',
            'val': '淄博市'
        },
        {
            'code': '370400',
            'val': '枣庄市'
        },
        {
            'code': '370500',
            'val': '东营市'
        },
        {
            'code': '370600',
            'val': '烟台市'
        },
        {
            'code': '370700',
            'val': '潍坊市'
        },
        {
            'code': '370800',
            'val': '济宁市'
        },
        {
            'code': '370900',
            'val': '泰安市'
        },
        {
            'code': '371000',
            'val': '威海市'
        },
        {
            'code': '371100',
            'val': '日照市'
        },
        {
            'code': '371200',
            'val': '莱芜市'
        },
        {
            'code': '371300',
            'val': '临沂市'
        },
        {
            'code': '371400',
            'val': '德州市'
        },
        {
            'code': '371500',
            'val': '聊城市'
        },
        {
            'code': '371600',
            'val': '滨州市'
        },
        {
            'code': '371700',
            'val': '菏泽市'
        }
    ]
};
export const dhDistricts = {
    '320100': [
        {
            'code': '320101',
            'val': '市辖区'
        },
        {
            'code': '320102',
            'val': '玄武区'
        },
        {
            'code': '320103',
            'val': '白下区'
        },
        {
            'code': '320104',
            'val': '秦淮区'
        },
        {
            'code': '320105',
            'val': '建邺区'
        },
        {
            'code': '320106',
            'val': '鼓楼区'
        },
        {
            'code': '320107',
            'val': '下关区'
        },
        {
            'code': '320111',
            'val': '浦口区'
        },
        {
            'code': '320113',
            'val': '栖霞区'
        },
        {
            'code': '320114',
            'val': '雨花台区'
        },
        {
            'code': '320115',
            'val': '江宁区'
        },
        {
            'code': '320116',
            'val': '六合区'
        },
        {
            'code': '320124',
            'val': '溧水县'
        },
        {
            'code': '320125',
            'val': '高淳县'
        }
    ],
    '320200': [
        {
            'code': '320201',
            'val': '市辖区'
        },
        {
            'code': '320202',
            'val': '崇安区'
        },
        {
            'code': '320203',
            'val': '南长区'
        },
        {
            'code': '320204',
            'val': '北塘区'
        },
        {
            'code': '320205',
            'val': '锡山区'
        },
        {
            'code': '320206',
            'val': '惠山区'
        },
        {
            'code': '320211',
            'val': '滨湖区'
        },
        {
            'code': '320281',
            'val': '江阴市'
        },
        {
            'code': '320282',
            'val': '宜兴市'
        }
    ],
    '320300': [
        {
            'code': '320301',
            'val': '市辖区'
        },
        {
            'code': '320302',
            'val': '鼓楼区'
        },
        {
            'code': '320303',
            'val': '云龙区'
        },
        {
            'code': '320304',
            'val': '九里区'
        },
        {
            'code': '320305',
            'val': '贾汪区'
        },
        {
            'code': '320311',
            'val': '泉山区'
        },
        {
            'code': '320321',
            'val': '丰县'
        },
        {
            'code': '320322',
            'val': '沛县'
        },
        {
            'code': '320323',
            'val': '铜山县'
        },
        {
            'code': '320324',
            'val': '睢宁县'
        },
        {
            'code': '320381',
            'val': '新沂市'
        },
        {
            'code': '320382',
            'val': '邳州市'
        }
    ],
    '320400': [
        {
            'code': '320401',
            'val': '市辖区'
        },
        {
            'code': '320402',
            'val': '天宁区'
        },
        {
            'code': '320404',
            'val': '钟楼区'
        },
        {
            'code': '320405',
            'val': '戚墅堰区'
        },
        {
            'code': '320411',
            'val': '新北区'
        },
        {
            'code': '320412',
            'val': '武进区'
        },
        {
            'code': '320481',
            'val': '溧阳市'
        },
        {
            'code': '320482',
            'val': '金坛市'
        }
    ],
    '320500': [
        {
            'code': '320501',
            'val': '市辖区'
        },
        {
            'code': '320502',
            'val': '沧浪区'
        },
        {
            'code': '320503',
            'val': '平江区'
        },
        {
            'code': '320504',
            'val': '金阊区'
        },
        {
            'code': '320505',
            'val': '虎丘区'
        },
        {
            'code': '320506',
            'val': '吴中区'
        },
        {
            'code': '320507',
            'val': '相城区'
        },
        {
            'code': '320581',
            'val': '常熟市'
        },
        {
            'code': '320582',
            'val': '张家港市'
        },
        {
            'code': '320583',
            'val': '昆山市'
        },
        {
            'code': '320584',
            'val': '吴江市'
        },
        {
            'code': '320585',
            'val': '太仓市'
        }
    ],
    '320600': [
        {
            'code': '320601',
            'val': '市辖区'
        },
        {
            'code': '320602',
            'val': '崇川区'
        },
        {
            'code': '320611',
            'val': '港闸区'
        },
        {
            'code': '320621',
            'val': '海安县'
        },
        {
            'code': '320623',
            'val': '如东县'
        },
        {
            'code': '320681',
            'val': '启东市'
        },
        {
            'code': '320682',
            'val': '如皋市'
        },
        {
            'code': '320683',
            'val': '通州市'
        },
        {
            'code': '320684',
            'val': '海门市'
        }
    ],
    '320700': [
        {
            'code': '320701',
            'val': '市辖区'
        },
        {
            'code': '320703',
            'val': '连云区'
        },
        {
            'code': '320705',
            'val': '新浦区'
        },
        {
            'code': '320706',
            'val': '海州区'
        },
        {
            'code': '320721',
            'val': '赣榆县'
        },
        {
            'code': '320722',
            'val': '东海县'
        },
        {
            'code': '320723',
            'val': '灌云县'
        },
        {
            'code': '320724',
            'val': '灌南县'
        }
    ],
    '320800': [
        {
            'code': '320801',
            'val': '市辖区'
        },
        {
            'code': '320802',
            'val': '清河区'
        },
        {
            'code': '320803',
            'val': '楚州区'
        },
        {
            'code': '320804',
            'val': '淮阴区'
        },
        {
            'code': '320811',
            'val': '清浦区'
        },
        {
            'code': '320826',
            'val': '涟水县'
        },
        {
            'code': '320829',
            'val': '洪泽县'
        },
        {
            'code': '320830',
            'val': '盱眙县'
        },
        {
            'code': '320831',
            'val': '金湖县'
        }
    ],
    '320900': [
        {
            'code': '320901',
            'val': '市辖区'
        },
        {
            'code': '320902',
            'val': '亭湖区'
        },
        {
            'code': '320903',
            'val': '盐都区'
        },
        {
            'code': '320921',
            'val': '响水县'
        },
        {
            'code': '320922',
            'val': '滨海县'
        },
        {
            'code': '320923',
            'val': '阜宁县'
        },
        {
            'code': '320924',
            'val': '射阳县'
        },
        {
            'code': '320925',
            'val': '建湖县'
        },
        {
            'code': '320981',
            'val': '东台市'
        },
        {
            'code': '320982',
            'val': '大丰市'
        }
    ],
    '321000': [
        {
            'code': '321001',
            'val': '市辖区'
        },
        {
            'code': '321002',
            'val': '广陵区'
        },
        {
            'code': '321003',
            'val': '邗江区'
        },
        {
            'code': '321011',
            'val': '维扬区'
        },
        {
            'code': '321023',
            'val': '宝应县'
        },
        {
            'code': '321081',
            'val': '仪征市'
        },
        {
            'code': '321084',
            'val': '高邮市'
        },
        {
            'code': '321088',
            'val': '江都市'
        }
    ],
    '321100': [
        {
            'code': '321101',
            'val': '市辖区'
        },
        {
            'code': '321102',
            'val': '京口区'
        },
        {
            'code': '321111',
            'val': '润州区'
        },
        {
            'code': '321112',
            'val': '丹徒区'
        },
        {
            'code': '321181',
            'val': '丹阳市'
        },
        {
            'code': '321182',
            'val': '扬中市'
        },
        {
            'code': '321183',
            'val': '句容市'
        }
    ],
    '321200': [
        {
            'code': '321201',
            'val': '市辖区'
        },
        {
            'code': '321202',
            'val': '海陵区'
        },
        {
            'code': '321203',
            'val': '高港区'
        },
        {
            'code': '321281',
            'val': '兴化市'
        },
        {
            'code': '321282',
            'val': '靖江市'
        },
        {
            'code': '321283',
            'val': '泰兴市'
        },
        {
            'code': '321284',
            'val': '姜堰市'
        }
    ],
    '321300': [
        {
            'code': '321301',
            'val': '市辖区'
        },
        {
            'code': '321302',
            'val': '宿城区'
        },
        {
            'code': '321311',
            'val': '宿豫区'
        },
        {
            'code': '321321',
            'val': '宿豫县'
        },
        {
            'code': '321322',
            'val': '沭阳县'
        },
        {
            'code': '321323',
            'val': '泗阳县'
        },
        {
            'code': '321324',
            'val': '泗洪县'
        }
    ],
    '370100': [
        {
            'code': '370101',
            'val': '市辖区'
        },
        {
            'code': '370102',
            'val': '历下区'
        },
        {
            'code': '370103',
            'val': '市中区'
        },
        {
            'code': '370104',
            'val': '槐荫区'
        },
        {
            'code': '370105',
            'val': '天桥区'
        },
        {
            'code': '370106',
            'val': '高新区'
        },
        {
            'code': '370112',
            'val': '历城区'
        },
        {
            'code': '370113',
            'val': '长清区'
        },
        {
            'code': '370124',
            'val': '平阴县'
        },
        {
            'code': '370125',
            'val': '济阳县'
        },
        {
            'code': '370126',
            'val': '商河县'
        },
        {
            'code': '370181',
            'val': '章丘市'
        }
    ],
    '370200': [
        {
            'code': '370201',
            'val': '市辖区'
        },
        {
            'code': '370202',
            'val': '市南区'
        },
        {
            'code': '370203',
            'val': '市北区'
        },
        {
            'code': '370205',
            'val': '四方区'
        },
        {
            'code': '370211',
            'val': '黄岛区'
        },
        {
            'code': '370212',
            'val': '崂山区'
        },
        {
            'code': '370213',
            'val': '李沧区'
        },
        {
            'code': '370214',
            'val': '城阳区'
        },
        {
            'code': '370281',
            'val': '胶州市'
        },
        {
            'code': '370282',
            'val': '即墨市'
        },
        {
            'code': '370283',
            'val': '平度市'
        },
        {
            'code': '370284',
            'val': '胶南市'
        },
        {
            'code': '370285',
            'val': '莱西市'
        }
    ],
    '370300': [
        {
            'code': '370301',
            'val': '市辖区'
        },
        {
            'code': '370302',
            'val': '淄川区'
        },
        {
            'code': '370303',
            'val': '张店区'
        },
        {
            'code': '370304',
            'val': '博山区'
        },
        {
            'code': '370305',
            'val': '临淄区'
        },
        {
            'code': '370306',
            'val': '周村区'
        },
        {
            'code': '370321',
            'val': '桓台县'
        },
        {
            'code': '370322',
            'val': '高青县'
        },
        {
            'code': '370323',
            'val': '沂源县'
        }
    ],
    '370400': [
        {
            'code': '370401',
            'val': '市辖区'
        },
        {
            'code': '370402',
            'val': '市中区'
        },
        {
            'code': '370403',
            'val': '薛城区'
        },
        {
            'code': '370404',
            'val': '峄城区'
        },
        {
            'code': '370405',
            'val': '台儿庄区'
        },
        {
            'code': '370406',
            'val': '山亭区'
        },
        {
            'code': '370481',
            'val': '滕州市'
        }
    ],
    '370500': [
        {
            'code': '370501',
            'val': '市辖区'
        },
        {
            'code': '370502',
            'val': '东营区'
        },
        {
            'code': '370503',
            'val': '河口区'
        },
        {
            'code': '370521',
            'val': '垦利县'
        },
        {
            'code': '370522',
            'val': '利津县'
        },
        {
            'code': '370523',
            'val': '广饶县'
        }
    ],
    '370600': [
        {
            'code': '370601',
            'val': '市辖区'
        },
        {
            'code': '370602',
            'val': '芝罘区'
        },
        {
            'code': '370611',
            'val': '福山区'
        },
        {
            'code': '370612',
            'val': '牟平区'
        },
        {
            'code': '370613',
            'val': '莱山区'
        },
        {
            'code': '370618',
            'val': '开发区'
        },
        {
            'code': '370634',
            'val': '长岛县'
        },
        {
            'code': '370681',
            'val': '龙口市'
        },
        {
            'code': '370682',
            'val': '莱阳市'
        },
        {
            'code': '370683',
            'val': '莱州市'
        },
        {
            'code': '370684',
            'val': '蓬莱市'
        },
        {
            'code': '370685',
            'val': '招远市'
        },
        {
            'code': '370686',
            'val': '栖霞市'
        },
        {
            'code': '370687',
            'val': '海阳市'
        }
    ],
    '370700': [
        {
            'code': '370701',
            'val': '市辖区'
        },
        {
            'code': '370702',
            'val': '潍城区'
        },
        {
            'code': '370703',
            'val': '寒亭区'
        },
        {
            'code': '370704',
            'val': '坊子区'
        },
        {
            'code': '370705',
            'val': '奎文区'
        },
        {
            'code': '370724',
            'val': '临朐县'
        },
        {
            'code': '370725',
            'val': '昌乐县'
        },
        {
            'code': '370781',
            'val': '青州市'
        },
        {
            'code': '370782',
            'val': '诸城市'
        },
        {
            'code': '370783',
            'val': '寿光市'
        },
        {
            'code': '370784',
            'val': '安丘市'
        },
        {
            'code': '370785',
            'val': '高密市'
        },
        {
            'code': '370786',
            'val': '昌邑市'
        }
    ],
    '370800': [
        {
            'code': '370801',
            'val': '市辖区'
        },
        {
            'code': '370802',
            'val': '市中区'
        },
        {
            'code': '370811',
            'val': '任城区'
        },
        {
            'code': '370826',
            'val': '微山县'
        },
        {
            'code': '370827',
            'val': '鱼台县'
        },
        {
            'code': '370828',
            'val': '金乡县'
        },
        {
            'code': '370829',
            'val': '嘉祥县'
        },
        {
            'code': '370830',
            'val': '汶上县'
        },
        {
            'code': '370831',
            'val': '泗水县'
        },
        {
            'code': '370832',
            'val': '梁山县'
        },
        {
            'code': '370881',
            'val': '曲阜市'
        },
        {
            'code': '370882',
            'val': '兖州市'
        },
        {
            'code': '370883',
            'val': '邹城市'
        }
    ],
    '370900': [
        {
            'code': '370901',
            'val': '市辖区'
        },
        {
            'code': '370902',
            'val': '泰山区'
        },
        {
            'code': '370903',
            'val': '岱岳区'
        },
        {
            'code': '370921',
            'val': '宁阳县'
        },
        {
            'code': '370923',
            'val': '东平县'
        },
        {
            'code': '370982',
            'val': '新泰市'
        },
        {
            'code': '370983',
            'val': '肥城市'
        }
    ],
    '371000': [
        {
            'code': '371001',
            'val': '市辖区'
        },
        {
            'code': '371002',
            'val': '环翠区'
        },
        {
            'code': '371081',
            'val': '文登市'
        },
        {
            'code': '371082',
            'val': '荣成市'
        },
        {
            'code': '371083',
            'val': '乳山市'
        }
    ],
    '371100': [
        {
            'code': '371101',
            'val': '市辖区'
        },
        {
            'code': '371102',
            'val': '东港区'
        },
        {
            'code': '371103',
            'val': '岚山区'
        },
        {
            'code': '371121',
            'val': '五莲县'
        },
        {
            'code': '371122',
            'val': '莒县'
        }
    ],
    '371200': [
        {
            'code': '371201',
            'val': '市辖区'
        },
        {
            'code': '371202',
            'val': '莱城区'
        },
        {
            'code': '371203',
            'val': '钢城区'
        }
    ],
    '371300': [
        {
            'code': '371301',
            'val': '市辖区'
        },
        {
            'code': '371302',
            'val': '兰山区'
        },
        {
            'code': '371311',
            'val': '罗庄区'
        },
        {
            'code': '371312',
            'val': '河东区'
        },
        {
            'code': '371321',
            'val': '沂南县'
        },
        {
            'code': '371322',
            'val': '郯城县'
        },
        {
            'code': '371323',
            'val': '沂水县'
        },
        {
            'code': '371324',
            'val': '苍山县'
        },
        {
            'code': '371325',
            'val': '费县'
        },
        {
            'code': '371326',
            'val': '平邑县'
        },
        {
            'code': '371327',
            'val': '莒南县'
        },
        {
            'code': '371328',
            'val': '蒙阴县'
        },
        {
            'code': '371329',
            'val': '临沭县'
        }
    ],
    '371400': [
        {
            'code': '371401',
            'val': '市辖区'
        },
        {
            'code': '371402',
            'val': '德城区'
        },
        {
            'code': '371421',
            'val': '陵县'
        },
        {
            'code': '371422',
            'val': '宁津县'
        },
        {
            'code': '371423',
            'val': '庆云县'
        },
        {
            'code': '371424',
            'val': '临邑县'
        },
        {
            'code': '371425',
            'val': '齐河县'
        },
        {
            'code': '371426',
            'val': '平原县'
        },
        {
            'code': '371427',
            'val': '夏津县'
        },
        {
            'code': '371428',
            'val': '武城县'
        },
        {
            'code': '371481',
            'val': '乐陵市'
        },
        {
            'code': '371482',
            'val': '禹城市'
        }
    ],
    '371500': [
        {
            'code': '371501',
            'val': '市辖区'
        },
        {
            'code': '371502',
            'val': '东昌府区'
        },
        {
            'code': '371521',
            'val': '阳谷县'
        },
        {
            'code': '371522',
            'val': '莘县'
        },
        {
            'code': '371523',
            'val': '茌平县'
        },
        {
            'code': '371524',
            'val': '东阿县'
        },
        {
            'code': '371525',
            'val': '冠县'
        },
        {
            'code': '371526',
            'val': '高唐县'
        },
        {
            'code': '371581',
            'val': '临清市'
        }
    ],
    '371600': [
        {
            'code': '371601',
            'val': '市辖区'
        },
        {
            'code': '371602',
            'val': '滨城区'
        },
        {
            'code': '371621',
            'val': '惠民县'
        },
        {
            'code': '371622',
            'val': '阳信县'
        },
        {
            'code': '371623',
            'val': '无棣县'
        },
        {
            'code': '371624',
            'val': '沾化县'
        },
        {
            'code': '371625',
            'val': '博兴县'
        },
        {
            'code': '371626',
            'val': '邹平县'
        }
    ],
    '371700': [
        {
            'code': '371701',
            'val': '市辖区'
        },
        {
            'code': '371702',
            'val': '牡丹区'
        },
        {
            'code': '371721',
            'val': '曹县'
        },
        {
            'code': '371722',
            'val': '单县'
        },
        {
            'code': '371723',
            'val': '成武县'
        },
        {
            'code': '371724',
            'val': '巨野县'
        },
        {
            'code': '371725',
            'val': '郓城县'
        },
        {
            'code': '371726',
            'val': '鄄城县'
        },
        {
            'code': '371727',
            'val': '定陶县'
        },
        {
            'code': '371728',
            'val': '东明县'
        }
    ]
};
